
#结巴分词对应的词性-中文解释标记对
Tag2Chinese = {
    "a" : "形容词", "ad" : "副形词", "ag" : "形语素",
    "an" : "名形词", "b" : "区别词", "c" : "连词",
    "d" : "副词", "dg" : "副词素", "e" : "叹词",
    "f" : "方位词", "h" : "前接成分", "i" : "成语",
    "j" : "简称略语", "k" : "后接成分", "l" : "习用语",
    "m" : "数词", "mq" : "数量词", "n" : "名词",
    "nr" : "人名", "nrfg" : "人名", "nrt" : "外国人名",
    "ns" : "地名", "nt" : "机构团体", "nz" : "其他专名",
    "o" : "拟声词", "p" : "介词", "q" : "量词",
    "r" : "代词", "rr" : "代词", "rz" : "代词",
    "s" : "处所词", "t" : "时间词", "u" : "助词",
    "ud" : "助词", "ug" : "助词", "uj" : "助词",
    "ul" : "助词", "uv" : "助词", "uz" : "助词",
    "v" : "动词", "vi" : "动词", "vq" : "动词",
    "vn" : "名动词", "y" : "语气词", "z" : "状态词",
    "zg" : "状态词",
}

#Log文件存放目录
LogFilePath = "logging/"