[
    {
        "q": "糖尿病人能吃白果吗",
        "a": "糖尿病人是不建议吃白果的，白果中含糖量较高，如果吃的过多，还会出现腹痛、发热及呼吸困难等。糖尿病病人要严格遵守医生的医嘱，按时服用降糖药物及注射胰岛素。平时不要吃含糖量较高的食物，如：点心、蛋糕等；进行适量的体育运动；要少食多餐，不可暴饮暴食。"
    },
    {
        "q": "产后查血糖的标准值是多少?",
        "a": "产后的血糖值与一般的成人的血糖正常值范围是基本一样的。空腹的血糖值一般也是在3.9~6.11毫摩尔每升之间。如果是低于3.9的话，当然就属于低血糖了，如果高于6.11的话，还需要进行其他检查，比如做饭后两小时的血糖测定，75克糖耐量实验，以及检查尿糖等情况，综合考虑，诊断治疗。"
    },
    {
        "q": "血糖升高的原因有什么？",
        "a": "血糖升高的原因主要包括以下几点。1.由于自身身体状况的原因，导致胰岛细胞功能破坏，胰岛素明显分泌不足，会出现血糖升高现象。2.因为饮食不当，摄入过多的糖分胰岛素分泌不足，不能够及时的代谢身体内部的糖分。3.胰岛素抵抗导致胰岛素作用障碍，会出现高血糖或糖尿病等现象。"
    },
    {
        "q": "糖尿病感冒了吃什么药",
        "a": "糖尿病患者感冒期间，需要分清感冒的性质后，选择正确的感冒药物进行治疗。如果表现为清鼻涕较为明显，伴随有发冷症状，多考虑属于风寒感冒，可以选择疏风散寒的中成药。如果黄鼻涕较为明显，伴随有发烧、出汗等症状，一般多考虑属于风热感冒，可以选择清热解毒的中成药进行治疗。"
    },
    {
        "q": "孕期测血糖大轮廓的标准值是多少",
        "a": "孕期同样需要定期监测血糖变化预防或者明确是否有妊娠期糖尿病，尤其是怀孕24~28周需要做妊娠期糖耐量试验确诊。平时测量空腹血糖最好不超过6.1nmol/L, 餐后两小时血糖不超过11.1nmol/L。如果提示偏高，还需要进一步检查糖化血红蛋白，胰岛素功能测定等评估。"
    },
    {
        "q": "请问斯皮仁诺导致血糖增高吗",
        "a": "斯皮仁诺是一种抗真菌的药物，这种药物并不会导致出现有血糖升高的情况，出现有血糖偏高，主要考虑是饮食不当的原因，同时也考虑是体重过于偏胖，也考虑和遗传等都有一定的关系，还是要明确具体是哪一种类型的糖尿病。做好饮食方面的调理，配合运动锻炼，也可以适当配合降糖药物进行治疗。"
    },
    {
        "q": "无乳糖牛奶糖尿病人能喝吗",
        "a": "糖尿病患者是可以饮用无乳糖牛奶的，喝乳糖奶粉会影响血糖，有些糖尿病患者对乳糖不耐受会出现腹胀，腹痛腹泻现象，而无乳糖牛奶对糖尿病患者来说，既不影响血糖，又不会出现乳糖不耐受的现象，对糖尿病是有好处的，一天饮用量在300克以内，最好不要喝的太多。"
    },
    {
        "q": "糖尿病引起的口干口苦,怎么办?",
        "a": "糖尿病患者引起口干口苦，首先要控制好血糖，可以在医生指导下服用一些药物来进行控制，还要特别注意饮食，应该多吃清淡的食物，尽量减少甜食物的摄入，或者不吃甜性的食物，以免使血糖增高，还可以适当的多喝水来缓解口干的现象，定期的去医院进行检查和测血糖。"
    },
    {
        "q": "妊娠期血糖高引起的腿痒怎么办",
        "a": "妊娠期如果出现有血糖偏高的问题，会产生有腿部瘙痒的现象，主要可以考虑通过控制血糖的方法来进行改善，避免用力的搔抓，否则容易产生有皮肤的破损导致有愈合不良的现象。同时注意保持局部的卫生清洁，以免造成感染，一般需要生产完之后再考虑采取药物的方法进行治疗。"
    },
    {
        "q": "糖尿病引起的是阴虚还是阳虚呀，",
        "a": "糖尿病在中医理论中分型很多。包括阴虚，阳虚，湿热等等。目前比较多见的是阴虚症。但糖尿病发展到一定程度的时候，也会合并有阳虚。常见的糖尿病症型有肺热阴伤，胃热，脾胃虚弱，肝肾阴虚，脾肾阳虚等等，具体情况需要中医师通过望闻问切，四诊合参来辨证论治。"
    },
    {
        "q": "糖尿病人眼睛白内障",
        "a": "糖尿病人出现白内障主要诱因是血糖升高，糖代谢紊乱影响到晶体出现病理变化，白内障的治疗主要是通过手术治疗，但高血糖会影响到手术治疗，所以在手术前要控制血糖在9mmol/L以下，不会影响到手术，血糖不稳定会影响到手术后期恢复，导致感染，伤口愈合不良等问题。"
    },
    {
        "q": "我有高血糖野生灵芝有毒吗",
        "a": "野生灵芝的安全性是不能保证的，是否有毒也是不能确定的。野生灵芝的生长环境并不能确定，在生长的过程当中可能也会受到细菌的感染，所以不建议购买野生灵芝。正常的灵芝，具有治疗高血压，高血脂等一些疾病的作用，可有效地预防心脑血管疾病的发生，灵芝的营养成分非常的高。"
    },
    {
        "q": "糖尿病患者能吃复方乌鸡口服液吗",
        "a": "糖尿病患者是可以口服乌鸡口服液进行调理的，最好是在饭后一小时后服用，月经期间要注意保暖，避免着凉，尤其是腹部保暖，多喝一些红糖水或者是红糖姜茶，注意休息好，糖尿病患者平时要控制饮食，尽量不要多吃含糖量较高的食物或者食品，同时可以适当运动和锻炼，按时服用降糖药物控制血糖。"
    },
    {
        "q": "糖尿病人眼睛白内障",
        "a": "糖尿病人出现白内障主要诱因是血糖升高，糖代谢紊乱影响到晶体出现病理变化，白内障的治疗主要是通过手术治疗，但高血糖会影响到手术治疗，所以在手术前要控制血糖在9mmol/L以下，不会影响到手术，血糖不稳定会影响到手术后期恢复，导致感染，伤口愈合不良等问题。"
    },
    {
        "q": "我有高血糖野生灵芝有毒吗",
        "a": "野生灵芝的安全性是不能保证的，是否有毒也是不能确定的。野生灵芝的生长环境并不能确定，在生长的过程当中可能也会受到细菌的感染，所以不建议购买野生灵芝。正常的灵芝，具有治疗高血压，高血脂等一些疾病的作用，可有效地预防心脑血管疾病的发生，灵芝的营养成分非常的高。"
    },
    {
        "q": "糖尿病患者能吃复方乌鸡口服液吗",
        "a": "糖尿病患者是可以口服乌鸡口服液进行调理的，最好是在饭后一小时后服用，月经期间要注意保暖，避免着凉，尤其是腹部保暖，多喝一些红糖水或者是红糖姜茶，注意休息好，糖尿病患者平时要控制饮食，尽量不要多吃含糖量较高的食物或者食品，同时可以适当运动和锻炼，按时服用降糖药物控制血糖。"
    },
    {
        "q": "糖尿病人眼睛白内障",
        "a": "糖尿病人出现白内障主要诱因是血糖升高，糖代谢紊乱影响到晶体出现病理变化，白内障的治疗主要是通过手术治疗，但高血糖会影响到手术治疗，所以在手术前要控制血糖在9mmol/L以下，不会影响到手术，血糖不稳定会影响到手术后期恢复，导致感染，伤口愈合不良等问题。"
    },
    {
        "q": "糖尿病人每天吃什么主食？",
        "a": "糖尿病人的主食没有特别的限制，五谷杂粮都可以吃，只是需要注意主食的摄入量，并且可以适当多吃一些粗粮，如玉米面、荞麦面、燕麦片等，日常白面、大米等也可以吃，在吃的时候规定好量。除了主食多样化，水果蔬菜、鱼类、肉类都需要适当吃一些，饭后监测好血糖，忌暴饮暴食。"
    },
    {
        "q": "无乳糖牛奶糖尿病人能喝吗",
        "a": "糖尿病患者是可以饮用无乳糖牛奶的，喝乳糖奶粉会影响血糖，有些糖尿病患者对乳糖不耐受会出现腹胀，腹痛腹泻现象，而无乳糖牛奶对糖尿病患者来说，既不影响血糖，又不会出现乳糖不耐受的现象，对糖尿病是有好处的，一天饮用量在300克以内，最好不要喝的太多。"
    },
    {
        "q": "血糖高可以吃哪些水果？",
        "a": "血糖高，如果控制不好的话，建议吃一些低糖水果，可以吃柠檬柚子，火龙果，车厘子，猕猴桃，这些水果含糖比较低，可以正常吃的，对于血糖高，很可能是有糖尿病了，所以需要尽快去医院做检查，如果是二型糖尿病，那就需要尽快使用降糖药物治疗比较好，可以用二甲双胍肠溶片治疗，平时需要注意饮食，不要过多吃含糖过高的食物。"
    },
    {
        "q": "高血糖不能吃的食物和水果",
        "a": "建议食用血糖指数较低的食物和水果，比如苹果、猕猴桃、白心柚等，血糖指数较低，短期内不会引起血糖波动。不过，芒果、红心火龙果、西瓜等糖分指数相对较高。高血糖患者进食后，血糖会在短时间内升高，引起血糖波动，不利于血糖的控制。建议糖尿病患者和其他患者在吃水果时，在血糖控制稳定的情况下，在餐间加一定量的水果。所以吃水果的原则是吃低糖指数的水果。"
    },
    {
        "q": "餐后血糖高吃什么药好?",
        "a": "餐后血糖高，常用的药物：餐后血糖是7.8-10mol/L，可以口服阿卡波糖，如贝塔地平、卡氮平或DPP4抑制剂，大多根据患者的经济状况、耐受性、个性化选择。胰岛素分泌药磺酰脲类药物如格列美脲、格列齐特和瑞格列奈可用于严重的餐后高血糖患者。但是如果血糖偏高，不会有太大的不适，但是过度疲劳后，会突然出现眩晕感。当这些症状出现时，要及时进行检查和治疗，以免恶化为糖尿病。"
    },
    {
        "q": "怀孕空腹血糖高怎么办？",
        "a": "怀孕了，出现了空腹血糖高的情况，这个期间首先需要低糖饮食，同时需要进一步的做妊娠糖耐量试验，来判断有没有妊娠合并糖尿病的现象，如果只是单纯血糖偏高，大多通过饮食调理，可以降到正常，但如果确定是合并糖尿病的情况，大多就需要积极的降血糖治疗，必要时就需要应用药物治疗，可以遵从医嘱，平时要注意饮食控制。"
    },
    {
        "q": "妊娠期糖尿病,对胎儿成长发育有影响吗?",
        "a": "妊娠期糖尿病对胎儿成长是有影响的，首先早期的妊娠期糖尿病会导致胎儿先天性畸形的发生，多见于心脑血管畸形。糖尿病容易导致酮症酸中毒引发胎儿缺氧导致死胎。同时血糖升高也会增加巨大儿或者导致胎儿生长发育迟缓，孩子太小。孩子出生后出现儿童肥胖或者是小儿糖尿病比例增高。"
    },
    {
        "q": "如何判断孕妇是不是得了妊娠期糖尿病?",
        "a": "临床上可以根据患者的症状以及血糖水平来帮助判断孕妇是否得了妊娠期糖尿病。妊娠期糖尿病的患者会出现多饮、多食、多尿等一系列临床表现。这个时候女性应该去医院进行空腹血糖的测定。通过进行血糖的测定，可以帮助判断女性的病情。妊娠期糖尿病的患者可以通过注射胰岛素来帮助维持正常的血糖水平。"
    },
    {
        "q": "消渴丸多少钱一盒？",
        "a": "消渴丸一盒的费用一般都是在几十块钱到一百块钱左右的，但是因为不同的药物规格，不同的药店以及生产商不同，所在地消费水平不同，这些相关的情况，都是有可能会导致费用会有所不同，建议去药店咨询相关的价格，一定要选择正规的药店购买药物，又或者是去医院开。"
    },
    {
        "q": "干细胞可以治疗糖尿病吗？",
        "a": "目前已经有干细胞移植来达到糖尿病的目的。不过现在还只是动物的实验，人体的实验还只是少部分。干细胞移植治疗糖尿病并没有全面开展。所以风险和副作用等目前都是未知数，不建议尝试。糖尿病人平时要注意吃少糖的食物，建议去医院检查来积极配合医生的安排进行治疗。"
    },
    {
        "q": "低血糖会引起糖尿病吗",
        "a": "低血糖这种情况考虑并不是存在糖尿病的，一般存在低血糖反应，主要考虑是由于存在一定的营养状态不良有关，如果有必要的情况下建议还是需要及时保证营养状态水平，平时需要饮食生活自己多注意的，适当多吃点高蛋白的食物。建议需要及时到医院完善内分泌检查，看一看有没有存在异常。"
    },
    {
        "q": "糖尿病能喝茶叶茶吗",
        "a": "患有糖尿病人群，也是可以喝茶叶的，不会造成多大的影响，并且喝茶的话，对于糖尿病人还是有益处的，因为茶叶中含有丰富的无机盐离子和茶多酚，所以平时没事喝茶的话，对身体还可以起到保健的作用，特别是喝绿茶，更可以起到抗辐射，保健养生的效果会更加明显一些。"
    },
    {
        "q": "多吃糖会得糖尿病吗",
        "a": "吃糖多并不会直接导致糖尿病，糖尿病是由胰岛素缺乏而导致的一种疾病，但是平时建议还是不要多吃糖类，吃得太多糖对身体健康是没有好处的，并不是吃糖引起的糖尿病，但是有糖尿病的情况下是绝对不可以再吃糖，有胰岛素的相对或绝对缺乏都可能会引起糖尿病发生。"
    },
    {
        "q": "妊娠期糖尿病能吃什么零食",
        "a": "妊娠期糖尿病的患者最好不要吃零食，糖尿病的饮食治疗是非常严格的，需要根据每日所需要的总热量来分配碳水化合物，脂肪以及蛋白质的摄入量，能够保证孕产妇和孩子的营养需要，也不会造成营养过剩，无法控制血糖的值，零食也是有一定的热量的，吃了零食之后要减少主食的量。"
    },
    {
        "q": "糖尿病人为什么不能吸烟？",
        "a": "糖尿病的患者最好是能够戒烟的，因为糖尿病的患者引起心脑血管并发症的几率比正常人要高，如果吸烟的话，更容易促进动脉硬化的发生。这些都是心脑血管疾病的危险因素。除了糖尿病，还有高血压，高脂血症，肥胖等都是心脑血管疾病的危险因素。平时要控制饮食，适当的运动，不要过度肥胖。"
    },
    {
        "q": "糖尿病人可以吃苹果吗？",
        "a": "糖尿病病人的严重程度不同，所以需要根据患者的血糖的水平，选择具体的饮食方式。大多数的糖尿病患者不可以吃苹果，因为苹果的含糖量非常的多，吃了苹果之后不容易控制血糖的水平。除了不能吃含糖量丰富的水果之外，糖尿病的患者还要减少主食的摄入量。否则主食里面的淀粉也会转化为糖分。"
    },
    {
        "q": "用胰岛素治疗糖尿病效果不是很明显",
        "a": "糖尿病注射胰岛素血糖没有下降可能是剂量不足导致的，或者诱发血糖的原因没有消除，需要到医院进行相关检查找出血糖高的原因进行治疗，同时在医生的指导下调整胰岛素剂量，饮食方面避免高糖高脂肪食物。做到少食多餐。避免持续性高血糖导致急性并发症酮症酸中毒等危机到患者生命。"
    },
    {
        "q": "我是糖尿病人请问我能吃红枣吗？",
        "a": "糖尿病病人可以吃黑枣干，只要不是意外加糖的就可以吃，加糖以后一定要注意，不能再吃太甜的食物，含糖量比较高的食物都可能会影响到糖尿病病人的治疗，需要注意进行空腹血糖的检查，根据具体病情来选择治疗方式出现了血糖高，有可能会发生并发症，黑枣没有意外加糖就可以吃。"
    },
    {
        "q": "血糖高可以吃哪些水果？",
        "a": "血糖高，如果控制不好的话，建议吃一些低糖水果，可以吃柠檬柚子，火龙果，车厘子，猕猴桃，这些水果含糖比较低，可以正常吃的，对于血糖高，很可能是有糖尿病了，所以需要尽快去医院做检查，如果是二型糖尿病，那就需要尽快使用降糖药物治疗比较好，可以用二甲双胍肠溶片治疗，平时需要注意饮食，不要过多吃含糖过高的食物。"
    },
    {
        "q": "糖尿病多年了，最近身体抵抗力下降，感冒了，不敢吃西药，能够使",
        "a": "你好，感冒类型不同使用的药物也不一样，特别是非处方类中成药物，讲究辨证论治，如果是风热性感冒可以使用抗病毒口服液，但是风寒性感冒患者不适合服用该药物。该药物性寒凉，风寒感冒患者用药后可能会加重病情；另外高血糖或者糖尿病患者慎用，因为该药物辅料为蜂蜜、蔗糖，容易升高血糖。"
    },
    {
        "q": "高血糖不能吃的食物和水果",
        "a": "建议食用血糖指数较低的食物和水果，比如苹果、猕猴桃、白心柚等，血糖指数较低，短期内不会引起血糖波动。不过，芒果、红心火龙果、西瓜等糖分指数相对较高。高血糖患者进食后，血糖会在短时间内升高，引起血糖波动，不利于血糖的控制。建议糖尿病患者和其他患者在吃水果时，在血糖控制稳定的情况下，在餐间加一定量的水果。所以吃水果的原则是吃低糖指数的水果。"
    },
    {
        "q": "餐后血糖高吃什么药好?",
        "a": "餐后血糖高，常用的药物：餐后血糖是7.8-10mol/L，可以口服阿卡波糖，如贝塔地平、卡氮平或DPP4抑制剂，大多根据患者的经济状况、耐受性、个性化选择。胰岛素分泌药磺酰脲类药物如格列美脲、格列齐特和瑞格列奈可用于严重的餐后高血糖患者。但是如果血糖偏高，不会有太大的不适，但是过度疲劳后，会突然出现眩晕感。当这些症状出现时，要及时进行检查和治疗，以免恶化为糖尿病。"
    },
    {
        "q": "怀孕空腹血糖高怎么办？",
        "a": "怀孕了，出现了空腹血糖高的情况，这个期间首先需要低糖饮食，同时需要进一步的做妊娠糖耐量试验，来判断有没有妊娠合并糖尿病的现象，如果只是单纯血糖偏高，大多通过饮食调理，可以降到正常，但如果确定是合并糖尿病的情况，大多就需要积极的降血糖治疗，必要时就需要应用药物治疗，可以遵从医嘱，平时要注意饮食控制。"
    },
    {
        "q": "妊娠期糖尿病,对胎儿成长发育有影响吗?",
        "a": "妊娠期糖尿病对胎儿成长是有影响的，首先早期的妊娠期糖尿病会导致胎儿先天性畸形的发生，多见于心脑血管畸形。糖尿病容易导致酮症酸中毒引发胎儿缺氧导致死胎。同时血糖升高也会增加巨大儿或者导致胎儿生长发育迟缓，孩子太小。孩子出生后出现儿童肥胖或者是小儿糖尿病比例增高。"
    },
    {
        "q": "如何判断孕妇是不是得了妊娠期糖尿病?",
        "a": "临床上可以根据患者的症状以及血糖水平来帮助判断孕妇是否得了妊娠期糖尿病。妊娠期糖尿病的患者会出现多饮、多食、多尿等一系列临床表现。这个时候女性应该去医院进行空腹血糖的测定。通过进行血糖的测定，可以帮助判断女性的病情。妊娠期糖尿病的患者可以通过注射胰岛素来帮助维持正常的血糖水平。"
    },
    {
        "q": "消渴丸多少钱一盒？",
        "a": "消渴丸一盒的费用一般都是在几十块钱到一百块钱左右的，但是因为不同的药物规格，不同的药店以及生产商不同，所在地消费水平不同，这些相关的情况，都是有可能会导致费用会有所不同，建议去药店咨询相关的价格，一定要选择正规的药店购买药物，又或者是去医院开。"
    },
    {
        "q": "干细胞可以治疗糖尿病吗？",
        "a": "目前已经有干细胞移植来达到糖尿病的目的。不过现在还只是动物的实验，人体的实验还只是少部分。干细胞移植治疗糖尿病并没有全面开展。所以风险和副作用等目前都是未知数，不建议尝试。糖尿病人平时要注意吃少糖的食物，建议去医院检查来积极配合医生的安排进行治疗。"
    },
    {
        "q": "我打胰岛素,过敏怎么办?",
        "a": "一旦出现胰岛素过敏应该及时停用这种药物，注意使用抗过敏的药物如氯雷他定或异丙嗪等药物，或者可以注意地塞米松等进行控制，出现休克者可注意肾上腺素等，具体用药需遵医嘱。出现胰岛素过敏主要表现为长皮疹或出现紫癜，另外还有出现局部的皮下脂肪萎缩，甚至低血糖等表现。建议在餐前半小时后注射胰岛素，在过后半小时按时用餐。"
    },
    {
        "q": "低血糖会引起糖尿病吗",
        "a": "低血糖这种情况考虑并不是存在糖尿病的，一般存在低血糖反应，主要考虑是由于存在一定的营养状态不良有关，如果有必要的情况下建议还是需要及时保证营养状态水平，平时需要饮食生活自己多注意的，适当多吃点高蛋白的食物。建议需要及时到医院完善内分泌检查，看一看有没有存在异常。"
    },
    {
        "q": "糖尿病能喝茶叶茶吗",
        "a": "患有糖尿病人群，也是可以喝茶叶的，不会造成多大的影响，并且喝茶的话，对于糖尿病人还是有益处的，因为茶叶中含有丰富的无机盐离子和茶多酚，所以平时没事喝茶的话，对身体还可以起到保健的作用，特别是喝绿茶，更可以起到抗辐射，保健养生的效果会更加明显一些。"
    },
    {
        "q": "多吃糖会得糖尿病吗",
        "a": "吃糖多并不会直接导致糖尿病，糖尿病是由胰岛素缺乏而导致的一种疾病，但是平时建议还是不要多吃糖类，吃得太多糖对身体健康是没有好处的，并不是吃糖引起的糖尿病，但是有糖尿病的情况下是绝对不可以再吃糖，有胰岛素的相对或绝对缺乏都可能会引起糖尿病发生。"
    },
    {
        "q": "妊娠期糖尿病能吃什么零食",
        "a": "妊娠期糖尿病的患者最好不要吃零食，糖尿病的饮食治疗是非常严格的，需要根据每日所需要的总热量来分配碳水化合物，脂肪以及蛋白质的摄入量，能够保证孕产妇和孩子的营养需要，也不会造成营养过剩，无法控制血糖的值，零食也是有一定的热量的，吃了零食之后要减少主食的量。"
    },
    {
        "q": "糖尿病人为什么不能吸烟？",
        "a": "糖尿病的患者最好是能够戒烟的，因为糖尿病的患者引起心脑血管并发症的几率比正常人要高，如果吸烟的话，更容易促进动脉硬化的发生。这些都是心脑血管疾病的危险因素。除了糖尿病，还有高血压，高脂血症，肥胖等都是心脑血管疾病的危险因素。平时要控制饮食，适当的运动，不要过度肥胖。"
    },
    {
        "q": "糖尿病人可以吃苹果吗？",
        "a": "糖尿病病人的严重程度不同，所以需要根据患者的血糖的水平，选择具体的饮食方式。大多数的糖尿病患者不可以吃苹果，因为苹果的含糖量非常的多，吃了苹果之后不容易控制血糖的水平。除了不能吃含糖量丰富的水果之外，糖尿病的患者还要减少主食的摄入量。否则主食里面的淀粉也会转化为糖分。"
    },
    {
        "q": "用胰岛素治疗糖尿病效果不是很明显",
        "a": "糖尿病注射胰岛素血糖没有下降可能是剂量不足导致的，或者诱发血糖的原因没有消除，需要到医院进行相关检查找出血糖高的原因进行治疗，同时在医生的指导下调整胰岛素剂量，饮食方面避免高糖高脂肪食物。做到少食多餐。避免持续性高血糖导致急性并发症酮症酸中毒等危机到患者生命。"
    },
    {
        "q": "我是糖尿病人请问我能吃红枣吗？",
        "a": "糖尿病病人可以吃黑枣干，只要不是意外加糖的就可以吃，加糖以后一定要注意，不能再吃太甜的食物，含糖量比较高的食物都可能会影响到糖尿病病人的治疗，需要注意进行空腹血糖的检查，根据具体病情来选择治疗方式出现了血糖高，有可能会发生并发症，黑枣没有意外加糖就可以吃。"
    },
    {
        "q": "糖尿病人适合喝什么茶好",
        "a": "糖尿病患者主要是需要严格控制饮食，限制碳水化合物的摄入，茶叶一般都是可以喝的，喝茶对于人体新陈代谢以及内分泌有调节作用，而且部分茶叶还能调节血糖；一般调节血糖的茶叶有普洱茶、黑茶，这些茶叶都是经过发酵的，饮用后能够调节人体肠道菌群，从而改善消化功能，有助于控制血糖。"
    },
    {
        "q": "糖尿病可以喝苏打水嘛？",
        "a": "糖尿病患者是可以喝苏打水的，苏打是指碳酸氢钠是碱性的物质，一般胃酸分泌过多、胃溃疡的患者，是可以多喝苏打水的，糖尿病是由于胰岛素分泌不足，胰岛功能下降而引起的，分为原发性糖尿病和继发性糖尿病，一型糖尿病和二型糖尿病，糖尿病患者期间注意饮食，避免吃高糖、高脂饮食。"
    },
    {
        "q": "空腹血糖高如何控制？",
        "a": "患者出现空腹血糖增高，这样情况属于空腹血糖受损，属于糖尿病前期，很容易发展为糖尿病。治疗建议做糖耐量试验，糖化血红蛋白排除糖尿病可能性。饮食方面需要糖尿病饮食，少吃主食，多吃绿叶蔬菜，每天至少500g左右，多运动，每天至少半小时以上，定期检测血糖。"
    },
    {
        "q": "糖尿病人胖好还是瘦好",
        "a": "糖尿病患者过胖和过瘦都不好。应该让体重保证在正常的范围之内，身体消瘦是糖尿病患者的典型症状之一，要注意将血糖控制好，这样能是体重恢复正常，另外患者的体重也不适合过重，这样不利于糖尿病的病情，平时要注意监测好血糖，按照医嘱坚持服用降糖药控制病情。"
    },
    {
        "q": "怎么才能让血糖降下来",
        "a": "血糖过高的人群最好使用药物来降低血糖，可以口服降糖药物，也可以直接注射胰岛素。已经使用药物降糖的人群血糖仍然偏高，建议在医生的指导下调整药物的品种以及剂量，同时注意控制饮食，不吃甜食，不吃过于油腻的食物，少吃精米精面，少食多餐，加强餐后体育锻炼。"
    },
    {
        "q": "糖尿病人能喝咖啡吗？",
        "a": "糖尿病人可以喝咖啡，但想喝咖啡要在良好的血糖控制的情况下，Ⅱ型糖尿病患者最好不要放糖，喝咖啡的咖啡量要适量，一天最好不要超过两杯。另外，建议在两餐之间选择喝咖啡的时间，不要在饭后马上喝咖啡，否则会引起血糖的波动，因为饭后马上喝咖啡会引起血糖升高。"
    },
    {
        "q": "糖尿病可以根治吗",
        "a": "您好，糖尿病是不能彻底根治的，是可以药物控制或使用胰岛素控制病情，糖尿病容易引起口干，尿多，吃得多，消瘦等情况，与胰岛素分泌缺陷有关，建议您到医院检查空腹血糖和餐后2小时血糖看看，明确诊断糖尿病可以服用二甲双胍缓释片治疗，平时注意低糖饮食，定期复查看看。"
    },
    {
        "q": "糖尿病可以吃鸡肉么？",
        "a": "糖尿病人是可以适当的吃一些鸡肉的，但是需要注意不要吃一些太油腻或者太甜太咸的鸡肉，如果是这种情况的鸡肉可以适当的在清水里涮一涮再吃。糖尿病人需要严格的控制饮食，不可以由于一时的嘴馋放纵一下自己，饮食主要是需要以清淡、含糖低的食物为主，少吃一些淀粉。"
    },
    {
        "q": "糖尿病患者头晕怎么办？",
        "a": "糖尿病的人经常出现头晕的症状，有可能是血糖升高有一定的关系，也有可能是跟血压有关，另外脑供血不足或者睡眠不好也有一定的关系。可以到医院进行系统的检查，看看血糖是否高，可以口服一些降糖类的药物，注意低糖的饮食。另外如果血糖特别低的时候也会出现浑身乏力，头晕的症状，因此一定要注意血糖的控制。"
    },
    {
        "q": "不吃饭会引起血糖高吗",
        "a": "如果不吃饭，血糖会升高。除了提供氧化能并转化成其他化合物以满足人体的正常需要外，多余的葡萄糖还以糖原的形式储存在肝脏，肌肉和其他组织中。当食物中的糖禁食或不足时，肝脏和肾脏中的糖原可以转化为6-磷酸葡萄糖，然后转化为葡萄06磷酸酶，糖尿病患者由于胰岛素作用的降低而增加了酶的活性，因此即使不进食，他们的血糖也会增加。"
    },
    {
        "q": "血糖多久检查一次",
        "a": "一般血糖的监测，建议患者可以每隔一年，做一次空腹血糖的检测，如果目前有空腹血糖超过正常范围的情况，一般考虑是空腹血糖受损或者是糖尿病的，可能需要患者做进一步的口服糖尿量监测，和ct胰岛素的检查来明确，同时可以先通过饮食控制来调理患者的血糖，必要时应用降糖药物治疗。"
    },
    {
        "q": "糖尿病最新治疗方法",
        "a": "治疗糖尿病的最新方法是移植不同种类的胰岛细胞。目前，国内某知名医院已在临床研究阶段成功移植胰岛细胞，但这种胰岛细胞移植目前仅适用于1型糖尿病。糖尿病的具体治疗方案需要医生根据检查结果，结合患者的症状和体征做出决定。糖尿病患者的治疗关键是控制血糖，防止并发症的发生，因此应严格控制日常饮食，按时按量服用降糖药。"
    },
    {
        "q": "糖尿病的发病率是多大",
        "a": "我国糖尿病的发病率居高不下，根据调查现在糖尿病患病率已达到11.21%，导致糖尿病发病的原因首先是遗传家族史，在有是生活方式不合理，摄入过高的脂肪，糖分等导致肥胖的出现引发糖尿病，糖尿病目前是没有办法彻底治愈的，所以患者需要长期服用降糖药物确保血糖的稳定。"
    },
    {
        "q": "糖尿病高血压一直在打胰岛素有什么办法呢",
        "a": "糖尿病是一种代谢性的疾病，长期慢性的存在会引起很多的并发症，可以引起糖尿病肾脏疾病，会出现高血压水肿，蛋白尿，甚至会出现肾功能衰竭，危及到患者的生命，目前针对这种情况，主要的治疗的方法就是降低血糖，需要多种药物联合使用，进行个体化的治疗，要养成良好的生活方式。减少肾脏的进一步损害。"
    },
    {
        "q": "盐酸二甲双胍缓释胶囊佰思平主要针对什么情况的",
        "a": "盐酸二甲双胍缓释胶囊佰思平主要用于饮食运动控制后血糖控制不理想的非胰岛素依赖性糖尿病病人，二甲双胍不紧有降糖的作用，还具有降低体重的作用，尤其适用于二型糖尿病伴有肥胖的患者，如果服用二甲双胍缓释胶囊血糖控制还是不理想可以配和其他降糖药物来降糖，在进餐时或餐后服用，可预防胃肠道副作用。"
    },
    {
        "q": "我有糖尿病可以要孩子吗？",
        "a": "糖尿病没有严重的合并症，血糖控制满意的情况下可以考虑要孩子，一般情况下胎儿出现畸形的时间是在怀孕的早期，所以在怀孕之前要把血糖控制在正常的范围之内，怀孕之后也要密切的关注孕妇的血糖水平和胎儿的情况，要控制体重，采取合理的医学营养治疗原则，怀孕期间血糖增高比较严重，需要采取胰岛素治疗。"
    },
    {
        "q": "血糖高到什么程度打胰岛素",
        "a": "糖尿病人用胰岛素血糖是没有限制的，一般只要确诊是糖尿病的人都可以注射胰岛素治疗，一般情况下病人对注射用药心理上有抵抗，都是习惯上先用口服药物控制血糖，药物控制血糖效果不好或者有糖尿病并发症的时候会选择胰岛素治疗控制血糖，平时要适当的多吃些蔬菜的食物有助于调节血糖。"
    },
    {
        "q": "现在宝宝便秘该怎么治疗？可以继续喝低聚果糖吗？",
        "a": "宝宝出现有便秘的情况，可以应用一些低聚果糖来帮助进行调理。重要的还是需要做好饮食方面的调整，要给宝宝适当的喝一些蔬菜汁或者是果汁，也可以适当的多吃一些蔬菜和水果来帮助进行调理，可以适当的对宝宝的肚子进行轻度的按摩，也可以适当的应用一些益生菌等进行调理治疗，才会避免出现便秘的反复发作。"
    },
    {
        "q": "格列美脲片和二甲双胍能一起吃吗",
        "a": "格列美尿片和二甲双胍片是可以共同服用起到联合降糖作用的，药物服用参考说明书或者医嘱。如果既往有糖尿病病史，并且血糖控制不佳，波动在8~9摩尔每升之间，这个血糖数值是属于高于正常水平需要加大药物剂量或者调整药物治疗方案的。正常血糖波动在六摩尔每升左右。"
    },
    {
        "q": "血糖高又贫血怎么办？血糖高要怎么控",
        "a": "血糖偏高伴有贫血的患者，在治疗贫血的情况下及时控制血糖。在饮食上需要注意，尽量少吃主食，多吃蔬菜，适当的进行体育锻炼，在饮食运动调整效果欠佳的情况下可以选择服用降糖类的药物或者注射胰岛素来维持病人血糖的平稳，可以有效的改善患者血糖增高的病情。"
    },
    {
        "q": "糖尿病初期症状是怎么样的",
        "a": "对于糖尿病的患者来说，在早期血糖没有出现异常增高的情况下，往往没有特殊的临床症状，当血糖出现异常增高时，可能会出现多饮多食多尿，并且伴有体重下降。由于血糖异常升高，大多数患者在后期可能会出现严重并发症，出现下肢动脉粥样硬化，导致下肢血管缺血缺氧和供血不足，需要及时治疗。"
    },
    {
        "q": "高血压加糖尿病不能吃什么和能吃什么。",
        "a": "高血压和糖尿病形成的机理是不同的，看起来好像没有任何的关系，但是针对这两种疾病的生活干预方法方面是差不多的，在饮食方面不能吃含有脂肪和胆固醇比较高的食物，有肥胖的患者要进行积极的减肥，不能吃含盐和含糖比较高的食物，都可以吃一些新鲜的水果蔬菜，但是糖尿病的饮食比较严格，吃了食物之后，应该把水果和蔬菜产生的热量减去。"
    },
    {
        "q": "诊断有什么办法可以降下来，是糖尿病吗？",
        "a": "诊断糖尿病是有一定的标准的，比如空腹血糖的值，糖耐量试验后餐后两小时的血糖以及随机血糖，糖尿病是一种以高血糖为主要临床症状的代谢性的疾病，如果已经确诊了是糖尿病，出现阴道瘙痒的症状，可能是由于感染引起的，最常见的是霉菌性的阴道炎，糖尿病机体抵抗能力比较低，感染是一种比较常见的合并症。"
    },
    {
        "q": "糖尿病患者吃二甲双胍和格列齐特控制血糖",
        "a": "二甲双胍是一种广泛应用的降血糖的药物，主要的机制是抑制肝葡萄糖的输出，改善外周组织对胰岛素的敏感性，格列本类的药物是一种快速作用的胰岛素促分泌剂，这两种药物的作用机制是完全不同的，可以配合治疗二型糖尿病，另外也需要配合糖尿病的基础治疗，比如饮食治疗，运动治疗等。"
    },
    {
        "q": "患糖尿病应该如何治疗好",
        "a": "糖尿病的治疗主要有几个个方面，首先要从饮食方面开始控制病情发展，其次需要药物治疗，遵医嘱服用胰岛素药物等，然后还需要通过运动来进行治疗，饭后半小时应该进行适当的有氧运动为好。还有需要时刻进行血糖监测，糖尿病最后还需要心理疗法，需要从多方面来缓解糖尿病。"
    },
    {
        "q": "糖尿病人能吃黑巧克力吗",
        "a": "糖尿病的病人平时一定要注意最好不要吃巧克力。巧克力中的糖分含量极高，很容易导致糖尿病患者血糖水平的升高。糖尿病的患者在选择临时的时候一定要10分谨慎，最好吃一些低糖低脂的食物，不要吃一些含糖量过高的食物，只有这样才能够帮助稳定患者的生命体征。"
    },
    {
        "q": "得糖尿病怎么办更好",
        "a": "如果是二型糖尿病的话，血糖稍高的话，主要就是药物食物调整控制，如果饮食调整不稳定的话，就需要口服一些降糖药物，常用的有二甲双胍，格列本脲等，如果是一型糖尿病或者是二型糖尿病，血糖比较高的话，就需要使用胰岛素治疗，特别是有营养吸收障碍或者并发症的情况。"
    },
    {
        "q": "糖尿病人.脚肿怎么办、",
        "a": "糖尿病人脚肿是比较常见的一种并发症。是因为血糖过高没有得到控制而导致的，糖尿病本身不可怕，可怕的是糖尿病会带来全身性的并发症。首先患者需要服用降血糖的药物控制好血糖，另外还要积极地对并发症进行针对性治疗，脚肿了可以使用一些药物来消肿，关键在于日常对血糖的控制。"
    },
    {
        "q": "糖尿病最好治疗方法是什么？",
        "a": "糖尿病没有最好的治疗方法，只有最适合的治疗方法，患者需要在医生的指导下使用药物，而不是擅自服用降糖药，每个患者身体状态的不同适合的降糖药不同，而不是进口的降糖药就是最好的，不同类型的降糖也是针对不同的患者而定。有些患者要联合用药才能保持血糖的稳定。"
    },
    {
        "q": "妊娠期糖尿病可以喝酸奶吗",
        "a": "妊娠期糖尿病的患者在怀孕期间是可以适当的喝一些酸奶的。在选择酸奶的时候可以选择一些含糖量较低的酸奶，这样可以帮助缓解患者妊娠期糖尿病的症状。妊娠期糖尿病的患者平时一定要严格控制饮食结构，尽量不要吃一些高糖高脂的食物，只有这样才能够帮助维持正常的血糖水平。"
    },
    {
        "q": "高血糖可以吃什么水果？",
        "a": "高血糖在饮食上要注意，可以多吃一些含糖量低的食物及水果，可以吃一些苹果，柚子，梨，橘子，石榴等水果，要控制主食的摄入量，每顿饭尽量进食八分饱，主食应该以米类食物为主，要保持饮食规律，不要吃刺激性的食物，可以多参加一些有氧的户外运动，定期复查血糖。"
    },
    {
        "q": "糖尿病人皮肤瘙痒怎么办",
        "a": "糖尿病患者出现皮肤瘙痒的症状，尤其是外阴瘙痒，这与体内的葡萄糖含量增高有一定的关系，皮肤相对来说比较干燥，能够引起瘙痒，尿糖升高也能够刺激外阴部引起什么样，另外糖尿病很容易引起感染，真菌感染之后也可以引起皮肤和外阴瘙痒，主要的治疗的方法就是要把血糖控制在满意的范围之内。"
    },
    {
        "q": "糖尿病者可以吃麦片吗",
        "a": "糖尿病是可以吃麦片的，麦片是属于粗纤维类的食物，蛋白含量也比较高，脂肪含量偏低。但是麦片也是可以提供能量物质的，糖尿病的患者如果吃一些麦片的话，就需要相应的减少一下主食的量，食用完之后一定要监测血糖，如果血糖出现了明显波动的情况，下次就不建议再食用了。"
    },
    {
        "q": "餐后血糖8.7正常吗",
        "a": "正常餐后两个小时的血糖应小于等于7.8毫摩尔每升。餐后一个小时的血糖正常值为6.7~9.4毫摩每升。如果你的是餐后一个小时的血糖的话，那么是正常的，如果是餐后两个小时血糖为8.7的话那么就不正常，如果是7.8的话，那么还是属于正常范围的。如果是餐后两个小时的血糖大于了11.1毫摩尔每升，那么就可能是有糖尿病。这样的情况下，就需要去做一个空腹血糖。"
    },
    {
        "q": "糖尿病患者血压高有200多怎么办",
        "a": "糖尿病的患者要加强血压的控制，而且血压控制的又相对比较严格，如果是轻中年患者要控制在130 /80毫米汞柱以下，如果是中老年人血压水平可以适当增高。控制血压要从两方面努力。一是饮食上要限制食盐的摄入，适当的进行体育锻炼。而是在监测血压的基础上口服降压药，一种药物不行就要联合药物口服，这样才能降低心血管风险。"
    },
    {
        "q": "高血糖喝小米粥行吗",
        "a": "患有高血糖的人群，也是可以适量地喝些小米粥的，不过不宜过量地喝，因为小米里面含有淀粉成分，如果吃太多的话，容易造成血糖增高的，所以饮食的同时，还是得合理一些有保障，并且一些血糖高的人群，也不可以吃一些含糖成分过高的食物，容易造成血糖明显增高，对身体存在伤害。"
    },
    {
        "q": "糖尿病人能不能吃红薯",
        "a": "糖尿病人最好不要吃红薯，或者少量的吃红薯。因为红薯的糖分比较高，并且淀粉含量也比较高，对于糖尿病患者不宜一次性大量的进食，大量进食红薯除了引起血糖升高外，还容易引起胃肠胀气，胃肠消化功能差的人群吃多后会引起腹胀不适或烧心。血糖控制的好的人群可以在两餐之间少量食用。"
    },
    {
        "q": "血糖高是糖尿病吗",
        "a": "血糖高不一定是糖尿病，可能是应激因素引起的血糖升高，也有可能是空腹血糖或者是餐后血糖受损，但是没有达到诊断糖尿病的标准。糖尿病的诊断主要是基于空腹血糖，任意时间的血糖和糖耐量试验中两小时的血糖值，需要做两次进行确诊，诊断才能够成立。偶尔的一次出现血糖增高不是糖尿病。"
    },
    {
        "q": "糖尿病能根治吗？",
        "a": "糖尿病在目前是没有根治的方法，只能通过运动治疗，饮食调整，药物治疗控制血糖在正常范围内，降血糖药物主要有双胍类，磺脲类，格列奈类等具体的使用需要根据糖尿病具体情况而定，口服降糖药效果不明显要采用注射胰岛素治疗，胰岛素注射剂量根据患者血糖值及药物敏感性确定。"
    },
    {
        "q": "糖尿病人吃什么零食比较好？",
        "a": "糖尿病人要严格控制饮食的，应尽量避免含糖食物、减少进食高脂肪高热量的食物。零食建议是以水果为主如猕猴桃、火龙果、西柚、苹果、西红柿、黄瓜等。也可以备些无糖食物如苏打饼干、燕麦饼干、全麦面包等；坚果类的开心果、腰果、大杏仁等是可以选择的。也可以备些脱脂牛奶。"
    },
    {
        "q": "糖尿病人排尿困难小便失禁怎么办",
        "a": "糖尿病患者出现尿失禁，这是自主神经病变受到了损害，引起了泌尿生殖系统的功能障碍，针对这种情况，首先是要控制血糖，有肥胖的患者也要进行减肥，要经常锻炼盆底肌肉，另外也可以配合药物治疗，可以吃一些营养神经的药物，经过行为治疗和药物治疗无效者可以采取手术治疗。"
    },
    {
        "q": "空腹血糖6.8正常吗",
        "a": "空腹血糖6.8是不正常的考虑还是空腹血糖升高，对于这种现象有可能会引起糖尿病，建议还是控制饮食，适当的活动锻炼，不要吃含糖量比较高的食物，出现了空腹血糖增高，有可能出现空腹血糖受损，必须要注意饮食的控制，适当的增加活动锻炼。目前并不需要口服药物，但是需要定期复查。"
    },
    {
        "q": "血糖高可以喝奶粉吗",
        "a": "血糖偏高的人群最好不要喝奶粉。不管是低糖奶粉还是无乳糖不含糖的奶粉。由于其主要成分中虽然写了没有糖分，但由于各种厂家的标准不一样，其是否含糖仍不能够保证。建议血糖偏高的人群最好不要选择奶粉，可以选择喝一些纯牛奶补充蛋白摄入量。也可以选择鸡蛋，每天两个左右，补充人体所需蛋白。"
    },
    {
        "q": "糖尿病瘦了是怎么回事？",
        "a": "糖尿病患者出现体重严重下降，通常表示患者胰岛功能完全衰竭或者功能极度下降，甚至可导致成人一型糖尿病的发生。临床上，体重偏瘦的糖尿病患者，相对肥胖的糖尿病患者血糖更不易管理。由于偏瘦的糖尿病患者，其胰岛功能受损较严重。通常需要选择胰岛素管理血糖。同时偏瘦的糖尿病患者其糖尿病病程较长，并发症较多，治疗相对更加复杂和困难。"
    },
    {
        "q": "请问糖尿病人补血吃紫菜头？",
        "a": "糖尿病人是可以吃紫菜头的。紫菜头当中含有很多的微量元素，属于强碱性的食物。经常的食用一些紫菜头还带等海产品能够调节身体的酸碱性。糖尿病的人饮食调理是非常重要的。一般都要尽可能吃一些脂肪含量比较低，糖分和盐分比较少的食物，可以多吃一些碳水化合物以及纤维素比较高的食物。"
    },
    {
        "q": "女性糖尿病能要小孩吗？",
        "a": "女性糖尿病患者是可以要孩子的，但要将降糖控制好的情况下，身体各项检查确定没有问题在要孩子。血糖不稳定状态怀孕会影响到胎儿发育，导致畸形流产等问题，怀孕期间患者需要在医生指导下采用胰岛素控制血糖，饮食方面也需要做好调整，适当运动，定期产检，避免胎儿过大。"
    },
    {
        "q": "糖尿病患者用胰岛素之后还可以吃口服药物吗",
        "a": "严格意义上来说，胰岛素并不是药，而是人体内的一种必须的降血糖的物质，糖尿病患者在使用之后不会成瘾，需要不需要进行胰岛素治疗，或者使胰岛素治疗一段时间之后能不能够撤药换回口服的药物，这主要是看患者个人的病情，如果血糖控制的比较满意，基础治疗方面也是配合的比较好，当然可以换回口服的药。"
    },
    {
        "q": "糖尿病病人长期吃二甲双胍好吗？",
        "a": "糖尿病（II型）长期服用二甲双胍好与不好要根据医生检查诊断来确定，患者不要擅自更换，糖尿病慢性疾病，需要长期服用药物控制血糖，具体的用药是根据患者身体状况和血糖值的高低来确定。在药物治疗不明显情况下可以配合胰岛素使用，患者需要定期进行血糖检测和身体检查。"
    },
    {
        "q": "糖尿病打胰岛素的危害",
        "a": "二型糖尿病，如果注射胰岛素过量，会出现血糖过低引起脑部供应能量不足，引起脑死亡的现象，严重者也会危及生命。二型糖尿病的病人需要控制饮食，并且以运动为基础方法调理血糖治疗，如果胰岛素缺乏的比较严重，需要住院调理适当的剂量应用，并且定期复查血糖以及糖化血红蛋白情况。如有应用药物异常的现象，需要及时的检查血糖，防止出现低血糖等。"
    },
    {
        "q": "咨询糖尿病的早期症状有哪些？",
        "a": "部分糖尿病的患者在早期的时候表现症状并不明显，主要是通过体检的方式来了解自己已经患有了糖尿病。部分糖尿病患者在早期会出现多食、多尿以及多饮，甚至还会伴随身体消瘦的现象。患有糖尿病的患者要注意平时控制含糖量食物的摄入量，严重患者需要进行胰岛素的注射。"
    },
    {
        "q": "糖尿病患者为什么不能吃蜂蜜",
        "a": "糖尿病患者是不能服用含糖量高的食物的蜂蜜作为含有较高的果糖葡萄糖。糖尿病患者服用后会引起血糖过度升高，从而导致各种并发症的出现，所以糖尿病患者不能服用蜂蜜，而且还需要长期服用降糖药物或者皮下注射胰岛素治疗，日常生活中也是尽量不能进食含糖类的食物。"
    },
    {
        "q": "糖尿病引起的肌酐高怎么办？",
        "a": "你好，糖尿病引起的肌酐高，要考虑糖尿病肾病导致的肾衰竭，出现肾衰竭如果没有达到尿毒症期，我们是需要及时去医院治疗的。"
    },
    {
        "q": "中医治疗糖尿病秘方？",
        "a": "没有什么中医秘方可以治疗糖尿病。糖尿病是一种不能被完全治好的疾病，通常使用中药也无法起到很好的降糖作用，需要按照医生的医嘱使用西药进行血糖控制，必要时还要使用胰岛素来进行治疗。建议不要轻信中医秘方，如果血糖高要去医院进行检查，确诊之后使用对症的降糖药进行治疗。"
    },
    {
        "q": "长期便秘的治疗方法?",
        "a": "长期便秘多跟不良的饮食习惯有关，所以想有效调理的话就应该从饮食方面着手。平时的饮食一定要清淡，尽量的避免吃容易导致上火的食物，像火龙果和猕猴桃汁的食物都具有一定的通肠润便的效果，可以适当多吃一些，必要的时候也可以考虑在医生的指导下使用一些开塞露之类的东西。"
    },
    {
        "q": "血糖高吃什么能降血糖",
        "a": "高血糖需要检查是否有糖尿病，对于高血糖目前主要是采取降糖药物治疗，通过口服二甲双胍或者是阿卡波糖进行检查，严重时需要采取注射胰岛素的方式，平时饮食当中一定要注意，不能暴饮暴食，不要吃太多的主食，可以选择清淡饮食多吃蔬菜，定期的进行复查，预防发生糖尿病并发症。"
    },
    {
        "q": "高血糖可以吃什么水果？",
        "a": "高血糖在饮食上要注意，可以多吃一些含糖量低的食物及水果，可以吃一些苹果，柚子，梨，橘子，石榴等水果，要控制主食的摄入量，每顿饭尽量进食八分饱，主食应该以米类食物为主，要保持饮食规律，不要吃刺激性的食物，可以多参加一些有氧的户外运动，定期复查血糖。"
    },
    {
        "q": "糖尿病人能吃月饼吗？",
        "a": "糖尿病的患者最好少吃或者是不吃月饼。月饼的含糖量极高，如果糖尿病的患者一次性吃过多的月饼，可能会引起患者血糖水平的升高。糖尿病的患者平时一定要注意保持低糖低脂的饮食习惯，尽量不要吃一些糖分含量过高的食物，否则会引起患者血糖水平的波动，产生严重的后果。"
    },
    {
        "q": "糖尿病者可以吃麦片吗",
        "a": "糖尿病是可以吃麦片的，麦片是属于粗纤维类的食物，蛋白含量也比较高，脂肪含量偏低。但是麦片也是可以提供能量物质的，糖尿病的患者如果吃一些麦片的话，就需要相应的减少一下主食的量，食用完之后一定要监测血糖，如果血糖出现了明显波动的情况，下次就不建议再食用了。"
    },
    {
        "q": "探望糖尿病人买什么好",
        "a": "看望糖尿病患者，尽量多送一些无糖的饮食，或者是富含优质蛋白质的饮食。有糖尿病的患者尽量要限制糖的摄入，所以对于含糖量较高的水果，八宝粥等各种补品，尽量不要送，因为糖尿病患者本人不能吃这些食物。可以送一些含糖量相对较低的水果，患者可以适当的食用，对血糖的影响比较小。"
    },
    {
        "q": "盐酸二甲双胍缓释片怎么样吃",
        "a": "二甲双胍是一种非常有效的降糖药物，它常见的副作用有胃肠道的反应 ，可以引起胃区不适或者是肠道功能的紊乱，一般是建议在吃饭的时候吃，可以减轻这些不适感。根据患者的血糖情况来确定服用的剂量，定期监测血糖的情况，平时饮食要多注意，制定一个合理的锻炼计划。"
    },
    {
        "q": "血糖高可以吃青萝卜吗",
        "a": "血糖高是可以吃青萝卜的，血糖高主要是不要吃糖分含量高的食物，要控制主食的摄入量，主食可以以米类食物和粗粮为主，每顿饭应该进食八分饱，要保持心情舒畅，避免过度的激动，生气和熬夜，可以多参加一些有氧的户外运动，定期复查血糖、糖耐量等，不要吃辣的。"
    },
    {
        "q": "高血糖喝小米粥行吗",
        "a": "患有高血糖的人群，也是可以适量地喝些小米粥的，不过不宜过量地喝，因为小米里面含有淀粉成分，如果吃太多的话，容易造成血糖增高的，所以饮食的同时，还是得合理一些有保障，并且一些血糖高的人群，也不可以吃一些含糖成分过高的食物，容易造成血糖明显增高，对身体存在伤害。"
    },
    {
        "q": "妊娠期糖尿病多久查一次血糖",
        "a": "妊娠糖尿病血糖检查2周左右一次，孕后期一周检查一次，根据孕妇具体血糖指数调整胰岛素剂量，同时妊娠期糖尿病患者需要做好饮食控制，多吃粗粮，补充蛋白质，控制总热量，以少食多餐为原则，控制血糖在正常范围之内，糖尿病会导致胎儿神经系统和心脑血管方面畸形甚至是死亡。"
    },
    {
        "q": "糖尿病人能不能吃红薯",
        "a": "糖尿病人最好不要吃红薯，或者少量的吃红薯。因为红薯的糖分比较高，并且淀粉含量也比较高，对于糖尿病患者不宜一次性大量的进食，大量进食红薯除了引起血糖升高外，还容易引起胃肠胀气，胃肠消化功能差的人群吃多后会引起腹胀不适或烧心。血糖控制的好的人群可以在两餐之间少量食用。"
    },
    {
        "q": "血糖高是糖尿病吗",
        "a": "血糖高不一定是糖尿病，可能是应激因素引起的血糖升高，也有可能是空腹血糖或者是餐后血糖受损，但是没有达到诊断糖尿病的标准。糖尿病的诊断主要是基于空腹血糖，任意时间的血糖和糖耐量试验中两小时的血糖值，需要做两次进行确诊，诊断才能够成立。偶尔的一次出现血糖增高不是糖尿病。"
    },
    {
        "q": "糖尿病人吃什么零食比较好？",
        "a": "糖尿病人要严格控制饮食的，应尽量避免含糖食物、减少进食高脂肪高热量的食物。零食建议是以水果为主如猕猴桃、火龙果、西柚、苹果、西红柿、黄瓜等。也可以备些无糖食物如苏打饼干、燕麦饼干、全麦面包等；坚果类的开心果、腰果、大杏仁等是可以选择的。也可以备些脱脂牛奶。"
    },
    {
        "q": "糖尿病人排尿困难小便失禁怎么办",
        "a": "糖尿病患者出现尿失禁，这是自主神经病变受到了损害，引起了泌尿生殖系统的功能障碍，针对这种情况，首先是要控制血糖，有肥胖的患者也要进行减肥，要经常锻炼盆底肌肉，另外也可以配合药物治疗，可以吃一些营养神经的药物，经过行为治疗和药物治疗无效者可以采取手术治疗。"
    },
    {
        "q": "糖尿病血糖值范围",
        "a": "糖尿病血糖值范围是患者空腹在8小时到10小时之内血糖检测≥7.0mmol/L，餐后2小时进行血糖≥11.1mmol/L。或者是随机检查在10.1mmol/L可以确定是糖尿病，目前没有方法可以彻底根治，患者需要长期服用药物控制血糖稳定。患者通过饮食，运动，药物等方法将血糖控制在正常范围内。"
    },
    {
        "q": "妊娠期糖尿病的治疗方法有什么",
        "a": "妊娠期合并有糖尿病综合症，对于孕产妇和孩子都有非常大的影响，首先在整个孕期需要自我检测血糖，要控制体重，合理的进行饮食，也要进行适量的运动，使用降血糖的血糖药物，如果血糖控制的不是太满意，随着病情的进展，需要采取胰岛素进行治疗，大部分的患者在生完孩子之后，血糖会恢复正常。"
    },
    {
        "q": "女性糖尿病的早期症状您好",
        "a": "糖尿病在早期一般情况下没有任何的症状，只是空腹血糖或者是餐后血糖偏高，很少出现了糖尿病的典型症状，有的患者发病比较隐匿，发现了慢性的合并症，医院检查时才知道自己有糖尿病。糖尿病的诊断是非常简单的，只需要去医院做一下血浆空腹血糖或者是餐后两小时血糖，就可以知道血糖是否超过了正常范围。"
    },
    {
        "q": "糖尿病五驾马车是什么？",
        "a": "糖尿病的5驾马车是最重要的基础治疗的措施，主要包括的内容有糖尿病健康教育，要全面的了解一下患者的情况，饮食治疗，要控制体重，控制中热量的摄入，要进行有规律的运动能够提高胰岛素的敏感性，要对自己的血糖做自我监测，及时发现血糖的变化，最后一项是药物治疗，根据患者的情况，选择比较合适的药物。"
    },
    {
        "q": "糖尿病人吃什么才可以不吃？",
        "a": "糖尿病是饮食不当的原因造成，因此治疗糖尿病需要控制血糖的来源，主要控制主食的摄入量，特别是控制热量的来源，避免吃含有糖分以及含有淀粉丰富的食物，不能吃含有油脂丰富的食物以及油炸制品，需要吃粗杂粮以及含有糖分比较低的蔬菜类食物，需要补充充足的蛋白质。"
    },
    {
        "q": "请问糖尿病人补血吃紫菜头？",
        "a": "糖尿病人是可以吃紫菜头的。紫菜头当中含有很多的微量元素，属于强碱性的食物。经常的食用一些紫菜头还带等海产品能够调节身体的酸碱性。糖尿病的人饮食调理是非常重要的。一般都要尽可能吃一些脂肪含量比较低，糖分和盐分比较少的食物，可以多吃一些碳水化合物以及纤维素比较高的食物。"
    },
    {
        "q": "糖尿病不能吃的食物有什么",
        "a": "糖尿病病人不宜吃的食物，主要是含糖量多的食物。比如糖蛋糕，蜂蜜这些含糖量多的食物是不能吃的，另外淀粉在体内代谢以后主要转化成葡萄糖，所以含淀粉多的食物也要少吃。由于肉类的主要成分是蛋白质脂肪，可以适当吃，但是脂肪也不要多吃。饮食要以低盐低糖低脂饮食为主，多吃水果蔬菜。"
    },
    {
        "q": "糖尿病，高血压病人，可以喝些什么茶好",
        "a": "糖尿病高血压患者可以喝一些黑茶。黑茶当中含有氨基酸，咖啡碱，磷脂，能够加速人体当中脂肪代谢，而且黑茶当中含有茶多糖复合物，能够降血糖。糖尿病高血压患者还可以喝乌龙茶，绿茶，茉莉花茶，山楂茶等。糖尿病高血压患者需注意控制饮食，可食用紫菜，苦瓜。"
    },
    {
        "q": "要考体育了可以多喝葡萄糖水吗",
        "a": "要靠体育了，可以喝葡萄糖水，葡萄糖水只是一种普通的营养物质，并不是兴奋剂，所以并不在兴奋剂的检查范围之内，喝糖水可以补充体内的能量补充葡萄糖，葡萄糖是人体代谢必须的三大元素之一，如果出现血糖低就会导致肢体乏力，严重的会引起休克，所以补充葡萄糖可以增强体力。"
    },
    {
        "q": "糖尿病打胰岛素的危害",
        "a": "二型糖尿病，如果注射胰岛素过量，会出现血糖过低引起脑部供应能量不足，引起脑死亡的现象，严重者也会危及生命。二型糖尿病的病人需要控制饮食，并且以运动为基础方法调理血糖治疗，如果胰岛素缺乏的比较严重，需要住院调理适当的剂量应用，并且定期复查血糖以及糖化血红蛋白情况。如有应用药物异常的现象，需要及时的检查血糖，防止出现低血糖等。"
    },
    {
        "q": "糖尿病人早上吃什么最好",
        "a": "糖尿病的饮食是非常重要的，是糖尿病的基础治疗，需要根据每日计算出的总热量，来分配蛋白质，脂肪和碳水化合物，早餐的热量应该占1/5，可以喝250克的牛奶一包，吃一个鸡蛋，两块儿咸面包，再吃少许的咸菜，另外也可以进行其他的配合早餐，午餐和晚餐各占2/5的热量。"
    },
    {
        "q": "糖尿病饮食指南和糖尿病注意事项",
        "a": "您好，糖尿病是一种可以控制但是很难彻底根治的疾病，容易引起消瘦，口渴，尿多，吃得多等情况，平时需要注意低糖饮食，适当运动锻炼，控制饮食等，需要长期服用降血糖的药物或使用胰岛素治疗，定期复查血糖值，避免过度劳累，注意低脂低盐饮食等的，多吃粗粮杂粮有利于血糖的控制。"
    },
    {
        "q": "请问血糖高的人可以吃葡萄、桔子，橙子吗",
        "a": "血糖高的人群最好不要吃葡萄，橙子，橘子等含糖指数高的水果，特别是餐后血糖偏高的人群。血糖偏高的人群可以适当的吃些含糖指数比较低的水果，含糖指数低的水果有猕猴桃，番薯，梨，柚子，樱桃，桃，李等，这些含糖指数低的水果最好在两餐之间食用，注意在餐后适当的进行体育锻炼。"
    },
    {
        "q": "糖尿病患者孕期体重增长过慢有危险吗？",
        "a": "糖尿病的患者，在孕期体重增长的比较慢，这种情况也是有危险的，糖尿病的主要的临床症状是多饮多食多尿，身体消瘦，身体消瘦的原因是葡萄糖不能得到很好的利用，就会引起脂肪和蛋白质分解增加，这样也会引起孩子营养缺乏，在子宫内发育迟缓，会影响到孩子的健康，孕妇也会出现贫血。"
    },
    {
        "q": "高血糖有啥症状",
        "a": "高血糖的具体症状要看血糖的水平。如果血糖是一个轻度的升高，患者没有任何的症状。如果血糖长期升高，患者可以表现为明显的多尿多食多饮，而且会出现明显的消瘦，这是糖尿病患者的典型症状。如果出现并发症，有些人可以出现事物模糊，可以出现肾功能的下降，可以出现皮肤瘙痒。"
    },
    {
        "q": "糖尿病人吸烟有什么危害？",
        "a": "吸烟的危害，糖尿病患者容易患足部疾病。烟叶不完全燃烧会产生有毒有害物质，主要是尼古丁、一氧化碳、焦油等。这些物质对人类健康有很大影响。烟草中还有一种天然成分，去甲尼古丁，能引起血管收缩、痉挛、血供减少、组织缺血和缺氧。足部溃疡的愈合需要足够的氧气和营养。"
    },
    {
        "q": "苦瓜怎么吃降血糖",
        "a": "吃苦瓜并没有直接降低血糖的作用，不要盲目的选择，这种治疗方式，可以作为饮食的一种方式，但是并不能作为主要的治疗方式，出现了高血糖，糖尿病必须要选择口服降糖药，同时需要控制主食量，吃苦瓜并不一定会降低血糖，但是也没有其他的副作用，糖尿病高血糖患者可以正常吃。"
    },
    {
        "q": "请问黄芪可以治疗糖尿病吗？",
        "a": "黄芪有助于治疗糖尿病，但不足以控制血糖。目前还没有治愈糖尿病的方法，但可以通过多种治疗方法加以控制。到医院进行正规治疗，正常生活要注意适量活动，减少糖的摄入。目前糖尿病的治疗以口服降糖药和注射胰岛素为主，现在还没有其他治疗措施可以替代药物。必要时增加或减少药物剂量。"
    },
    {
        "q": "糖尿病患者应该多喝饮料吗？",
        "a": "糖尿病的患者是不建议喝饮料的，因为所有的饮料里面都含有一定的糖分，糖尿病的患者是由于本身胰岛功能不能够分泌更多的糖分所引起的症状，所以说糖尿病患者如果经常喝饮料，会引起血糖升高，就会引起一些并发症的现象，糖尿病的患者可能会出现口渴的情况，可以多喝一些白开水或者是茶水是可以的。"
    },
    {
        "q": "酸葡萄糖注射液的注意事项是什么？",
        "a": "应用葡萄糖注射液时，首先要注意查看一下患者的血糖，如果患者是糖尿病，就不能够应用葡萄糖注射液的，如果患者需要补充盐分或者是电解质，只是单纯的补充葡萄糖也是没有作用的，所以如果要应用葡萄糖注射液，一定要检查清楚之后再应用。最好是在医生指导下应用。"
    },
    {
        "q": "血糖高吃红薯会怎样",
        "a": "血糖过高，吃红薯有可能会更加加重血糖高的症状，另外还有可能会引起胃肠道胀气，造成消化不良，从健康角度血糖高的患者是不建议服用含糖量较高的食物的，首先应该通过饮食调整、药物治疗，以及运动疗法，把血糖稳定在正常的参考范围之内，预防出现其他的并发症。"
    },
    {
        "q": "糖尿病人能吃榴莲吗",
        "a": "糖尿病人是不建议吃榴莲，榴莲是一种高热量的水果，其中糖分含量特别高，所以有糖尿病的情况，吃榴莲就会导致血糖增高，一般糖尿病人尽量避免吃榴莲。对于糖尿病人来说，首先需要饮食控制，同时根据血糖情况，需要应用药物来控制血糖，如果血糖控制比较好，可以适量的吃水果。"
    },
    {
        "q": "高血糖吃什么可以降血糖",
        "a": "高血糖需要注意检查是不是饮食方面的原因，确诊糖尿病以后需要根据病情来选择胰岛素或者是口服降糖药，只要不是一型糖尿病，可以选择降糖药来治疗，没有发生并发症，没有严重的高血糖，可以选择口服降糖药，建议使用二甲双胍配合口服阿卡波糖进行治疗，控制饮食是最主要的。"
    },
    {
        "q": "糖尿病为什么会导致贫血？",
        "a": "糖尿病出现贫血的原因首先是糖尿病患者是低脂低糖，减少肉类的饮食，缺乏铁的吸收导致的营养不良出现贫血。患者服用的二甲双胍，甲苯磺丁脲，格列苯脲等常用降糖药也可以引发贫血，服用这类药物需要定期进行血常规检查，糖尿病并发症肾病也是可以导致贫血的出现。"
    },
    {
        "q": "盐酸二甲双胍肠溶片。是降空腹还是餐后?",
        "a": "盐酸二甲双胍片属于临床上常用的降糖药物，一般建议在饭前20分钟左右服用。饭后服用很有可能会直接影响药物的降糖效果。由于上述药物具有一定的胃肠道刺激性反应，必要时患者可以换成二甲双胍肠溶片比较好。要按照医生医嘱按时用药，注意观察血糖的变化，平时注意低糖饮食，多运动。"
    },
    {
        "q": "复查孕妇空腹血糖5.6高吗",
        "a": "正常人血糖值要求空腹状态下在3.9~6.1，对孕妇来说是一个特殊的群体，孕妇血糖要求是不超过5.1，所以现在空腹血糖是5.6，相对来说是偏高的，一般需要进一步的做妊娠糖耐量试验，可以有助于判断有没有合并糖尿病的现象。平时也要注意低糖饮食，可以定期复查血糖。"
    },
    {
        "q": "糖尿病的初期症状有哪些",
        "a": "糖尿病早期症状临床症状不是非常明显，多数没有典型症状三多一少，但患者会出现不明显原因的视力模糊，近视度数加深，患者易感觉疲劳，全身无力，皮肤出现瘙痒，泌尿系统方面易感染等。随着血糖度数的进一步升高，典型的临床症状逐步出现，患者易察觉，通过血糖监测确定。"
    },
    {
        "q": "糖尿病患者对胰岛素抵抗,该怎么办?",
        "a": "糖尿病患者属于胰岛素抵抗，能够打胰岛素，但是打胰岛素效果不好，治疗胰岛素抵抗，应用胰岛素增敏剂或者采取有氧运动的方式提高胰岛素的敏感性，而达到降低血糖的效果。糖尿病的病人需要控制血糖的来源控制饮食，并且适当的应用双胍类的药物或者减少血糖吸收的药物治疗。"
    },
    {
        "q": "糖尿病患者为什么要进行餐后2小时血糖测定？",
        "a": "糖尿病的诊断需要用到的两个血糖，一个就是空腹血糖，另一个就是糖耐量试验之后的餐后两小时血糖，餐后两小时血糖能够更好地反映进食和使用降糖药物是否合适，在这个时间段不会饮食，也不会做胰岛素的打针治疗，对血糖的影响不是太大，也就是说血糖不会出现特别的太大的波动。"
    },
    {
        "q": "孕妇饭后两小时测血糖值是多少才正常",
        "a": "怀孕期间女性是可以进行糖耐量测试的，在进行糖耐量测试的时候一般需要检测空腹血糖、餐后一小时血糖和餐后两小时血糖，空腹血糖的正常范围应该是在3.9~5.1之间，餐后一小时血糖的正常范围应该是在10.0以内，餐后两小时血糖的正常范围应该是小于7.8就是正常的现象。"
    },
    {
        "q": "妊娠期糖尿病的诊断标准到底是多少？",
        "a": "妊娠期糖尿病的诊断标准是孕妇空腹检查血糖高于5.1mmol/L，口服葡萄糖耐量实验两小时血糖高于8.5mmol/L就可以确诊为妊娠期糖尿病。通过患者检查可以确定血糖指数正常，妊娠期糖尿病的预防主要是合理饮食避免高脂肪高糖分食物，严格控制体重，适当的运动。"
    },
    {
        "q": "血糖偏高要注意哪些问题？",
        "a": "血糖偏高的患者需要在生活中注意，尽量避免吃一些含有糖分比较多的食品和饮品，尤其是不能吃糖块，蛋糕，喝糖水，避免吃一些油炸油腻辛辣刺激性的食物，尽量多吃一些新鲜的蔬菜；对于确诊为糖尿病的患者，还要控制主食的 入量，经常进行体育锻炼，利于血糖的平稳。"
    },
    {
        "q": "糖尿病并发症的防治？",
        "a": "可能是糖尿病引起的并发症，会出现末梢微循环回流的障碍，如果糖尿病病人末梢神经调节异常。要进行检查皮肤有没有溃疡或者要配合服用营养神经类的药品，比如维生素类的药品，维生素b1或者是叶酸片。测量生命体征测量空腹血糖，餐后血糖以及血压，要服用降血压，改善心肌循环的药品。"
    },
    {
        "q": "怀孕前糖尿病,生完孩子会好吗",
        "a": "一般情况下，孕妇妊娠期糖尿病是在分娩后大部分病人是可以恢复正常水平的，但是也是有部分病人的代谢功能障碍后，在分娩后也无法恢复正常状态。如果分娩后进行继续监测，血糖仍无法恢复正常这种情况就需要进一步检查是属于哪一类型的糖尿病，然后根据检查结果判断后服用降糖药物或者使用胰岛素治疗。"
    },
    {
        "q": "请问糖尿病患者能吃柚子吗",
        "a": "糖尿病的患者在患病期间是可以吃柚子的。柚子中的糖分含量比较低，一般不会引起糖尿病患者血糖水平的波动。糖尿病的患者平时最好选择一些低糖低脂的水果，这样可以帮助维持患者正常的血糖水平，避免患者出现血糖水平的波动。患病期间一定要注意多吃一些新鲜的水果蔬菜，这样可以帮助维持正常的血糖水平。"
    },
    {
        "q": "得了糖尿病能吃苹果吗",
        "a": "糖尿糖人可以适量吃苹果，但应选择含糖量低的水果，因为水果中含有葡萄糖、果糖、蔗糖、淀粉、果胶等，其中果糖代谢不需要胰岛素参与。果胶中含有可溶性纤维，能延缓葡萄糖的吸收。水果中还含有维生素、矿物质和水，有利于糖尿病的健康，但也含有葡萄糖，葡萄糖是糖尿病的一个不利因素。"
    },
    {
        "q": "糖尿病并发症有哪些症状",
        "a": "出现糖尿病并发症的病情不同，症状也不完全一样；如果出现有糖尿病，眼底改变时，可以出现有眼底出血视物模糊等表现；在病情引起末梢神经炎的病发症发作时，患者可以出现有四肢末梢部位的麻木，有的患者可以出现有手套，袜套样的表现；在引起心脑血管疾病的并发症出现时，可以出现有胸闷，气短，头晕，肢体功能障碍等表现。"
    },
    {
        "q": "餐后血糖高是怎么回事",
        "a": "血糖偏高有可能和平时的饮食习惯有关系，检查餐后血糖高，如果餐后两小时血糖超过11.1，应该是得了糖尿病。可以去医院的内分泌科就诊，在医生的指导下用药治疗，如果只是有一些偏高，可以通过控制饮食、运动的方法来控制血糖，一定要保持低糖饮食，多参加户外运动。"
    },
    {
        "q": "糖尿病人早上吃什么最好",
        "a": "糖尿病的饮食是非常重要的，是糖尿病的基础治疗，需要根据每日计算出的总热量，来分配蛋白质，脂肪和碳水化合物，早餐的热量应该占1/5，可以喝250克的牛奶一包，吃一个鸡蛋，两块儿咸面包，再吃少许的咸菜，另外也可以进行其他的配合早餐，午餐和晚餐各占2/5的热量。"
    },
    {
        "q": "糖尿病饮食指南和糖尿病注意事项",
        "a": "您好，糖尿病是一种可以控制但是很难彻底根治的疾病，容易引起消瘦，口渴，尿多，吃得多等情况，平时需要注意低糖饮食，适当运动锻炼，控制饮食等，需要长期服用降血糖的药物或使用胰岛素治疗，定期复查血糖值，避免过度劳累，注意低脂低盐饮食等的，多吃粗粮杂粮有利于血糖的控制。"
    },
    {
        "q": "请问血糖高的人可以吃葡萄、桔子，橙子吗",
        "a": "血糖高的人群最好不要吃葡萄，橙子，橘子等含糖指数高的水果，特别是餐后血糖偏高的人群。血糖偏高的人群可以适当的吃些含糖指数比较低的水果，含糖指数低的水果有猕猴桃，番薯，梨，柚子，樱桃，桃，李等，这些含糖指数低的水果最好在两餐之间食用，注意在餐后适当的进行体育锻炼。"
    },
    {
        "q": "糖尿病患者孕期体重增长过慢有危险吗？",
        "a": "糖尿病的患者，在孕期体重增长的比较慢，这种情况也是有危险的，糖尿病的主要的临床症状是多饮多食多尿，身体消瘦，身体消瘦的原因是葡萄糖不能得到很好的利用，就会引起脂肪和蛋白质分解增加，这样也会引起孩子营养缺乏，在子宫内发育迟缓，会影响到孩子的健康，孕妇也会出现贫血。"
    },
    {
        "q": "高血糖有啥症状",
        "a": "高血糖的具体症状要看血糖的水平。如果血糖是一个轻度的升高，患者没有任何的症状。如果血糖长期升高，患者可以表现为明显的多尿多食多饮，而且会出现明显的消瘦，这是糖尿病患者的典型症状。如果出现并发症，有些人可以出现事物模糊，可以出现肾功能的下降，可以出现皮肤瘙痒。"
    },
    {
        "q": "糖尿病人吸烟有什么危害？",
        "a": "吸烟的危害，糖尿病患者容易患足部疾病。烟叶不完全燃烧会产生有毒有害物质，主要是尼古丁、一氧化碳、焦油等。这些物质对人类健康有很大影响。烟草中还有一种天然成分，去甲尼古丁，能引起血管收缩、痉挛、血供减少、组织缺血和缺氧。足部溃疡的愈合需要足够的氧气和营养。"
    },
    {
        "q": "苦瓜怎么吃降血糖",
        "a": "吃苦瓜并没有直接降低血糖的作用，不要盲目的选择，这种治疗方式，可以作为饮食的一种方式，但是并不能作为主要的治疗方式，出现了高血糖，糖尿病必须要选择口服降糖药，同时需要控制主食量，吃苦瓜并不一定会降低血糖，但是也没有其他的副作用，糖尿病高血糖患者可以正常吃。"
    },
    {
        "q": "请问黄芪可以治疗糖尿病吗？",
        "a": "黄芪有助于治疗糖尿病，但不足以控制血糖。目前还没有治愈糖尿病的方法，但可以通过多种治疗方法加以控制。到医院进行正规治疗，正常生活要注意适量活动，减少糖的摄入。目前糖尿病的治疗以口服降糖药和注射胰岛素为主，现在还没有其他治疗措施可以替代药物。必要时增加或减少药物剂量。"
    },
    {
        "q": "糖尿病患者应该多喝饮料吗？",
        "a": "糖尿病的患者是不建议喝饮料的，因为所有的饮料里面都含有一定的糖分，糖尿病的患者是由于本身胰岛功能不能够分泌更多的糖分所引起的症状，所以说糖尿病患者如果经常喝饮料，会引起血糖升高，就会引起一些并发症的现象，糖尿病的患者可能会出现口渴的情况，可以多喝一些白开水或者是茶水是可以的。"
    },
    {
        "q": "酸葡萄糖注射液的注意事项是什么？",
        "a": "应用葡萄糖注射液时，首先要注意查看一下患者的血糖，如果患者是糖尿病，就不能够应用葡萄糖注射液的，如果患者需要补充盐分或者是电解质，只是单纯的补充葡萄糖也是没有作用的，所以如果要应用葡萄糖注射液，一定要检查清楚之后再应用。最好是在医生指导下应用。"
    },
    {
        "q": "血糖高吃红薯会怎样",
        "a": "血糖过高，吃红薯有可能会更加加重血糖高的症状，另外还有可能会引起胃肠道胀气，造成消化不良，从健康角度血糖高的患者是不建议服用含糖量较高的食物的，首先应该通过饮食调整、药物治疗，以及运动疗法，把血糖稳定在正常的参考范围之内，预防出现其他的并发症。"
    },
    {
        "q": "糖尿病人能吃榴莲吗",
        "a": "糖尿病人是不建议吃榴莲，榴莲是一种高热量的水果，其中糖分含量特别高，所以有糖尿病的情况，吃榴莲就会导致血糖增高，一般糖尿病人尽量避免吃榴莲。对于糖尿病人来说，首先需要饮食控制，同时根据血糖情况，需要应用药物来控制血糖，如果血糖控制比较好，可以适量的吃水果。"
    },
    {
        "q": "高血糖吃什么可以降血糖",
        "a": "高血糖需要注意检查是不是饮食方面的原因，确诊糖尿病以后需要根据病情来选择胰岛素或者是口服降糖药，只要不是一型糖尿病，可以选择降糖药来治疗，没有发生并发症，没有严重的高血糖，可以选择口服降糖药，建议使用二甲双胍配合口服阿卡波糖进行治疗，控制饮食是最主要的。"
    },
    {
        "q": "糖尿病为什么会导致贫血？",
        "a": "糖尿病出现贫血的原因首先是糖尿病患者是低脂低糖，减少肉类的饮食，缺乏铁的吸收导致的营养不良出现贫血。患者服用的二甲双胍，甲苯磺丁脲，格列苯脲等常用降糖药也可以引发贫血，服用这类药物需要定期进行血常规检查，糖尿病并发症肾病也是可以导致贫血的出现。"
    },
    {
        "q": "盐酸二甲双胍肠溶片。是降空腹还是餐后?",
        "a": "盐酸二甲双胍片属于临床上常用的降糖药物，一般建议在饭前20分钟左右服用。饭后服用很有可能会直接影响药物的降糖效果。由于上述药物具有一定的胃肠道刺激性反应，必要时患者可以换成二甲双胍肠溶片比较好。要按照医生医嘱按时用药，注意观察血糖的变化，平时注意低糖饮食，多运动。"
    },
    {
        "q": "复查孕妇空腹血糖5.6高吗",
        "a": "正常人血糖值要求空腹状态下在3.9~6.1，对孕妇来说是一个特殊的群体，孕妇血糖要求是不超过5.1，所以现在空腹血糖是5.6，相对来说是偏高的，一般需要进一步的做妊娠糖耐量试验，可以有助于判断有没有合并糖尿病的现象。平时也要注意低糖饮食，可以定期复查血糖。"
    },
    {
        "q": "糖尿病的初期症状有哪些",
        "a": "糖尿病早期症状临床症状不是非常明显，多数没有典型症状三多一少，但患者会出现不明显原因的视力模糊，近视度数加深，患者易感觉疲劳，全身无力，皮肤出现瘙痒，泌尿系统方面易感染等。随着血糖度数的进一步升高，典型的临床症状逐步出现，患者易察觉，通过血糖监测确定。"
    },
    {
        "q": "糖尿病患者对胰岛素抵抗,该怎么办?",
        "a": "糖尿病患者属于胰岛素抵抗，能够打胰岛素，但是打胰岛素效果不好，治疗胰岛素抵抗，应用胰岛素增敏剂或者采取有氧运动的方式提高胰岛素的敏感性，而达到降低血糖的效果。糖尿病的病人需要控制血糖的来源控制饮食，并且适当的应用双胍类的药物或者减少血糖吸收的药物治疗。"
    },
    {
        "q": "糖尿病患者为什么要进行餐后2小时血糖测定？",
        "a": "糖尿病的诊断需要用到的两个血糖，一个就是空腹血糖，另一个就是糖耐量试验之后的餐后两小时血糖，餐后两小时血糖能够更好地反映进食和使用降糖药物是否合适，在这个时间段不会饮食，也不会做胰岛素的打针治疗，对血糖的影响不是太大，也就是说血糖不会出现特别的太大的波动。"
    },
    {
        "q": "孕妇饭后两小时测血糖值是多少才正常",
        "a": "怀孕期间女性是可以进行糖耐量测试的，在进行糖耐量测试的时候一般需要检测空腹血糖、餐后一小时血糖和餐后两小时血糖，空腹血糖的正常范围应该是在3.9~5.1之间，餐后一小时血糖的正常范围应该是在10.0以内，餐后两小时血糖的正常范围应该是小于7.8就是正常的现象。"
    },
    {
        "q": "妊娠期糖尿病的诊断标准到底是多少？",
        "a": "妊娠期糖尿病的诊断标准是孕妇空腹检查血糖高于5.1mmol/L，口服葡萄糖耐量实验两小时血糖高于8.5mmol/L就可以确诊为妊娠期糖尿病。通过患者检查可以确定血糖指数正常，妊娠期糖尿病的预防主要是合理饮食避免高脂肪高糖分食物，严格控制体重，适当的运动。"
    },
    {
        "q": "血糖偏高要注意哪些问题？",
        "a": "血糖偏高的患者需要在生活中注意，尽量避免吃一些含有糖分比较多的食品和饮品，尤其是不能吃糖块，蛋糕，喝糖水，避免吃一些油炸油腻辛辣刺激性的食物，尽量多吃一些新鲜的蔬菜；对于确诊为糖尿病的患者，还要控制主食的 入量，经常进行体育锻炼，利于血糖的平稳。"
    },
    {
        "q": "糖尿病并发症的防治？",
        "a": "可能是糖尿病引起的并发症，会出现末梢微循环回流的障碍，如果糖尿病病人末梢神经调节异常。要进行检查皮肤有没有溃疡或者要配合服用营养神经类的药品，比如维生素类的药品，维生素b1或者是叶酸片。测量生命体征测量空腹血糖，餐后血糖以及血压，要服用降血压，改善心肌循环的药品。"
    },
    {
        "q": "怀孕前糖尿病,生完孩子会好吗",
        "a": "一般情况下，孕妇妊娠期糖尿病是在分娩后大部分病人是可以恢复正常水平的，但是也是有部分病人的代谢功能障碍后，在分娩后也无法恢复正常状态。如果分娩后进行继续监测，血糖仍无法恢复正常这种情况就需要进一步检查是属于哪一类型的糖尿病，然后根据检查结果判断后服用降糖药物或者使用胰岛素治疗。"
    },
    {
        "q": "请问糖尿病患者能吃柚子吗",
        "a": "糖尿病的患者在患病期间是可以吃柚子的。柚子中的糖分含量比较低，一般不会引起糖尿病患者血糖水平的波动。糖尿病的患者平时最好选择一些低糖低脂的水果，这样可以帮助维持患者正常的血糖水平，避免患者出现血糖水平的波动。患病期间一定要注意多吃一些新鲜的水果蔬菜，这样可以帮助维持正常的血糖水平。"
    },
    {
        "q": "得了糖尿病能吃苹果吗",
        "a": "糖尿糖人可以适量吃苹果，但应选择含糖量低的水果，因为水果中含有葡萄糖、果糖、蔗糖、淀粉、果胶等，其中果糖代谢不需要胰岛素参与。果胶中含有可溶性纤维，能延缓葡萄糖的吸收。水果中还含有维生素、矿物质和水，有利于糖尿病的健康，但也含有葡萄糖，葡萄糖是糖尿病的一个不利因素。"
    },
    {
        "q": "糖尿病并发症有哪些症状",
        "a": "出现糖尿病并发症的病情不同，症状也不完全一样；如果出现有糖尿病，眼底改变时，可以出现有眼底出血视物模糊等表现；在病情引起末梢神经炎的病发症发作时，患者可以出现有四肢末梢部位的麻木，有的患者可以出现有手套，袜套样的表现；在引起心脑血管疾病的并发症出现时，可以出现有胸闷，气短，头晕，肢体功能障碍等表现。"
    },
    {
        "q": "餐后血糖高是怎么回事",
        "a": "血糖偏高有可能和平时的饮食习惯有关系，检查餐后血糖高，如果餐后两小时血糖超过11.1，应该是得了糖尿病。可以去医院的内分泌科就诊，在医生的指导下用药治疗，如果只是有一些偏高，可以通过控制饮食、运动的方法来控制血糖，一定要保持低糖饮食，多参加户外运动。"
    },
    {
        "q": "糖尿病患者贫血怎么办",
        "a": "如果是重度的贫血就直接进行输血治疗，轻度的贫血就需要加强营养补充蛋白质，铁剂，叶酸等等来进行补助的治疗，但是糖尿病的人需要严格的控制饮食，如果本身吃的东西就比较少，所以不利于治疗贫血，选择增加饮食摄入量的时候加大降糖药物的剂量，严格检测好血糖。"
    },
    {
        "q": "胰岛素增敏剂都有哪些",
        "a": "胰岛素增敏剂有两种，一种是二甲双胍，它的主要药理作用是减少肝葡萄糖输出和改善外周胰岛素抵抗而降低血糖。另一种是噻唑烷二酮类降糖药，如罗格列酮，吡格列酮等，主要药理作用是增加靶细胞对胰岛素的敏感性而降低血糖。另外现在噻唑烷二酮类很少用了，因为它增加骨折风险，导致新功能恶化。"
    },
    {
        "q": "胰岛素的正常值是多少",
        "a": "与体内葡萄糖浓度有关的激素主要是胰高血糖素和胰岛素，而胰岛素是人体内唯一能降低血糖的激素，因此如果患者出现高血糖，一般采用外源性胰岛素注射治疗。正常成人胰岛素含量为29-172pmol/L，60岁以上老年人胰岛素含量正常范围为42-243pmol/L。"
    },
    {
        "q": "请问血糖高就是糖尿病吗",
        "a": "糖尿病是一种以血糖升高为主要临床症状的代谢性疾病，但是并不是只要血糖升高就是糖尿病，糖尿病的主要的诊断标准是空腹血糖大于等于7.0毫摩尔每升，餐后两小时血糖大于等于11.1毫摩尔每升，如果没有高于这两个值，但是比正常的水平要高一些，这种情况不叫糖尿病，只是属于空腹血糖或者是餐后血糖受损。"
    },
    {
        "q": "糖尿病人饭后血糖正常值是多少",
        "a": "糖尿病患者饭后的血糖的正常值根据患者的病情、用药情况以及年纪等因素的不同可以有些差异。因此没有统一的标准，如果没有并发症的情况下，一般饭后血糖应该控制在7.8mmol/L以下，如果超出了这个值那么要考虑调整以下饮食结构，或者对药物的用量进行调整。"
    },
    {
        "q": "糖尿病是由什么原因引起的呢？",
        "a": "导致糖尿病的原因有遗传因素，目前糖尿病患者有20％到40％是有家族遗传史导，在有就是环境因素，吃的比较多，运动比较少导致的肥胖出现糖尿病。糖尿病是慢性疾病，可以通过电信临床症状三多一少进行诊断，糖尿病本身不对导致岁身体伤害，但引起的并发症去可以威胁到生命。"
    },
    {
        "q": "血糖高可以吃小西红柿吗",
        "a": "血糖高当然可以吃小西红柿了。小西红柿也叫圣女果，含有丰富的胡萝卜素，番茄红素以及多种微量元素，有缓解心悸失眠，抗氧化，抗衰老的功效。圣女果的热量和糖分都比较低，有利于餐后血糖的稳定，小西红柿的营养价值很高，生吃熟吃都可以。除了小西红柿以外黄瓜，柚子，血糖高的人群也可以适当的吃点。"
    },
    {
        "q": "糖尿病人可以吃玉米吗",
        "a": "患有糖尿病的病人是可以吃玉米的，玉米是处于粗粮，适量的吃玉米，不会对血糖有影响，但是尽量不要吃太多。糖尿病的病人主要是要控制主食的摄入量，主食可以多吃一些米类的食物和粗粮，应该多吃一些含糖量低的水果以及蔬菜，不要暴饮暴食，平时应该多参加户外运动。"
    },
    {
        "q": "孕妇高血糖吃什么好",
        "a": "1、紫菜：紫菜中含有多种维生素，以及锌元素，低脂肪含量对高血糖人群来说极其有利。空腹时食用紫菜、或是制作成紫菜汤，都可以起到降血糖的作用。2、黑木耳：黑木耳中含有多糖成分，可以起到降血糖作用。并且其中含有较多的蛋白质、胡萝卜素、以及矿物质，可以有效满足孕妇每日所需要的营养。"
    },
    {
        "q": "糖尿病患者选择水果要注意什么？",
        "a": "水果当中含有大量的矿物质，果酸以及维生素，但是糖尿病患者在选择水果的时候，一定注意不要吃糖量过高的水果，应该注意食用含糖量比较低的水果，如猕猴桃，梨，橘子，苹果，西瓜等，而应该注意减少食用红果，柿子，香蕉，糖尿病患者在平时的时候还应该注意控制总热量。"
    },
    {
        "q": "血糖高吃什么好的快",
        "a": "血糖高只有体内分泌胰岛素才能够降低血糖，其它的所有食物或者激素都是升高血糖；血糖高不仅仅要依靠药物来治疗，还需要严格控制饮食，以及适当运动；降血糖不是光靠吃某些食物来降低血糖的，而是需要控制饮食的摄入，减少血糖的摄入，并且适当运动来增加血糖利用，才是控制血糖的前提。"
    },
    {
        "q": "糖尿病人能吃马铃薯吗",
        "a": "您好，糖尿病人是可以吃马铃薯的，但是马铃薯不能作为菜，它只能作为主食，和馒头，米饭是一样的。把马铃薯作为主食吃，这时馒头或者米饭就要少吃或者不吃了。这样对血糖的影响就不大，如果把它作为菜吃，那么就可能使血糖升高了，糖尿病人平时的运动是很重要的，如果你觉得今天饮食没控制太好，那就多运动些。"
    },
    {
        "q": "糖尿病的原因？",
        "a": "糖尿病形成的原因有很多，一般最常见的是两种原因，一种是因为体内的胰岛素分泌不足导致的，因为胰岛素是人体内唯一的降低血糖的激素，如果胰岛素分泌不足就会导致血糖升高。另一种原因就是胰岛素抵抗是因为机体利用葡萄糖的器官产生了胰岛素抗体，胰岛素在体内不能发挥降血糖的作用，所以导致血糖升高。"
    },
    {
        "q": "糖尿病人吃什么能胖点",
        "a": "糖尿病患者可以口服一些降糖的药物进行治疗或者注射胰岛素治疗，每天测量血糖，把血糖控的正常值，防止血糖过高或者过低，如果出现低血糖反应，可以口服一些糖水进行缓解，日常生活中少吃甜的食物和水果，适当锻炼身体，促进血液循环，提高机体免疫能力，避免体重过胖。"
    },
    {
        "q": "糖尿病男人性生活？",
        "a": "糖尿病男人当然可以过性生活。糖尿病又不是传染病，但是糖尿病男人的性生活不宜过频，如果过频的话会导致血糖升高并出现阳痿或早泄等一系列的问题。糖尿病是由于机体的内分泌状态发生改变而发生的，而性生活会导致内分泌发生改变。所以糖尿病人的性生活最好控制在一周之内一到两次。"
    },
    {
        "q": "糖尿病人能吃什么水果好呢？",
        "a": "糖尿病病史非常长，现在出现眼底病变的现象，血糖控制不是很理想，这种情况不建议吃水果，如果吃水果一天只能吃一种水果，只能吃1～2两，不可以超量，需要分次食用，食用后所含的糖分需要将主食中能管的减去，这样防止出现血糖来源增多的现象，有利于控制血糖。"
    },
    {
        "q": "糖尿病2型要不要打胰岛素",
        "a": "糖尿病2型是否要打胰岛素是根据患者血糖值的高度以及对口服降压药的耐药性来决定，不同的胰岛素使用的剂量使用方法是不一样的，患者不要擅自调整，根据医师的指导进行使用胰岛素，同时日常生活中饮食方面要少食多餐，避免高脂肪高胆固醇的食物，适当的进行身体锻炼。"
    },
    {
        "q": "怎样预防糖尿病",
        "a": "每天坚持做一定的活动，能够有效的预防糖尿病。每天可以坚持走路30分钟，并。不受场地的限制，能够及时调解步伐，对人体的关节损伤是比较小的。预防糖尿病还应该注意控制饮食，调整饮食结构，不宜食用过多糖分，脂肪，还应注意戒除烟酒，改变不良习惯，控制睡眠时间。"
    },
    {
        "q": "我有糖尿病可以要孩子吗",
        "a": "糖尿病患者是可以要小孩的。但是要小孩前应该控制好血糖。更改治疗糖尿病的方案。因为怀孕后服用药物是有很多的禁忌症。患有糖尿病的患者平时饮食需要比较注意的，应该避免吃含糖的食物。需要低脂低钠的饮食。定时的检测血糖。需要按照医生的医嘱选择服用降糖药物进行治疗。"
    },
    {
        "q": "糖尿病的诊断标准有哪些",
        "a": "糖尿病的诊断标准目前还是按照随机血糖超过11.1摩尔每升或者检查糖耐量试验阳性以及糖化血红蛋白数值超过6.5%而明确诊断。如果通过上述检查明确是属于糖尿病，则是需要长期服用口服降糖药物治疗或者皮下注射胰岛素治疗的，使用药物治疗期间还要定期监测血糖水平。"
    },
    {
        "q": "糖尿病人可以怀孕吗",
        "a": "糖尿病病人是可以怀孕的，但是糖尿病病人在怀孕之前一定要及早调整个人的血糖水平，把血糖控制在一个很好的范围之内，另过详细检查看看患者本身目前有没有出现糖尿病的并发症，如果出现了糖尿病的并发症，建议还是慎重怀孕，另外糖尿病如果打算怀孕，一定要考虑胰岛素治疗，避免药物的使用。"
    },
    {
        "q": "血糖高是怎样引起的？可以检查出来吗",
        "a": "出现了血糖的增高可能和饮食、遗传、环境有直接的关系的，特别是肥胖的人群、自身免疫有关系的，可以考虑及时的到医院进行血糖的检测，空腹血糖以及餐后2小时血糖等等，糖尿病往往比较容易诱发出现心脑血管的疾病，是需要及时的口服药物控制，同时注意合理控制饮食。"
    },
    {
        "q": "糖尿病人能吃豆角吗",
        "a": "糖尿病人是可以吃豆角的。豆角本身含有的淀粉和糖并不是很多的，所以糖尿病人可以正常的吃豆角。另外糖尿病人一定要注意自己血糖的波动情况，一定要注意血糖的变化，每天一定要定期的使用血糖仪测量血糖值，口服降糖的药物或者使用胰岛素促进血糖下降。一定要配合适当的锻炼身体。"
    },
    {
        "q": "妊娠期糖尿病需要控制饮食吗？",
        "a": "糖尿病的主要的治疗的方法是基础治疗方法和药物治疗，其中饮食治疗是非常重要的，应该长期严格执行。妊娠期糖尿病患者也是需要控制饮食的，每天摄入的营养成分，既能够保证孕产妇和孩子的需要，又至于引起糖过高，有肥胖的患者要控制体重，整个孕期体重增长是12.5公斤左右，不能吃含糖比较高的食物。"
    },
    {
        "q": "糖尿病患者为什么会出现糖尿和尿量增多？",
        "a": "糖尿病出现糖尿是因为血液中的糖分过高，肾脏不能够完全代谢，部分糖分随尿液被排出身体外，而尿路多也是因为尿中的糖分高，使尿的渗透压增高，向肾小管扩张导致尿量增多。糖尿病出现尿糖，尿量增多都是临床上常见症状，只有血糖控制在正常范围之内症状自然会慢慢消失。"
    },
    {
        "q": "怀孕空腹血糖高怎么办？",
        "a": "怀孕期间血糖偏高属于妊娠期糖尿病，患有妊娠期糖尿病的孕妇是需要积极的控制血糖的，孕妇长期血糖偏高，容易对胎儿的生长发育造成不良影响。如果孕妇的空腹血糖以及餐后两小时血糖长期偏高，首先可以通过控制饮食和加强体育锻炼来控制血糖，如果血糖控制不佳，最好使用胰岛素来将血糖控制在正常范围内。"
    },
    {
        "q": "糖尿病做爱会传染给女性吗",
        "a": "糖尿病的病人做爱的时候是不会传染给女性的，糖尿病并不是一种传染性疾病。糖尿病是临床上常见的内分泌方面的疾病，患者在患病期间可能会出现多饮、多食、多尿、体重减少等一系列临床症状。这个时候一定要在专业医生的指导下接受系统的治疗，从而帮助维持正常的血糖水平。"
    },
    {
        "q": "糖尿病要忌口什么食物",
        "a": "糖尿病患者生活中忌口的食物有很多，一是高糖的饮食，比如红糖、白糖、含糖量较高的水果；二是高脂肪的食物，比如油炸的食物、动物的脂肪、动物的内脏、蛋黄、鱼子等；三是避免进食高盐的食物。这些食物会升高患者的血糖、血脂、血压，增加患者的血粘度，促进动脉硬化的进展。"
    },
    {
        "q": "糖尿病可以喝粥吗",
        "a": "糖尿病患者不适合喝粥，粥的熬制时间越长，糖尿病患者服用之后血糖就会明显升高；糖尿病对饮食应该要节制，不要吃粥类食物，馄饨、水饺型的混合性食物，最好也不要食用；这些食物本身热量就很高，所以糖尿病患者使用之后会导致血糖很快升高，对治疗和调理糖尿病不好。"
    },
    {
        "q": "糖尿病人可以吃西瓜吗？",
        "a": "糖尿病人是不可以吃西瓜的，因为西瓜的含糖量高，若是糖尿病人食用西瓜，是容易导致血糖升高的，并且对病情严重的患者，会出现代谢紊乱现象、酸中毒现象，甚至造成了危及生命的影响。所以糖尿病人是需要避免食用此类高糖分的食物，要严格遵医嘱做好控制治疗，来稳定病情。"
    },
    {
        "q": "糖尿病静脉曲张怎么办？",
        "a": "有糖尿病的患者，如果出现静脉曲张，尤其是严重的静脉曲张很容易发生静脉曲张部位的皮肤破溃，甚至引发静脉炎。所以有静脉曲张的患者，首先要积极的控制血糖，保证血糖控制良好，减少发生感染的风险。如果静脉曲张症状比较轻，不需要特殊的治疗。如果静脉曲张严重，必要时要进行手术切除。"
    },
    {
        "q": "得了糖尿病能活多久？",
        "a": "糖尿病的病程比较长，长期的糖尿病可能会引起很多的并发症，是致死致残的主要的原因。但是我们国家现在的医疗水平很高，每个人对自己的身体状况也是非常的关心，大部分有糖尿病的患者都会及早的进行治疗，只要经过治疗之后，可以把血糖控制在满意的范围之内，会延缓并发症的发生，寿命还是比较长的。"
    },
    {
        "q": "？糖尿病人能吃什么水果吗？",
        "a": "患有糖尿病的病人，应该根据空腹血糖，糖奶量或者糖化血红蛋白等的检查结果，口服降糖药物或者注射胰岛素治疗。平时一定要注意忌口，可以吃柚子，梨，苹果等含糖量低的水果，控制主食摄入量，多吃一些苦瓜，黄瓜，秋葵，丝瓜等蔬菜。应该多参加有氧的户外运动。"
    },
    {
        "q": "请问婴儿不吃米粉怎么回事？",
        "a": "三个月的宝宝胃肠功能消化还不完善，不主张这个年龄添加辅食。等宝宝四五个月以后再开始添加米粉，米粉虽然没有味道，但是宝宝也是可以吃的，因为宝宝没有接触过其他食品，是适合原味食品的。这么大的宝宝尽量先不要吃太甜的食物，是没有必要加贝因美葡萄糖的。"
    },
    {
        "q": "糖尿病会转成低血糖吗?",
        "a": "糖尿病的患者也可以引起低血糖的病情发生，尤其是在患者用降糖药物过量或者胰岛素注射过量的情况下，出现低血糖并发症的病情比较常见，有些患者是由于出现有身体极度衰弱，不能进食的情况下，也可以引起低血糖的病情发生。需要患者及时进行血糖的监测检查，明确诊断。"
    },
    {
        "q": "糖尿病症状是什么？",
        "a": "糖尿病症状临床症状主要是血糖过高导致尿糖排泄越多出现多尿；尿液增多，导致患者口渴有多饮症状；大量葡萄糖从尿液中排出导致患者饥饿状态引起食欲出现多食症状。而体重去出现下降症状，同时高血压会导致患者视力出现下降，葡萄糖不能被充分利用身体也会有乏力症状出现。"
    },
    {
        "q": "糖尿病吃二甲双胍长期服用对身体有副作用吗",
        "a": "二甲双胍是二型糖尿病肥胖的患者首选的药物，这种药物的副作用也比较小，主要是消化道方面的不良反应，其次是皮肤过敏，如果用量比较大，也可以引起乳酸性酸中毒。二甲双胍也是目前广泛应用的一种药物，可以单独使用，也可以和其它的降血糖的药物合用，是治疗糖尿病的一线药物。"
    },
    {
        "q": "糖尿病吃药期间怀孕孩子能要吗",
        "a": "男性糖尿病吃药期间，女性怀孕对胎儿的影响不是非常大，可以继续妊娠，怀孕作用孕期检查，主要观察胎儿的发育情况。但女性糖尿病患者用药期间怀孕，对于胎儿的影响是很大的，容易导致胎儿发育不良，造成畸形流产等，建议女性在控制好血糖的情况下在怀孕，避免对胎儿造成影响。"
    },
    {
        "q": "老人患有糖尿病吃什么药降糖比较好？",
        "a": "糖尿病是一种生活方式疾病，并且影响了胰岛素的功能，减少了胰岛的分泌等原因造成，因此治疗糖尿病需要综合性的治疗才能够获得好的效果，首先要减少血糖的来源，控制饮食治疗。平时要加强运动，通过运动的方式，消耗掉血糖。选择胰岛素或者双胍类的药物以及促进胰岛素分泌的药物治疗。"
    },
    {
        "q": "降血糖最有效的方法是什么",
        "a": "降血糖最有效的方法是要根据个人的情况来决定的，如果是个糖尿病早期胰腺功能本身完好建议还是口服降糖药，根据个人的血糖餐前血糖以及餐后血糖的水平，来分别选取合适的降糖药口服来调整血糖水平，但如果是一个胰腺功能已经完全丧失的，则就需要注射胰岛素来进行糖尿病的一个控制。"
    },
    {
        "q": "糖尿病该注意哪些饮食问题？",
        "a": "糖尿病人应该注意控制食盐的摄入量，低钠饮食。如果高钠饮食就会加剧血容量，造成高血压，使得心脏负担加重，还会引起动脉粥样硬化。糖尿病患者还应该注意不要食用高糖食物，如巧克力，葡萄糖，蜂蜜，蜜饯，果脯等。糖尿病患者还应该注意忌烟酒，可以食用苦瓜，洋葱，莴苣等。"
    },
    {
        "q": "请问如果三高心脏病糖尿病高血压者",
        "a": "患者目前主要是存在心脏病，有存在糖尿病高血压，那这种情况出现，如果有存在血压升高的情况下，首先需要在医师指导下服用降糖药物，需要在医师指导下服用降压药物来改善目前情况，如果血压和血糖控制不好的情况下，极容易导致动脉粥样硬化加重，建议平时需要注意休息。"
    },
    {
        "q": "糖尿病可以分为哪几种类型",
        "a": "糖尿病可以分为四大类型，1型糖尿病，2型糖尿病，其它特殊类型糖尿病，妊娠期糖尿病。妊娠期糖尿病是不建议患者使用口服药，需要通过胰岛素治疗，多数患上生完孩子后血糖恢复正常。其它特殊类型糖尿病除了控制血糖外要针对疾病的治疗。而1型糖尿病，2型糖尿病要根据病情程度选择降糖药或者胰岛素保持血糖稳定。"
    },
    {
        "q": "空腹血糖7，3是糖尿病吗",
        "a": "空腹需要达到8到10小时血糖检测达到7.35mmol/L确诊糖尿病，空腹没有达到8小时以上是不可以确诊的。糖尿病确诊除了空腹检测以外，餐后2小时血糖指数等于大于11.1mmol/L即可确诊糖尿病。糖尿病病程长，血糖控制不稳定会导致并发症的出现。"
    },
    {
        "q": "糖尿病人降血糖吃那种药我都一直打胰岛素的",
        "a": "糖尿病降血糖具有是采用胰岛素还是药物降糖是根据患者具体病情来确定的，血糖出现不稳定需要要医院降血糖血糖调整，找出病因对症治疗。患者本身不要擅自服用降血糖药物或者加大胰岛素剂量。在饮食方面需要控制总热量，避免高糖高脂肪食物，以及适当的进行运动调整血糖指数。"
    },
    {
        "q": "怀孕必须做糖尿病筛查吗",
        "a": "在怀孕期间，由于体内激素的影响，有一部分的孕产妇的血糖会增高，因此在怀孕的24周到28周做糖耐量试验是非常有必要的，可以从空腹血糖和餐后两小时血糖，判断一下孕产妇有没有糖尿病，孕产妇糖尿病的诊断标准与普通的人也是不一样的，一旦诊断为糖尿病，要及早的进行治疗，以免对孩子造成严重的影响。"
    },
    {
        "q": "六味地黄丸糖尿病患者可以服用吗",
        "a": "六味地黄丸是否适合糖尿病的患者服用，需要根据病人的具体病情来进行判断，如果糖尿病的患者在出现有肾阴虚的情况下，是可以服用六味地黄丸来进行治疗的，这种药物具有良好的改善肾阴虚的作用，而且也具有一定的消渴作用，比较适合出现有肾阴虚糖尿病患者服用。"
    },
    {
        "q": "空腹血糖6.4。饭后2小时血糖是6.5",
        "a": "空腹血糖6.4饭后两小时血糖6.5是正常的。空腹血糖6.4说明空腹血糖是稍微偏高的状态，正常空腹血糖值在3.9~6.1毫摩尔每升。如果空腹血糖大于6.9毫摩尔每升时，考虑患有糖尿病的可能。饭后两小时血糖6.5处于饭后两小时血糖正常值范围4.4-7.8毫摩尔每升当中，所以处于正常范围。如果饭后两小时血糖超过7.8毫摩尔每升，那么属于糖尿病。"
    },
    {
        "q": "患糖尿病怎么治最好",
        "a": "糖尿病属于一种慢性的疾病，也是一种无法治疗痊愈的疾病，需要进行综合性的治疗，首先要控制饮食，少吃含糖比较高的食物，另外也要进行运动治疗，做好血糖的自我监测和糖尿病的管理，要戒烟戒酒，也要点减轻体重，经过这些调理之后，效果不是太好，可以在医生的医嘱下采取降糖的药物来进行治疗，主要包括口服用药和胰岛素。"
    },
    {
        "q": "糖尿病并发症有哪些症状？",
        "a": "糖尿病是一种以高血糖为主的代谢性的疾病，它的并发症是非常多的，主要有急性的并发症和慢性的并发症，急性并发症，包括酮症酸中毒和高血糖高渗性昏迷，慢性的病程是主要包括糖尿病肾病，糖尿病视网膜病和糖尿病足，有了糖尿病之后，机体的抵抗能力比较低下，很容易引起感染。"
    },
    {
        "q": "妊娠期糖尿病能吃什么零食",
        "a": "妊娠期糖尿病的患者平时可以将苹果、猕猴桃、柚子等一些水果作为零食。女性在怀孕期间很容易出现内分泌功能的失调，这个时候就会诱发出现糖尿病的情况。怀孕中的女性最好不要吃一些含糖量过高的零食，否则会引起血糖水平的波动，从而导致胎儿生长发育异常，产生严重的后果。"
    },
    {
        "q": "糖尿病人能吃老南瓜蒸饭吗",
        "a": "糖尿病人不能够吃老南瓜，老南瓜是含糖分比较多的食物。实在想吃时可以减少主食的用量，糖尿病人同时不能够吃地瓜、芋头、地瓜类。因为这类食物淀粉含量都比较高，会影响血糖。糖尿病人平时要多吃含纤维素多的新鲜蔬菜，如芹菜，油菜，白菜，平时饮食要定时定量，粗细搭配，荤素结合。"
    },
    {
        "q": "糖尿病可以喝粥吗",
        "a": "糖尿病患者不适合喝粥，粥的熬制时间越长，糖尿病患者服用之后血糖就会明显升高；糖尿病对饮食应该要节制，不要吃粥类食物，馄饨、水饺型的混合性食物，最好也不要食用；这些食物本身热量就很高，所以糖尿病患者使用之后会导致血糖很快升高，对治疗和调理糖尿病不好。"
    },
    {
        "q": "糖尿病人可以吃西瓜吗？",
        "a": "糖尿病人是不可以吃西瓜的，因为西瓜的含糖量高，若是糖尿病人食用西瓜，是容易导致血糖升高的，并且对病情严重的患者，会出现代谢紊乱现象、酸中毒现象，甚至造成了危及生命的影响。所以糖尿病人是需要避免食用此类高糖分的食物，要严格遵医嘱做好控制治疗，来稳定病情。"
    },
    {
        "q": "糖尿病静脉曲张怎么办？",
        "a": "有糖尿病的患者，如果出现静脉曲张，尤其是严重的静脉曲张很容易发生静脉曲张部位的皮肤破溃，甚至引发静脉炎。所以有静脉曲张的患者，首先要积极的控制血糖，保证血糖控制良好，减少发生感染的风险。如果静脉曲张症状比较轻，不需要特殊的治疗。如果静脉曲张严重，必要时要进行手术切除。"
    },
    {
        "q": "得了糖尿病能活多久？",
        "a": "糖尿病的病程比较长，长期的糖尿病可能会引起很多的并发症，是致死致残的主要的原因。但是我们国家现在的医疗水平很高，每个人对自己的身体状况也是非常的关心，大部分有糖尿病的患者都会及早的进行治疗，只要经过治疗之后，可以把血糖控制在满意的范围之内，会延缓并发症的发生，寿命还是比较长的。"
    },
    {
        "q": "？糖尿病人能吃什么水果吗？",
        "a": "患有糖尿病的病人，应该根据空腹血糖，糖奶量或者糖化血红蛋白等的检查结果，口服降糖药物或者注射胰岛素治疗。平时一定要注意忌口，可以吃柚子，梨，苹果等含糖量低的水果，控制主食摄入量，多吃一些苦瓜，黄瓜，秋葵，丝瓜等蔬菜。应该多参加有氧的户外运动。"
    },
    {
        "q": "请问婴儿不吃米粉怎么回事？",
        "a": "三个月的宝宝胃肠功能消化还不完善，不主张这个年龄添加辅食。等宝宝四五个月以后再开始添加米粉，米粉虽然没有味道，但是宝宝也是可以吃的，因为宝宝没有接触过其他食品，是适合原味食品的。这么大的宝宝尽量先不要吃太甜的食物，是没有必要加贝因美葡萄糖的。"
    },
    {
        "q": "糖尿病会转成低血糖吗?",
        "a": "糖尿病的患者也可以引起低血糖的病情发生，尤其是在患者用降糖药物过量或者胰岛素注射过量的情况下，出现低血糖并发症的病情比较常见，有些患者是由于出现有身体极度衰弱，不能进食的情况下，也可以引起低血糖的病情发生。需要患者及时进行血糖的监测检查，明确诊断。"
    },
    {
        "q": "糖尿病症状是什么？",
        "a": "糖尿病症状临床症状主要是血糖过高导致尿糖排泄越多出现多尿；尿液增多，导致患者口渴有多饮症状；大量葡萄糖从尿液中排出导致患者饥饿状态引起食欲出现多食症状。而体重去出现下降症状，同时高血压会导致患者视力出现下降，葡萄糖不能被充分利用身体也会有乏力症状出现。"
    },
    {
        "q": "糖尿病吃二甲双胍长期服用对身体有副作用吗",
        "a": "二甲双胍是二型糖尿病肥胖的患者首选的药物，这种药物的副作用也比较小，主要是消化道方面的不良反应，其次是皮肤过敏，如果用量比较大，也可以引起乳酸性酸中毒。二甲双胍也是目前广泛应用的一种药物，可以单独使用，也可以和其它的降血糖的药物合用，是治疗糖尿病的一线药物。"
    },
    {
        "q": "糖尿病吃药期间怀孕孩子能要吗",
        "a": "男性糖尿病吃药期间，女性怀孕对胎儿的影响不是非常大，可以继续妊娠，怀孕作用孕期检查，主要观察胎儿的发育情况。但女性糖尿病患者用药期间怀孕，对于胎儿的影响是很大的，容易导致胎儿发育不良，造成畸形流产等，建议女性在控制好血糖的情况下在怀孕，避免对胎儿造成影响。"
    },
    {
        "q": "老人患有糖尿病吃什么药降糖比较好？",
        "a": "糖尿病是一种生活方式疾病，并且影响了胰岛素的功能，减少了胰岛的分泌等原因造成，因此治疗糖尿病需要综合性的治疗才能够获得好的效果，首先要减少血糖的来源，控制饮食治疗。平时要加强运动，通过运动的方式，消耗掉血糖。选择胰岛素或者双胍类的药物以及促进胰岛素分泌的药物治疗。"
    },
    {
        "q": "降血糖最有效的方法是什么",
        "a": "降血糖最有效的方法是要根据个人的情况来决定的，如果是个糖尿病早期胰腺功能本身完好建议还是口服降糖药，根据个人的血糖餐前血糖以及餐后血糖的水平，来分别选取合适的降糖药口服来调整血糖水平，但如果是一个胰腺功能已经完全丧失的，则就需要注射胰岛素来进行糖尿病的一个控制。"
    },
    {
        "q": "糖尿病该注意哪些饮食问题？",
        "a": "糖尿病人应该注意控制食盐的摄入量，低钠饮食。如果高钠饮食就会加剧血容量，造成高血压，使得心脏负担加重，还会引起动脉粥样硬化。糖尿病患者还应该注意不要食用高糖食物，如巧克力，葡萄糖，蜂蜜，蜜饯，果脯等。糖尿病患者还应该注意忌烟酒，可以食用苦瓜，洋葱，莴苣等。"
    },
    {
        "q": "请问如果三高心脏病糖尿病高血压者",
        "a": "患者目前主要是存在心脏病，有存在糖尿病高血压，那这种情况出现，如果有存在血压升高的情况下，首先需要在医师指导下服用降糖药物，需要在医师指导下服用降压药物来改善目前情况，如果血压和血糖控制不好的情况下，极容易导致动脉粥样硬化加重，建议平时需要注意休息。"
    },
    {
        "q": "糖尿病可以分为哪几种类型",
        "a": "糖尿病可以分为四大类型，1型糖尿病，2型糖尿病，其它特殊类型糖尿病，妊娠期糖尿病。妊娠期糖尿病是不建议患者使用口服药，需要通过胰岛素治疗，多数患上生完孩子后血糖恢复正常。其它特殊类型糖尿病除了控制血糖外要针对疾病的治疗。而1型糖尿病，2型糖尿病要根据病情程度选择降糖药或者胰岛素保持血糖稳定。"
    },
    {
        "q": "空腹血糖7，3是糖尿病吗",
        "a": "空腹需要达到8到10小时血糖检测达到7.35mmol/L确诊糖尿病，空腹没有达到8小时以上是不可以确诊的。糖尿病确诊除了空腹检测以外，餐后2小时血糖指数等于大于11.1mmol/L即可确诊糖尿病。糖尿病病程长，血糖控制不稳定会导致并发症的出现。"
    },
    {
        "q": "糖尿病人降血糖吃那种药我都一直打胰岛素的",
        "a": "糖尿病降血糖具有是采用胰岛素还是药物降糖是根据患者具体病情来确定的，血糖出现不稳定需要要医院降血糖血糖调整，找出病因对症治疗。患者本身不要擅自服用降血糖药物或者加大胰岛素剂量。在饮食方面需要控制总热量，避免高糖高脂肪食物，以及适当的进行运动调整血糖指数。"
    },
    {
        "q": "怀孕必须做糖尿病筛查吗",
        "a": "在怀孕期间，由于体内激素的影响，有一部分的孕产妇的血糖会增高，因此在怀孕的24周到28周做糖耐量试验是非常有必要的，可以从空腹血糖和餐后两小时血糖，判断一下孕产妇有没有糖尿病，孕产妇糖尿病的诊断标准与普通的人也是不一样的，一旦诊断为糖尿病，要及早的进行治疗，以免对孩子造成严重的影响。"
    },
    {
        "q": "六味地黄丸糖尿病患者可以服用吗",
        "a": "六味地黄丸是否适合糖尿病的患者服用，需要根据病人的具体病情来进行判断，如果糖尿病的患者在出现有肾阴虚的情况下，是可以服用六味地黄丸来进行治疗的，这种药物具有良好的改善肾阴虚的作用，而且也具有一定的消渴作用，比较适合出现有肾阴虚糖尿病患者服用。"
    },
    {
        "q": "空腹血糖6.4。饭后2小时血糖是6.5",
        "a": "空腹血糖6.4饭后两小时血糖6.5是正常的。空腹血糖6.4说明空腹血糖是稍微偏高的状态，正常空腹血糖值在3.9~6.1毫摩尔每升。如果空腹血糖大于6.9毫摩尔每升时，考虑患有糖尿病的可能。饭后两小时血糖6.5处于饭后两小时血糖正常值范围4.4-7.8毫摩尔每升当中，所以处于正常范围。如果饭后两小时血糖超过7.8毫摩尔每升，那么属于糖尿病。"
    },
    {
        "q": "患糖尿病怎么治最好",
        "a": "糖尿病属于一种慢性的疾病，也是一种无法治疗痊愈的疾病，需要进行综合性的治疗，首先要控制饮食，少吃含糖比较高的食物，另外也要进行运动治疗，做好血糖的自我监测和糖尿病的管理，要戒烟戒酒，也要点减轻体重，经过这些调理之后，效果不是太好，可以在医生的医嘱下采取降糖的药物来进行治疗，主要包括口服用药和胰岛素。"
    },
    {
        "q": "糖尿病并发症有哪些症状？",
        "a": "糖尿病是一种以高血糖为主的代谢性的疾病，它的并发症是非常多的，主要有急性的并发症和慢性的并发症，急性并发症，包括酮症酸中毒和高血糖高渗性昏迷，慢性的病程是主要包括糖尿病肾病，糖尿病视网膜病和糖尿病足，有了糖尿病之后，机体的抵抗能力比较低下，很容易引起感染。"
    },
    {
        "q": "妊娠期糖尿病能吃什么零食",
        "a": "妊娠期糖尿病的患者平时可以将苹果、猕猴桃、柚子等一些水果作为零食。女性在怀孕期间很容易出现内分泌功能的失调，这个时候就会诱发出现糖尿病的情况。怀孕中的女性最好不要吃一些含糖量过高的零食，否则会引起血糖水平的波动，从而导致胎儿生长发育异常，产生严重的后果。"
    },
    {
        "q": "糖尿病人能吃老南瓜蒸饭吗",
        "a": "糖尿病人不能够吃老南瓜，老南瓜是含糖分比较多的食物。实在想吃时可以减少主食的用量，糖尿病人同时不能够吃地瓜、芋头、地瓜类。因为这类食物淀粉含量都比较高，会影响血糖。糖尿病人平时要多吃含纤维素多的新鲜蔬菜，如芹菜，油菜，白菜，平时饮食要定时定量，粗细搭配，荤素结合。"
    },
    {
        "q": "怀孕血糖高可以吃橙子吗？",
        "a": "孕妇血糖高应该注意尽量的不要吃橙子。橙子含糖量是比较高的，所以最好不要食用。孕妇血糖高应该注意选择低盐，低糖的食物，并且应该注意不要吃甜食。还应该注意避免吃动物的内脏，瓜子，油炸食品，最好清淡饮食。平时可吃一些粗粮，应该注意控制热量，还需定期去医院检查血糖。"
    },
    {
        "q": "颈部淋巴结转移怎么办？",
        "a": "颈部淋巴结转移是恶性肿瘤中常见的转移方式，会出现淋巴结的肿大，只能够通过手术切除淋巴结的肿大进行组织病理学检查，确认现在病理的分型以及肿瘤的生物学行为，制定治疗方案决定是否继续进行放化疗的治疗。同时需要控制糖分的摄入，以免糖尿病发作影响颈部淋巴结转移的治疗。"
    },
    {
        "q": "胰岛素偏高会怎么样？",
        "a": "胰岛素水平偏高，常见于2型糖尿病患者发病早期，因为此时体内存在胰岛素抵抗，正常分泌的胰岛素不能满足机体的需要，这时候就会分泌更多胰岛素来满足我们正常机体的降糖需要，这时检测胰岛素水平就要高；还有就是见于胰岛细胞的肿瘤，胰岛细胞不受控制，分泌大量的胰岛素，这时患者会频繁出现低血糖。"
    },
    {
        "q": "得妊娠期糖尿病的孕妇可以吃蜂蜜吗？",
        "a": "得了妊娠期糖尿病的女性最好不要吃蜂蜜。蜂蜜中的糖分含量过高，如果妊娠期糖尿病的患者吃蜂蜜，很容易引起血糖水平的波动，不利于维持胎儿的身体健康。妊娠期糖尿病的患者在选择饮食的时候一定要十分慎重，尽量吃一些含糖量低的食物。平时只有保持低糖低脂的饮食习惯，才能够帮助稳定生命体征。"
    },
    {
        "q": "糖尿病人能吃小米粥吗？",
        "a": "糖尿病患者一般是建议多喝小米粥，因为小米粥属于是稀饭类的食物，升糖指数非常高，糖尿病患者喝小米粥以后会引起血糖在短期内的急剧波动，造成血糖明显增高，不利于血糖控制，有可能会导致出现一些并发症，糖尿病患者尽量减少吃水饺，面条，馄饨等面食。注意适当活动和锻炼。"
    },
    {
        "q": "治疗糖尿病有什么药？",
        "a": "治疗糖尿病的药物是比较多，口服药物主要以磺脲类的降糖药物；双胍类降糖药物，糖苷酶抑制剂，噻唑烷二酮类等为主，注射药物胰岛素有长效，短效，混合型。糖尿病需要根据自己的血糖指数，身体状况等方面现在适合的降糖药，这是在医生的指导下，患者自己不可以擅自更换药物。"
    },
    {
        "q": "糖尿病患者要注意什么呢？",
        "a": "糖尿病患者在生活当中需要注意的问题有很多，稍不注意就会导致糖尿病加重。病人在平时的时候需要健康饮食，尤其需要注意不饱和脂肪酸的含量，需要保证充足营养，但是又必须控制总热量，以免造成肥胖。糖尿病人日常需要注意荤素搭配合理，控制体重，加强体育锻炼。"
    },
    {
        "q": "糖尿病最新治疗方法",
        "a": "最新的糖尿病治疗方法，就是应用降糖药物或者是应用胰岛素进行治疗的同时，配合饮食调理加强运动，除此之外没有很好的治疗办法的。出现糖尿病之后，需要在医生指导下应用药物进行治疗同时饮食要避免吃过甜食物，还要注意多进行活动，通过这些措施血糖是可以控制在稳定水平的。"
    },
    {
        "q": "老是感觉口渴是怎么回事",
        "a": "总是感觉口渴，是因为体内，缺少水分比较多，夜间口渴可以先检查一下睡眠环境是不是比较干燥，可以放一个加湿器，在白天可以多喝水，多吃一些水果，经常口渴就是体内水分不足，还有就是肾虚，虚肾阳虚的人夜间很容易口渴，可以通过治疗肾虚改善总是感觉口渴的症状。，"
    },
    {
        "q": "孕妇饭后血糖正常值应该是多少？",
        "a": "一般孕妇餐后血糖最高值不要超过7.9，如果超过7.9的话，是不排除有妊娠期糖尿病的现象，是需要再进一步的进行检查的，空腹血糖一般不建议超过5.1，如果血糖超过正常值范围的话，建议应用胰岛素来进行治疗，在怀孕期间不建议口服降糖药物，确定妊娠期糖尿病的患者是需要控制饮食，注意适当运动的。"
    },
    {
        "q": "糖尿病饭前78饭后两小时96能吃消渴丸吗",
        "a": "糖尿病饭前7.8饭后两小时9.6，都说明血糖控制的不好，病人可以吃消渴丸，消渴丸里面含有刺激胰岛素分泌的药物，能够降低血糖。但是消渴丸这种药物毒副作用比较大，不建议选择应用。平时注意控制饮食，减少主食摄入量，并且加强有氧运动，通过运动的方式，促进血糖的转化和利用。能够选择缓和降低血糖的药物治疗。"
    },
    {
        "q": "餐后血糖7.9正常吗，糖尿病人",
        "a": "餐后血糖年轻人身体健康，没有疾病，餐后血糖需要控制小于7.8mmol/L，对于中年人有心血管疾病的可以宽松些控制在7.8-10.0mmol/L之间。餐后血糖高要严格控制饮食的摄入量和控制体重，保持体重指标在小于23(体重(公斤)/身高(米)2)。过高需要通过药物降糖。"
    },
    {
        "q": "你好我想问下糖尿病阴性严重还是阳性严重",
        "a": "做糖尿病的检查结果是阴性，说明你你是没有糖尿病的疾病的。检查出来的结果是阳性，说明你可能会有糖尿病的。做检查出来的结果阴性是说明没事，阳性是说明有疾病发生。有糖尿病会引起多饮、多食、多尿、身体消瘦等症状等。检查出来有糖尿病必要的，需要通过药物进行控制血糖的。"
    },
    {
        "q": "我现在血糖高能吃木瓜吗？",
        "a": "首先对于糖尿病人群来说，水果并不是完全禁忌的，大部分水果都可以适当吃一些，木瓜里面含有一定的糖分以及淀粉，可以分解为葡萄糖，引起血糖增高，但是少量多次的使用对血糖的影响并不会太大，所以说可以适当的吃一些，除此之外，平时注意少吃一些碳水化合物含量高的食物。"
    },
    {
        "q": "高血糖高贫血可以喝豆浆吗",
        "a": "血糖偏高的情况下也是可以适当的喝一些豆浆的，但重要的就是注意，尽量不要喝一些甜豆浆，不要放糖，同时也注意，尽量不要吃一些热量偏高的食物，不要吃一些油炸的食品，否则也容易导致出现有血糖的异常增高，尽量做到饮食的多样化，但是也要控制好饮食的总热量，加强运动锻炼。"
    },
    {
        "q": "糖尿病人日常该如何护理？",
        "a": "糖尿病患者有不同的饮食要求，一些病人担心血糖会上升得太多，要求食物的减少摄入量导致营养不良，而一些病人会暴饮暴食，因为对待自己的疾病太粗心，所以糖尿病的饮食，教育工作非常重要，要告知患者，根据实际情况，定餐并吃固定量的食物，血糖可以定期检查。控制不稳定的病人需要根据医生的指示经常检查，当控制稳定时，应每三个月检查一次相关并发症。"
    },
    {
        "q": "糖尿病人可以喝牛奶吗",
        "a": "糖尿病人是可以喝牛奶的，牛奶含有丰富的优质蛋白与微量元素，可以提高糖尿病人的免疫和抵抗能力。糖尿病人平时注意少吃米和面做的主食，适当的多吃含有粗纤维类的蔬菜，比如大白菜，青菜、萝卜、豆芽等有利于调节血糖。还要药物控制血糖，目前常用的药有二甲双胍缓释片或者格列吡嗪。"
    },
    {
        "q": "请问下糖尿病并发症挂什么科室啊",
        "a": "糖尿病属于内分泌科疾病。医院检查治疗看内分泌科或者专门的糖尿病科。糖尿病是由于胰岛素分泌缺陷或者胰岛素作用障碍出现高血糖为特征的代谢性疾病，长期的高血糖对组织器官造成损害甚至衰竭，严重情况下导致死亡。糖尿病的治疗简单，通过饮食调节，药物治疗控制血糖在正常范围之内。"
    },
    {
        "q": "无糖饼干糖尿病能吃吗？",
        "a": "无糖食品尤其是无糖饼干是可以吃的，但是不宜过量，虽然进入体内不会产生太多的糖分，但是这种食物也是会产生主能量的，每天摄入的能量太多对糖尿病患者也是非常不利的。无糖饼干可以作为一种零食吃，只是在饥饿或者是血糖低的情况下，偶尔的吃一下，吃了之后要把饼干的热量算入当天的食谱中。"
    },
    {
        "q": "糖尿病人啥时候打胰岛素比较好",
        "a": "糖糖尿病病人使用胰岛素的最佳时间是饭前半小时以内，一般进行注射胰岛素半小时左右就开始进餐，这样可以有效的利用胰岛素功能，并且可以避免长时间没有进餐而导致的低血糖反应，一般餐后两小时都建议进行量血糖监测，如果血糖素质较高，需要适当加大胰岛素量或者减少食物的分量，根据血糖数值调整治疗方案的。"
    },
    {
        "q": "糖尿病脚麻吃银杏叶片可以吗",
        "a": "糖尿病患者出现有脚麻，由于病因不同，治疗也有着明显的区别；如果患者出现有动脉硬化引起的病情发作，可以选择使用活血化瘀类药物来进行疾病的治疗，常用的药物，主要包括有银杏叶片等；如果是由于末梢神经炎所引起的脚麻，可以选择使用营养神经的药物治疗，常用的药物主要是弥可保等。"
    },
    {
        "q": "有糖尿病，但是血糖是正常水平",
        "a": "糖尿病血糖高度是没有上限，临床最高可以达到80多，正常人空腹血糖是在6.1mmol/L以下，持续性的高血压会导致急性并发症酮症酸中毒的出现危机到患者生命，要及时讲血糖以及针对性治疗治疗。糖尿病患者要通过口服降糖药，胰岛素降糖保持在正常血糖值内。"
    },
    {
        "q": "治糖尿病怎么治最好",
        "a": "糖尿病的治疗，由生活方式调治和药物调治，生活方式需要控制热量的摄入，每公斤体重摄入25~30千克的热量，如果肥胖的病人需要逐渐控制热量，使其体重下降到正常的体重。配合有氧运动，通过运动消耗和转化利用血糖。药物治疗选择抑制血糖吸收的药物，或者促进胰岛素分泌，以及增加胰岛素敏感性的药物，应用双胍类的药物治疗。"
    },
    {
        "q": "糖尿病人吃什么好",
        "a": "糖尿病的患者在饮食上需要注意，可以选择多吃一些不含糖或者含糖量极低的蔬菜和水果，可以选择吃一些含有纤维素比较丰富的食物，如芹菜，韭菜，菠菜等绿色蔬菜，尽量少吃一些主食，避免吃含有脂肪比较丰富，油炸食物；在生活当中进行适度的活动，注意劳逸结合。"
    },
    {
        "q": "妊娠期糖尿病有什么症状",
        "a": "轻度的妊娠期糖尿病可能并没有什么症状，有的则会表现为普通的糖尿病症状如多饮，多食、多尿等，需要经过尿常规和血糖检测来确诊。此外，患有妊娠糖尿病的患者，在怀孕期间可能会出现婴儿生长过快、长成巨大儿以及羊水较多的情况。妊娠糖尿病的发生与遗传因素、孕妇的年龄以及怀孕期间体重增长过快等都有关系。"
    },
    {
        "q": "高血糖可以吃什么水果？",
        "a": "高血糖在饮食上要注意，可以多吃一些含糖量低的食物及水果，可以吃一些苹果，柚子，梨，橘子，石榴等水果，要控制主食的摄入量，每顿饭尽量进食八分饱，主食应该以米类食物为主，要保持饮食规律，不要吃刺激性的食物，可以多参加一些有氧的户外运动，定期复查血糖。"
    },
    {
        "q": "糖尿病人皮肤瘙痒怎么办",
        "a": "糖尿病患者出现皮肤瘙痒的症状，尤其是外阴瘙痒，这与体内的葡萄糖含量增高有一定的关系，皮肤相对来说比较干燥，能够引起瘙痒，尿糖升高也能够刺激外阴部引起什么样，另外糖尿病很容易引起感染，真菌感染之后也可以引起皮肤和外阴瘙痒，主要的治疗的方法就是要把血糖控制在满意的范围之内。"
    },
    {
        "q": "糖尿病者可以吃麦片吗",
        "a": "糖尿病是可以吃麦片的，麦片是属于粗纤维类的食物，蛋白含量也比较高，脂肪含量偏低。但是麦片也是可以提供能量物质的，糖尿病的患者如果吃一些麦片的话，就需要相应的减少一下主食的量，食用完之后一定要监测血糖，如果血糖出现了明显波动的情况，下次就不建议再食用了。"
    },
    {
        "q": "餐后血糖8.7正常吗",
        "a": "正常餐后两个小时的血糖应小于等于7.8毫摩尔每升。餐后一个小时的血糖正常值为6.7~9.4毫摩每升。如果你的是餐后一个小时的血糖的话，那么是正常的，如果是餐后两个小时血糖为8.7的话那么就不正常，如果是7.8的话，那么还是属于正常范围的。如果是餐后两个小时的血糖大于了11.1毫摩尔每升，那么就可能是有糖尿病。这样的情况下，就需要去做一个空腹血糖。"
    },
    {
        "q": "糖尿病患者血压高有200多怎么办",
        "a": "糖尿病的患者要加强血压的控制，而且血压控制的又相对比较严格，如果是轻中年患者要控制在130 /80毫米汞柱以下，如果是中老年人血压水平可以适当增高。控制血压要从两方面努力。一是饮食上要限制食盐的摄入，适当的进行体育锻炼。而是在监测血压的基础上口服降压药，一种药物不行就要联合药物口服，这样才能降低心血管风险。"
    },
    {
        "q": "盐酸二甲双胍缓释片怎么样吃",
        "a": "二甲双胍是一种非常有效的降糖药物，它常见的副作用有胃肠道的反应 ，可以引起胃区不适或者是肠道功能的紊乱，一般是建议在吃饭的时候吃，可以减轻这些不适感。根据患者的血糖情况来确定服用的剂量，定期监测血糖的情况，平时饮食要多注意，制定一个合理的锻炼计划。"
    },
    {
        "q": "高血糖喝小米粥行吗",
        "a": "患有高血糖的人群，也是可以适量地喝些小米粥的，不过不宜过量地喝，因为小米里面含有淀粉成分，如果吃太多的话，容易造成血糖增高的，所以饮食的同时，还是得合理一些有保障，并且一些血糖高的人群，也不可以吃一些含糖成分过高的食物，容易造成血糖明显增高，对身体存在伤害。"
    },
    {
        "q": "糖尿病人能不能吃红薯",
        "a": "糖尿病人最好不要吃红薯，或者少量的吃红薯。因为红薯的糖分比较高，并且淀粉含量也比较高，对于糖尿病患者不宜一次性大量的进食，大量进食红薯除了引起血糖升高外，还容易引起胃肠胀气，胃肠消化功能差的人群吃多后会引起腹胀不适或烧心。血糖控制的好的人群可以在两餐之间少量食用。"
    },
    {
        "q": "血糖高是糖尿病吗",
        "a": "血糖高不一定是糖尿病，可能是应激因素引起的血糖升高，也有可能是空腹血糖或者是餐后血糖受损，但是没有达到诊断糖尿病的标准。糖尿病的诊断主要是基于空腹血糖，任意时间的血糖和糖耐量试验中两小时的血糖值，需要做两次进行确诊，诊断才能够成立。偶尔的一次出现血糖增高不是糖尿病。"
    },
    {
        "q": "糖尿病能根治吗？",
        "a": "糖尿病在目前是没有根治的方法，只能通过运动治疗，饮食调整，药物治疗控制血糖在正常范围内，降血糖药物主要有双胍类，磺脲类，格列奈类等具体的使用需要根据糖尿病具体情况而定，口服降糖药效果不明显要采用注射胰岛素治疗，胰岛素注射剂量根据患者血糖值及药物敏感性确定。"
    },
    {
        "q": "糖尿病人吃什么零食比较好？",
        "a": "糖尿病人要严格控制饮食的，应尽量避免含糖食物、减少进食高脂肪高热量的食物。零食建议是以水果为主如猕猴桃、火龙果、西柚、苹果、西红柿、黄瓜等。也可以备些无糖食物如苏打饼干、燕麦饼干、全麦面包等；坚果类的开心果、腰果、大杏仁等是可以选择的。也可以备些脱脂牛奶。"
    },
    {
        "q": "糖尿病人排尿困难小便失禁怎么办",
        "a": "糖尿病患者出现尿失禁，这是自主神经病变受到了损害，引起了泌尿生殖系统的功能障碍，针对这种情况，首先是要控制血糖，有肥胖的患者也要进行减肥，要经常锻炼盆底肌肉，另外也可以配合药物治疗，可以吃一些营养神经的药物，经过行为治疗和药物治疗无效者可以采取手术治疗。"
    },
    {
        "q": "血糖高可以喝奶粉吗",
        "a": "血糖偏高的人群最好不要喝奶粉。不管是低糖奶粉还是无乳糖不含糖的奶粉。由于其主要成分中虽然写了没有糖分，但由于各种厂家的标准不一样，其是否含糖仍不能够保证。建议血糖偏高的人群最好不要选择奶粉，可以选择喝一些纯牛奶补充蛋白摄入量。也可以选择鸡蛋，每天两个左右，补充人体所需蛋白。"
    },
    {
        "q": "糖尿病瘦了是怎么回事？",
        "a": "糖尿病患者出现体重严重下降，通常表示患者胰岛功能完全衰竭或者功能极度下降，甚至可导致成人一型糖尿病的发生。临床上，体重偏瘦的糖尿病患者，相对肥胖的糖尿病患者血糖更不易管理。由于偏瘦的糖尿病患者，其胰岛功能受损较严重。通常需要选择胰岛素管理血糖。同时偏瘦的糖尿病患者其糖尿病病程较长，并发症较多，治疗相对更加复杂和困难。"
    },
    {
        "q": "女性糖尿病的早期症状您好",
        "a": "糖尿病在早期一般情况下没有任何的症状，只是空腹血糖或者是餐后血糖偏高，很少出现了糖尿病的典型症状，有的患者发病比较隐匿，发现了慢性的合并症，医院检查时才知道自己有糖尿病。糖尿病的诊断是非常简单的，只需要去医院做一下血浆空腹血糖或者是餐后两小时血糖，就可以知道血糖是否超过了正常范围。"
    },
    {
        "q": "糖尿病五驾马车是什么？",
        "a": "糖尿病的5驾马车是最重要的基础治疗的措施，主要包括的内容有糖尿病健康教育，要全面的了解一下患者的情况，饮食治疗，要控制体重，控制中热量的摄入，要进行有规律的运动能够提高胰岛素的敏感性，要对自己的血糖做自我监测，及时发现血糖的变化，最后一项是药物治疗，根据患者的情况，选择比较合适的药物。"
    },
    {
        "q": "糖尿病人吃什么才可以不吃？",
        "a": "糖尿病是饮食不当的原因造成，因此治疗糖尿病需要控制血糖的来源，主要控制主食的摄入量，特别是控制热量的来源，避免吃含有糖分以及含有淀粉丰富的食物，不能吃含有油脂丰富的食物以及油炸制品，需要吃粗杂粮以及含有糖分比较低的蔬菜类食物，需要补充充足的蛋白质。"
    },
    {
        "q": "请问糖尿病人补血吃紫菜头？",
        "a": "糖尿病人是可以吃紫菜头的。紫菜头当中含有很多的微量元素，属于强碱性的食物。经常的食用一些紫菜头还带等海产品能够调节身体的酸碱性。糖尿病的人饮食调理是非常重要的。一般都要尽可能吃一些脂肪含量比较低，糖分和盐分比较少的食物，可以多吃一些碳水化合物以及纤维素比较高的食物。"
    },
    {
        "q": "糖尿病不能吃的食物有什么",
        "a": "糖尿病病人不宜吃的食物，主要是含糖量多的食物。比如糖蛋糕，蜂蜜这些含糖量多的食物是不能吃的，另外淀粉在体内代谢以后主要转化成葡萄糖，所以含淀粉多的食物也要少吃。由于肉类的主要成分是蛋白质脂肪，可以适当吃，但是脂肪也不要多吃。饮食要以低盐低糖低脂饮食为主，多吃水果蔬菜。"
    },
    {
        "q": "糖尿病患者用胰岛素之后还可以吃口服药物吗",
        "a": "严格意义上来说，胰岛素并不是药，而是人体内的一种必须的降血糖的物质，糖尿病患者在使用之后不会成瘾，需要不需要进行胰岛素治疗，或者使胰岛素治疗一段时间之后能不能够撤药换回口服的药物，这主要是看患者个人的病情，如果血糖控制的比较满意，基础治疗方面也是配合的比较好，当然可以换回口服的药。"
    },
    {
        "q": "糖尿病病人长期吃二甲双胍好吗？",
        "a": "糖尿病（II型）长期服用二甲双胍好与不好要根据医生检查诊断来确定，患者不要擅自更换，糖尿病慢性疾病，需要长期服用药物控制血糖，具体的用药是根据患者身体状况和血糖值的高低来确定。在药物治疗不明显情况下可以配合胰岛素使用，患者需要定期进行血糖检测和身体检查。"
    },
    {
        "q": "糖尿病，高血压病人，可以喝些什么茶好",
        "a": "糖尿病高血压患者可以喝一些黑茶。黑茶当中含有氨基酸，咖啡碱，磷脂，能够加速人体当中脂肪代谢，而且黑茶当中含有茶多糖复合物，能够降血糖。糖尿病高血压患者还可以喝乌龙茶，绿茶，茉莉花茶，山楂茶等。糖尿病高血压患者需注意控制饮食，可食用紫菜，苦瓜。"
    },
    {
        "q": "糖尿病打胰岛素的危害",
        "a": "二型糖尿病，如果注射胰岛素过量，会出现血糖过低引起脑部供应能量不足，引起脑死亡的现象，严重者也会危及生命。二型糖尿病的病人需要控制饮食，并且以运动为基础方法调理血糖治疗，如果胰岛素缺乏的比较严重，需要住院调理适当的剂量应用，并且定期复查血糖以及糖化血红蛋白情况。如有应用药物异常的现象，需要及时的检查血糖，防止出现低血糖等。"
    },
    {
        "q": "咨询糖尿病的早期症状有哪些？",
        "a": "部分糖尿病的患者在早期的时候表现症状并不明显，主要是通过体检的方式来了解自己已经患有了糖尿病。部分糖尿病患者在早期会出现多食、多尿以及多饮，甚至还会伴随身体消瘦的现象。患有糖尿病的患者要注意平时控制含糖量食物的摄入量，严重患者需要进行胰岛素的注射。"
    },
    {
        "q": "糖尿病患者为什么不能吃蜂蜜",
        "a": "糖尿病患者是不能服用含糖量高的食物的蜂蜜作为含有较高的果糖葡萄糖。糖尿病患者服用后会引起血糖过度升高，从而导致各种并发症的出现，所以糖尿病患者不能服用蜂蜜，而且还需要长期服用降糖药物或者皮下注射胰岛素治疗，日常生活中也是尽量不能进食含糖类的食物。"
    },
    {
        "q": "高血糖可以吃什么水果？",
        "a": "高血糖在饮食上要注意，可以多吃一些含糖量低的食物及水果，可以吃一些苹果，柚子，梨，橘子，石榴等水果，要控制主食的摄入量，每顿饭尽量进食八分饱，主食应该以米类食物为主，要保持饮食规律，不要吃刺激性的食物，可以多参加一些有氧的户外运动，定期复查血糖。"
    },
    {
        "q": "糖尿病人皮肤瘙痒怎么办",
        "a": "糖尿病患者出现皮肤瘙痒的症状，尤其是外阴瘙痒，这与体内的葡萄糖含量增高有一定的关系，皮肤相对来说比较干燥，能够引起瘙痒，尿糖升高也能够刺激外阴部引起什么样，另外糖尿病很容易引起感染，真菌感染之后也可以引起皮肤和外阴瘙痒，主要的治疗的方法就是要把血糖控制在满意的范围之内。"
    },
    {
        "q": "糖尿病者可以吃麦片吗",
        "a": "糖尿病是可以吃麦片的，麦片是属于粗纤维类的食物，蛋白含量也比较高，脂肪含量偏低。但是麦片也是可以提供能量物质的，糖尿病的患者如果吃一些麦片的话，就需要相应的减少一下主食的量，食用完之后一定要监测血糖，如果血糖出现了明显波动的情况，下次就不建议再食用了。"
    },
    {
        "q": "餐后血糖8.7正常吗",
        "a": "正常餐后两个小时的血糖应小于等于7.8毫摩尔每升。餐后一个小时的血糖正常值为6.7~9.4毫摩每升。如果你的是餐后一个小时的血糖的话，那么是正常的，如果是餐后两个小时血糖为8.7的话那么就不正常，如果是7.8的话，那么还是属于正常范围的。如果是餐后两个小时的血糖大于了11.1毫摩尔每升，那么就可能是有糖尿病。这样的情况下，就需要去做一个空腹血糖。"
    },
    {
        "q": "糖尿病患者血压高有200多怎么办",
        "a": "糖尿病的患者要加强血压的控制，而且血压控制的又相对比较严格，如果是轻中年患者要控制在130 /80毫米汞柱以下，如果是中老年人血压水平可以适当增高。控制血压要从两方面努力。一是饮食上要限制食盐的摄入，适当的进行体育锻炼。而是在监测血压的基础上口服降压药，一种药物不行就要联合药物口服，这样才能降低心血管风险。"
    },
    {
        "q": "盐酸二甲双胍缓释片怎么样吃",
        "a": "二甲双胍是一种非常有效的降糖药物，它常见的副作用有胃肠道的反应 ，可以引起胃区不适或者是肠道功能的紊乱，一般是建议在吃饭的时候吃，可以减轻这些不适感。根据患者的血糖情况来确定服用的剂量，定期监测血糖的情况，平时饮食要多注意，制定一个合理的锻炼计划。"
    },
    {
        "q": "高血糖喝小米粥行吗",
        "a": "患有高血糖的人群，也是可以适量地喝些小米粥的，不过不宜过量地喝，因为小米里面含有淀粉成分，如果吃太多的话，容易造成血糖增高的，所以饮食的同时，还是得合理一些有保障，并且一些血糖高的人群，也不可以吃一些含糖成分过高的食物，容易造成血糖明显增高，对身体存在伤害。"
    },
    {
        "q": "糖尿病人能不能吃红薯",
        "a": "糖尿病人最好不要吃红薯，或者少量的吃红薯。因为红薯的糖分比较高，并且淀粉含量也比较高，对于糖尿病患者不宜一次性大量的进食，大量进食红薯除了引起血糖升高外，还容易引起胃肠胀气，胃肠消化功能差的人群吃多后会引起腹胀不适或烧心。血糖控制的好的人群可以在两餐之间少量食用。"
    },
    {
        "q": "血糖高是糖尿病吗",
        "a": "血糖高不一定是糖尿病，可能是应激因素引起的血糖升高，也有可能是空腹血糖或者是餐后血糖受损，但是没有达到诊断糖尿病的标准。糖尿病的诊断主要是基于空腹血糖，任意时间的血糖和糖耐量试验中两小时的血糖值，需要做两次进行确诊，诊断才能够成立。偶尔的一次出现血糖增高不是糖尿病。"
    },
    {
        "q": "糖尿病能根治吗？",
        "a": "糖尿病在目前是没有根治的方法，只能通过运动治疗，饮食调整，药物治疗控制血糖在正常范围内，降血糖药物主要有双胍类，磺脲类，格列奈类等具体的使用需要根据糖尿病具体情况而定，口服降糖药效果不明显要采用注射胰岛素治疗，胰岛素注射剂量根据患者血糖值及药物敏感性确定。"
    },
    {
        "q": "糖尿病人吃什么零食比较好？",
        "a": "糖尿病人要严格控制饮食的，应尽量避免含糖食物、减少进食高脂肪高热量的食物。零食建议是以水果为主如猕猴桃、火龙果、西柚、苹果、西红柿、黄瓜等。也可以备些无糖食物如苏打饼干、燕麦饼干、全麦面包等；坚果类的开心果、腰果、大杏仁等是可以选择的。也可以备些脱脂牛奶。"
    },
    {
        "q": "糖尿病人排尿困难小便失禁怎么办",
        "a": "糖尿病患者出现尿失禁，这是自主神经病变受到了损害，引起了泌尿生殖系统的功能障碍，针对这种情况，首先是要控制血糖，有肥胖的患者也要进行减肥，要经常锻炼盆底肌肉，另外也可以配合药物治疗，可以吃一些营养神经的药物，经过行为治疗和药物治疗无效者可以采取手术治疗。"
    },
    {
        "q": "血糖高可以喝奶粉吗",
        "a": "血糖偏高的人群最好不要喝奶粉。不管是低糖奶粉还是无乳糖不含糖的奶粉。由于其主要成分中虽然写了没有糖分，但由于各种厂家的标准不一样，其是否含糖仍不能够保证。建议血糖偏高的人群最好不要选择奶粉，可以选择喝一些纯牛奶补充蛋白摄入量。也可以选择鸡蛋，每天两个左右，补充人体所需蛋白。"
    },
    {
        "q": "糖尿病瘦了是怎么回事？",
        "a": "糖尿病患者出现体重严重下降，通常表示患者胰岛功能完全衰竭或者功能极度下降，甚至可导致成人一型糖尿病的发生。临床上，体重偏瘦的糖尿病患者，相对肥胖的糖尿病患者血糖更不易管理。由于偏瘦的糖尿病患者，其胰岛功能受损较严重。通常需要选择胰岛素管理血糖。同时偏瘦的糖尿病患者其糖尿病病程较长，并发症较多，治疗相对更加复杂和困难。"
    },
    {
        "q": "女性糖尿病的早期症状您好",
        "a": "糖尿病在早期一般情况下没有任何的症状，只是空腹血糖或者是餐后血糖偏高，很少出现了糖尿病的典型症状，有的患者发病比较隐匿，发现了慢性的合并症，医院检查时才知道自己有糖尿病。糖尿病的诊断是非常简单的，只需要去医院做一下血浆空腹血糖或者是餐后两小时血糖，就可以知道血糖是否超过了正常范围。"
    },
    {
        "q": "糖尿病五驾马车是什么？",
        "a": "糖尿病的5驾马车是最重要的基础治疗的措施，主要包括的内容有糖尿病健康教育，要全面的了解一下患者的情况，饮食治疗，要控制体重，控制中热量的摄入，要进行有规律的运动能够提高胰岛素的敏感性，要对自己的血糖做自我监测，及时发现血糖的变化，最后一项是药物治疗，根据患者的情况，选择比较合适的药物。"
    },
    {
        "q": "糖尿病人吃什么才可以不吃？",
        "a": "糖尿病是饮食不当的原因造成，因此治疗糖尿病需要控制血糖的来源，主要控制主食的摄入量，特别是控制热量的来源，避免吃含有糖分以及含有淀粉丰富的食物，不能吃含有油脂丰富的食物以及油炸制品，需要吃粗杂粮以及含有糖分比较低的蔬菜类食物，需要补充充足的蛋白质。"
    },
    {
        "q": "请问糖尿病人补血吃紫菜头？",
        "a": "糖尿病人是可以吃紫菜头的。紫菜头当中含有很多的微量元素，属于强碱性的食物。经常的食用一些紫菜头还带等海产品能够调节身体的酸碱性。糖尿病的人饮食调理是非常重要的。一般都要尽可能吃一些脂肪含量比较低，糖分和盐分比较少的食物，可以多吃一些碳水化合物以及纤维素比较高的食物。"
    },
    {
        "q": "糖尿病不能吃的食物有什么",
        "a": "糖尿病病人不宜吃的食物，主要是含糖量多的食物。比如糖蛋糕，蜂蜜这些含糖量多的食物是不能吃的，另外淀粉在体内代谢以后主要转化成葡萄糖，所以含淀粉多的食物也要少吃。由于肉类的主要成分是蛋白质脂肪，可以适当吃，但是脂肪也不要多吃。饮食要以低盐低糖低脂饮食为主，多吃水果蔬菜。"
    },
    {
        "q": "糖尿病患者用胰岛素之后还可以吃口服药物吗",
        "a": "严格意义上来说，胰岛素并不是药，而是人体内的一种必须的降血糖的物质，糖尿病患者在使用之后不会成瘾，需要不需要进行胰岛素治疗，或者使胰岛素治疗一段时间之后能不能够撤药换回口服的药物，这主要是看患者个人的病情，如果血糖控制的比较满意，基础治疗方面也是配合的比较好，当然可以换回口服的药。"
    },
    {
        "q": "糖尿病病人长期吃二甲双胍好吗？",
        "a": "糖尿病（II型）长期服用二甲双胍好与不好要根据医生检查诊断来确定，患者不要擅自更换，糖尿病慢性疾病，需要长期服用药物控制血糖，具体的用药是根据患者身体状况和血糖值的高低来确定。在药物治疗不明显情况下可以配合胰岛素使用，患者需要定期进行血糖检测和身体检查。"
    },
    {
        "q": "糖尿病，高血压病人，可以喝些什么茶好",
        "a": "糖尿病高血压患者可以喝一些黑茶。黑茶当中含有氨基酸，咖啡碱，磷脂，能够加速人体当中脂肪代谢，而且黑茶当中含有茶多糖复合物，能够降血糖。糖尿病高血压患者还可以喝乌龙茶，绿茶，茉莉花茶，山楂茶等。糖尿病高血压患者需注意控制饮食，可食用紫菜，苦瓜。"
    },
    {
        "q": "糖尿病打胰岛素的危害",
        "a": "二型糖尿病，如果注射胰岛素过量，会出现血糖过低引起脑部供应能量不足，引起脑死亡的现象，严重者也会危及生命。二型糖尿病的病人需要控制饮食，并且以运动为基础方法调理血糖治疗，如果胰岛素缺乏的比较严重，需要住院调理适当的剂量应用，并且定期复查血糖以及糖化血红蛋白情况。如有应用药物异常的现象，需要及时的检查血糖，防止出现低血糖等。"
    },
    {
        "q": "咨询糖尿病的早期症状有哪些？",
        "a": "部分糖尿病的患者在早期的时候表现症状并不明显，主要是通过体检的方式来了解自己已经患有了糖尿病。部分糖尿病患者在早期会出现多食、多尿以及多饮，甚至还会伴随身体消瘦的现象。患有糖尿病的患者要注意平时控制含糖量食物的摄入量，严重患者需要进行胰岛素的注射。"
    },
    {
        "q": "糖尿病患者为什么不能吃蜂蜜",
        "a": "糖尿病患者是不能服用含糖量高的食物的蜂蜜作为含有较高的果糖葡萄糖。糖尿病患者服用后会引起血糖过度升高，从而导致各种并发症的出现，所以糖尿病患者不能服用蜂蜜，而且还需要长期服用降糖药物或者皮下注射胰岛素治疗，日常生活中也是尽量不能进食含糖类的食物。"
    },
    {
        "q": "请问血糖高的人可以吃葡萄、桔子，橙子吗",
        "a": "血糖高的人群最好不要吃葡萄，橙子，橘子等含糖指数高的水果，特别是餐后血糖偏高的人群。血糖偏高的人群可以适当的吃些含糖指数比较低的水果，含糖指数低的水果有猕猴桃，番薯，梨，柚子，樱桃，桃，李等，这些含糖指数低的水果最好在两餐之间食用，注意在餐后适当的进行体育锻炼。"
    },
    {
        "q": "血糖高可以吃小西红柿吗",
        "a": "血糖高当然可以吃小西红柿了。小西红柿也叫圣女果，含有丰富的胡萝卜素，番茄红素以及多种微量元素，有缓解心悸失眠，抗氧化，抗衰老的功效。圣女果的热量和糖分都比较低，有利于餐后血糖的稳定，小西红柿的营养价值很高，生吃熟吃都可以。除了小西红柿以外黄瓜，柚子，血糖高的人群也可以适当的吃点。"
    },
    {
        "q": "糖尿病人可以吃玉米吗",
        "a": "患有糖尿病的病人是可以吃玉米的，玉米是处于粗粮，适量的吃玉米，不会对血糖有影响，但是尽量不要吃太多。糖尿病的病人主要是要控制主食的摄入量，主食可以多吃一些米类的食物和粗粮，应该多吃一些含糖量低的水果以及蔬菜，不要暴饮暴食，平时应该多参加户外运动。"
    },
    {
        "q": "孕妇高血糖吃什么好",
        "a": "1、紫菜：紫菜中含有多种维生素，以及锌元素，低脂肪含量对高血糖人群来说极其有利。空腹时食用紫菜、或是制作成紫菜汤，都可以起到降血糖的作用。2、黑木耳：黑木耳中含有多糖成分，可以起到降血糖作用。并且其中含有较多的蛋白质、胡萝卜素、以及矿物质，可以有效满足孕妇每日所需要的营养。"
    },
    {
        "q": "糖尿病患者选择水果要注意什么？",
        "a": "水果当中含有大量的矿物质，果酸以及维生素，但是糖尿病患者在选择水果的时候，一定注意不要吃糖量过高的水果，应该注意食用含糖量比较低的水果，如猕猴桃，梨，橘子，苹果，西瓜等，而应该注意减少食用红果，柿子，香蕉，糖尿病患者在平时的时候还应该注意控制总热量。"
    },
    {
        "q": "血糖高吃什么好的快",
        "a": "血糖高只有体内分泌胰岛素才能够降低血糖，其它的所有食物或者激素都是升高血糖；血糖高不仅仅要依靠药物来治疗，还需要严格控制饮食，以及适当运动；降血糖不是光靠吃某些食物来降低血糖的，而是需要控制饮食的摄入，减少血糖的摄入，并且适当运动来增加血糖利用，才是控制血糖的前提。"
    },
    {
        "q": "糖尿病人能吃马铃薯吗",
        "a": "您好，糖尿病人是可以吃马铃薯的，但是马铃薯不能作为菜，它只能作为主食，和馒头，米饭是一样的。把马铃薯作为主食吃，这时馒头或者米饭就要少吃或者不吃了。这样对血糖的影响就不大，如果把它作为菜吃，那么就可能使血糖升高了，糖尿病人平时的运动是很重要的，如果你觉得今天饮食没控制太好，那就多运动些。"
    },
    {
        "q": "糖尿病的原因？",
        "a": "糖尿病形成的原因有很多，一般最常见的是两种原因，一种是因为体内的胰岛素分泌不足导致的，因为胰岛素是人体内唯一的降低血糖的激素，如果胰岛素分泌不足就会导致血糖升高。另一种原因就是胰岛素抵抗是因为机体利用葡萄糖的器官产生了胰岛素抗体，胰岛素在体内不能发挥降血糖的作用，所以导致血糖升高。"
    },
    {
        "q": "糖尿病人吃什么能胖点",
        "a": "糖尿病患者可以口服一些降糖的药物进行治疗或者注射胰岛素治疗，每天测量血糖，把血糖控的正常值，防止血糖过高或者过低，如果出现低血糖反应，可以口服一些糖水进行缓解，日常生活中少吃甜的食物和水果，适当锻炼身体，促进血液循环，提高机体免疫能力，避免体重过胖。"
    },
    {
        "q": "糖尿病男人性生活？",
        "a": "糖尿病男人当然可以过性生活。糖尿病又不是传染病，但是糖尿病男人的性生活不宜过频，如果过频的话会导致血糖升高并出现阳痿或早泄等一系列的问题。糖尿病是由于机体的内分泌状态发生改变而发生的，而性生活会导致内分泌发生改变。所以糖尿病人的性生活最好控制在一周之内一到两次。"
    },
    {
        "q": "糖尿病人能吃什么水果好呢？",
        "a": "糖尿病病史非常长，现在出现眼底病变的现象，血糖控制不是很理想，这种情况不建议吃水果，如果吃水果一天只能吃一种水果，只能吃1～2两，不可以超量，需要分次食用，食用后所含的糖分需要将主食中能管的减去，这样防止出现血糖来源增多的现象，有利于控制血糖。"
    },
    {
        "q": "糖尿病2型要不要打胰岛素",
        "a": "糖尿病2型是否要打胰岛素是根据患者血糖值的高度以及对口服降压药的耐药性来决定，不同的胰岛素使用的剂量使用方法是不一样的，患者不要擅自调整，根据医师的指导进行使用胰岛素，同时日常生活中饮食方面要少食多餐，避免高脂肪高胆固醇的食物，适当的进行身体锻炼。"
    },
    {
        "q": "怎样预防糖尿病",
        "a": "每天坚持做一定的活动，能够有效的预防糖尿病。每天可以坚持走路30分钟，并。不受场地的限制，能够及时调解步伐，对人体的关节损伤是比较小的。预防糖尿病还应该注意控制饮食，调整饮食结构，不宜食用过多糖分，脂肪，还应注意戒除烟酒，改变不良习惯，控制睡眠时间。"
    },
    {
        "q": "我有糖尿病可以要孩子吗",
        "a": "糖尿病患者是可以要小孩的。但是要小孩前应该控制好血糖。更改治疗糖尿病的方案。因为怀孕后服用药物是有很多的禁忌症。患有糖尿病的患者平时饮食需要比较注意的，应该避免吃含糖的食物。需要低脂低钠的饮食。定时的检测血糖。需要按照医生的医嘱选择服用降糖药物进行治疗。"
    },
    {
        "q": "糖尿病的诊断标准有哪些",
        "a": "糖尿病的诊断标准目前还是按照随机血糖超过11.1摩尔每升或者检查糖耐量试验阳性以及糖化血红蛋白数值超过6.5%而明确诊断。如果通过上述检查明确是属于糖尿病，则是需要长期服用口服降糖药物治疗或者皮下注射胰岛素治疗的，使用药物治疗期间还要定期监测血糖水平。"
    },
    {
        "q": "糖尿病人可以怀孕吗",
        "a": "糖尿病病人是可以怀孕的，但是糖尿病病人在怀孕之前一定要及早调整个人的血糖水平，把血糖控制在一个很好的范围之内，另过详细检查看看患者本身目前有没有出现糖尿病的并发症，如果出现了糖尿病的并发症，建议还是慎重怀孕，另外糖尿病如果打算怀孕，一定要考虑胰岛素治疗，避免药物的使用。"
    },
    {
        "q": "血糖12.5该怎么做",
        "a": "出现的血糖12.5，注意是否空腹血糖，空腹血糖达到12.5，建议口服降糖药物，同时需要注意检查具体的病情。有可能是出现了糖尿病，可以通过口服降糖药物来治疗，建议口服阿卡波糖或者是二甲双胍进行治疗，平时注意控制饮食，不能吃含糖量比较高的食物，避免暴饮暴食。"
    },
    {
        "q": "血糖高是怎样引起的？可以检查出来吗",
        "a": "出现了血糖的增高可能和饮食、遗传、环境有直接的关系的，特别是肥胖的人群、自身免疫有关系的，可以考虑及时的到医院进行血糖的检测，空腹血糖以及餐后2小时血糖等等，糖尿病往往比较容易诱发出现心脑血管的疾病，是需要及时的口服药物控制，同时注意合理控制饮食。"
    },
    {
        "q": "糖尿病人能吃豆角吗",
        "a": "糖尿病人是可以吃豆角的。豆角本身含有的淀粉和糖并不是很多的，所以糖尿病人可以正常的吃豆角。另外糖尿病人一定要注意自己血糖的波动情况，一定要注意血糖的变化，每天一定要定期的使用血糖仪测量血糖值，口服降糖的药物或者使用胰岛素促进血糖下降。一定要配合适当的锻炼身体。"
    },
    {
        "q": "妊娠期糖尿病需要控制饮食吗？",
        "a": "糖尿病的主要的治疗的方法是基础治疗方法和药物治疗，其中饮食治疗是非常重要的，应该长期严格执行。妊娠期糖尿病患者也是需要控制饮食的，每天摄入的营养成分，既能够保证孕产妇和孩子的需要，又至于引起糖过高，有肥胖的患者要控制体重，整个孕期体重增长是12.5公斤左右，不能吃含糖比较高的食物。"
    },
    {
        "q": "糖尿病患者为什么会出现糖尿和尿量增多？",
        "a": "糖尿病出现糖尿是因为血液中的糖分过高，肾脏不能够完全代谢，部分糖分随尿液被排出身体外，而尿路多也是因为尿中的糖分高，使尿的渗透压增高，向肾小管扩张导致尿量增多。糖尿病出现尿糖，尿量增多都是临床上常见症状，只有血糖控制在正常范围之内症状自然会慢慢消失。"
    },
    {
        "q": "糖尿病并发症的防治？",
        "a": "可能是糖尿病引起的并发症，会出现末梢微循环回流的障碍，如果糖尿病病人末梢神经调节异常。要进行检查皮肤有没有溃疡或者要配合服用营养神经类的药品，比如维生素类的药品，维生素b1或者是叶酸片。测量生命体征测量空腹血糖，餐后血糖以及血压，要服用降血压，改善心肌循环的药品。"
    },
    {
        "q": "怀孕空腹血糖高怎么办？",
        "a": "怀孕期间血糖偏高属于妊娠期糖尿病，患有妊娠期糖尿病的孕妇是需要积极的控制血糖的，孕妇长期血糖偏高，容易对胎儿的生长发育造成不良影响。如果孕妇的空腹血糖以及餐后两小时血糖长期偏高，首先可以通过控制饮食和加强体育锻炼来控制血糖，如果血糖控制不佳，最好使用胰岛素来将血糖控制在正常范围内。"
    },
    {
        "q": "怀孕前糖尿病,生完孩子会好吗",
        "a": "一般情况下，孕妇妊娠期糖尿病是在分娩后大部分病人是可以恢复正常水平的，但是也是有部分病人的代谢功能障碍后，在分娩后也无法恢复正常状态。如果分娩后进行继续监测，血糖仍无法恢复正常这种情况就需要进一步检查是属于哪一类型的糖尿病，然后根据检查结果判断后服用降糖药物或者使用胰岛素治疗。"
    },
    {
        "q": "糖尿病做爱会传染给女性吗",
        "a": "糖尿病的病人做爱的时候是不会传染给女性的，糖尿病并不是一种传染性疾病。糖尿病是临床上常见的内分泌方面的疾病，患者在患病期间可能会出现多饮、多食、多尿、体重减少等一系列临床症状。这个时候一定要在专业医生的指导下接受系统的治疗，从而帮助维持正常的血糖水平。"
    },
    {
        "q": "得了糖尿病能吃苹果吗",
        "a": "糖尿糖人可以适量吃苹果，但应选择含糖量低的水果，因为水果中含有葡萄糖、果糖、蔗糖、淀粉、果胶等，其中果糖代谢不需要胰岛素参与。果胶中含有可溶性纤维，能延缓葡萄糖的吸收。水果中还含有维生素、矿物质和水，有利于糖尿病的健康，但也含有葡萄糖，葡萄糖是糖尿病的一个不利因素。"
    },
    {
        "q": "糖尿病要忌口什么食物",
        "a": "糖尿病患者生活中忌口的食物有很多，一是高糖的饮食，比如红糖、白糖、含糖量较高的水果；二是高脂肪的食物，比如油炸的食物、动物的脂肪、动物的内脏、蛋黄、鱼子等；三是避免进食高盐的食物。这些食物会升高患者的血糖、血脂、血压，增加患者的血粘度，促进动脉硬化的进展。"
    },
    {
        "q": "餐后血糖高是怎么回事",
        "a": "血糖偏高有可能和平时的饮食习惯有关系，检查餐后血糖高，如果餐后两小时血糖超过11.1，应该是得了糖尿病。可以去医院的内分泌科就诊，在医生的指导下用药治疗，如果只是有一些偏高，可以通过控制饮食、运动的方法来控制血糖，一定要保持低糖饮食，多参加户外运动。"
    },
    {
        "q": "请问血糖高的人可以吃葡萄、桔子，橙子吗",
        "a": "血糖高的人群最好不要吃葡萄，橙子，橘子等含糖指数高的水果，特别是餐后血糖偏高的人群。血糖偏高的人群可以适当的吃些含糖指数比较低的水果，含糖指数低的水果有猕猴桃，番薯，梨，柚子，樱桃，桃，李等，这些含糖指数低的水果最好在两餐之间食用，注意在餐后适当的进行体育锻炼。"
    },
    {
        "q": "血糖高可以吃小西红柿吗",
        "a": "血糖高当然可以吃小西红柿了。小西红柿也叫圣女果，含有丰富的胡萝卜素，番茄红素以及多种微量元素，有缓解心悸失眠，抗氧化，抗衰老的功效。圣女果的热量和糖分都比较低，有利于餐后血糖的稳定，小西红柿的营养价值很高，生吃熟吃都可以。除了小西红柿以外黄瓜，柚子，血糖高的人群也可以适当的吃点。"
    },
    {
        "q": "糖尿病人可以吃玉米吗",
        "a": "患有糖尿病的病人是可以吃玉米的，玉米是处于粗粮，适量的吃玉米，不会对血糖有影响，但是尽量不要吃太多。糖尿病的病人主要是要控制主食的摄入量，主食可以多吃一些米类的食物和粗粮，应该多吃一些含糖量低的水果以及蔬菜，不要暴饮暴食，平时应该多参加户外运动。"
    },
    {
        "q": "孕妇高血糖吃什么好",
        "a": "1、紫菜：紫菜中含有多种维生素，以及锌元素，低脂肪含量对高血糖人群来说极其有利。空腹时食用紫菜、或是制作成紫菜汤，都可以起到降血糖的作用。2、黑木耳：黑木耳中含有多糖成分，可以起到降血糖作用。并且其中含有较多的蛋白质、胡萝卜素、以及矿物质，可以有效满足孕妇每日所需要的营养。"
    },
    {
        "q": "糖尿病患者选择水果要注意什么？",
        "a": "水果当中含有大量的矿物质，果酸以及维生素，但是糖尿病患者在选择水果的时候，一定注意不要吃糖量过高的水果，应该注意食用含糖量比较低的水果，如猕猴桃，梨，橘子，苹果，西瓜等，而应该注意减少食用红果，柿子，香蕉，糖尿病患者在平时的时候还应该注意控制总热量。"
    },
    {
        "q": "血糖高吃什么好的快",
        "a": "血糖高只有体内分泌胰岛素才能够降低血糖，其它的所有食物或者激素都是升高血糖；血糖高不仅仅要依靠药物来治疗，还需要严格控制饮食，以及适当运动；降血糖不是光靠吃某些食物来降低血糖的，而是需要控制饮食的摄入，减少血糖的摄入，并且适当运动来增加血糖利用，才是控制血糖的前提。"
    },
    {
        "q": "糖尿病人能吃马铃薯吗",
        "a": "您好，糖尿病人是可以吃马铃薯的，但是马铃薯不能作为菜，它只能作为主食，和馒头，米饭是一样的。把马铃薯作为主食吃，这时馒头或者米饭就要少吃或者不吃了。这样对血糖的影响就不大，如果把它作为菜吃，那么就可能使血糖升高了，糖尿病人平时的运动是很重要的，如果你觉得今天饮食没控制太好，那就多运动些。"
    },
    {
        "q": "糖尿病的原因？",
        "a": "糖尿病形成的原因有很多，一般最常见的是两种原因，一种是因为体内的胰岛素分泌不足导致的，因为胰岛素是人体内唯一的降低血糖的激素，如果胰岛素分泌不足就会导致血糖升高。另一种原因就是胰岛素抵抗是因为机体利用葡萄糖的器官产生了胰岛素抗体，胰岛素在体内不能发挥降血糖的作用，所以导致血糖升高。"
    },
    {
        "q": "糖尿病人吃什么能胖点",
        "a": "糖尿病患者可以口服一些降糖的药物进行治疗或者注射胰岛素治疗，每天测量血糖，把血糖控的正常值，防止血糖过高或者过低，如果出现低血糖反应，可以口服一些糖水进行缓解，日常生活中少吃甜的食物和水果，适当锻炼身体，促进血液循环，提高机体免疫能力，避免体重过胖。"
    },
    {
        "q": "糖尿病男人性生活？",
        "a": "糖尿病男人当然可以过性生活。糖尿病又不是传染病，但是糖尿病男人的性生活不宜过频，如果过频的话会导致血糖升高并出现阳痿或早泄等一系列的问题。糖尿病是由于机体的内分泌状态发生改变而发生的，而性生活会导致内分泌发生改变。所以糖尿病人的性生活最好控制在一周之内一到两次。"
    },
    {
        "q": "糖尿病人能吃什么水果好呢？",
        "a": "糖尿病病史非常长，现在出现眼底病变的现象，血糖控制不是很理想，这种情况不建议吃水果，如果吃水果一天只能吃一种水果，只能吃1～2两，不可以超量，需要分次食用，食用后所含的糖分需要将主食中能管的减去，这样防止出现血糖来源增多的现象，有利于控制血糖。"
    },
    {
        "q": "糖尿病2型要不要打胰岛素",
        "a": "糖尿病2型是否要打胰岛素是根据患者血糖值的高度以及对口服降压药的耐药性来决定，不同的胰岛素使用的剂量使用方法是不一样的，患者不要擅自调整，根据医师的指导进行使用胰岛素，同时日常生活中饮食方面要少食多餐，避免高脂肪高胆固醇的食物，适当的进行身体锻炼。"
    },
    {
        "q": "怎样预防糖尿病",
        "a": "每天坚持做一定的活动，能够有效的预防糖尿病。每天可以坚持走路30分钟，并。不受场地的限制，能够及时调解步伐，对人体的关节损伤是比较小的。预防糖尿病还应该注意控制饮食，调整饮食结构，不宜食用过多糖分，脂肪，还应注意戒除烟酒，改变不良习惯，控制睡眠时间。"
    },
    {
        "q": "我有糖尿病可以要孩子吗",
        "a": "糖尿病患者是可以要小孩的。但是要小孩前应该控制好血糖。更改治疗糖尿病的方案。因为怀孕后服用药物是有很多的禁忌症。患有糖尿病的患者平时饮食需要比较注意的，应该避免吃含糖的食物。需要低脂低钠的饮食。定时的检测血糖。需要按照医生的医嘱选择服用降糖药物进行治疗。"
    },
    {
        "q": "糖尿病的诊断标准有哪些",
        "a": "糖尿病的诊断标准目前还是按照随机血糖超过11.1摩尔每升或者检查糖耐量试验阳性以及糖化血红蛋白数值超过6.5%而明确诊断。如果通过上述检查明确是属于糖尿病，则是需要长期服用口服降糖药物治疗或者皮下注射胰岛素治疗的，使用药物治疗期间还要定期监测血糖水平。"
    },
    {
        "q": "糖尿病人可以怀孕吗",
        "a": "糖尿病病人是可以怀孕的，但是糖尿病病人在怀孕之前一定要及早调整个人的血糖水平，把血糖控制在一个很好的范围之内，另过详细检查看看患者本身目前有没有出现糖尿病的并发症，如果出现了糖尿病的并发症，建议还是慎重怀孕，另外糖尿病如果打算怀孕，一定要考虑胰岛素治疗，避免药物的使用。"
    },
    {
        "q": "血糖12.5该怎么做",
        "a": "出现的血糖12.5，注意是否空腹血糖，空腹血糖达到12.5，建议口服降糖药物，同时需要注意检查具体的病情。有可能是出现了糖尿病，可以通过口服降糖药物来治疗，建议口服阿卡波糖或者是二甲双胍进行治疗，平时注意控制饮食，不能吃含糖量比较高的食物，避免暴饮暴食。"
    },
    {
        "q": "血糖高是怎样引起的？可以检查出来吗",
        "a": "出现了血糖的增高可能和饮食、遗传、环境有直接的关系的，特别是肥胖的人群、自身免疫有关系的，可以考虑及时的到医院进行血糖的检测，空腹血糖以及餐后2小时血糖等等，糖尿病往往比较容易诱发出现心脑血管的疾病，是需要及时的口服药物控制，同时注意合理控制饮食。"
    },
    {
        "q": "糖尿病人能吃豆角吗",
        "a": "糖尿病人是可以吃豆角的。豆角本身含有的淀粉和糖并不是很多的，所以糖尿病人可以正常的吃豆角。另外糖尿病人一定要注意自己血糖的波动情况，一定要注意血糖的变化，每天一定要定期的使用血糖仪测量血糖值，口服降糖的药物或者使用胰岛素促进血糖下降。一定要配合适当的锻炼身体。"
    },
    {
        "q": "妊娠期糖尿病需要控制饮食吗？",
        "a": "糖尿病的主要的治疗的方法是基础治疗方法和药物治疗，其中饮食治疗是非常重要的，应该长期严格执行。妊娠期糖尿病患者也是需要控制饮食的，每天摄入的营养成分，既能够保证孕产妇和孩子的需要，又至于引起糖过高，有肥胖的患者要控制体重，整个孕期体重增长是12.5公斤左右，不能吃含糖比较高的食物。"
    },
    {
        "q": "糖尿病患者为什么会出现糖尿和尿量增多？",
        "a": "糖尿病出现糖尿是因为血液中的糖分过高，肾脏不能够完全代谢，部分糖分随尿液被排出身体外，而尿路多也是因为尿中的糖分高，使尿的渗透压增高，向肾小管扩张导致尿量增多。糖尿病出现尿糖，尿量增多都是临床上常见症状，只有血糖控制在正常范围之内症状自然会慢慢消失。"
    },
    {
        "q": "糖尿病并发症的防治？",
        "a": "可能是糖尿病引起的并发症，会出现末梢微循环回流的障碍，如果糖尿病病人末梢神经调节异常。要进行检查皮肤有没有溃疡或者要配合服用营养神经类的药品，比如维生素类的药品，维生素b1或者是叶酸片。测量生命体征测量空腹血糖，餐后血糖以及血压，要服用降血压，改善心肌循环的药品。"
    },
    {
        "q": "怀孕空腹血糖高怎么办？",
        "a": "怀孕期间血糖偏高属于妊娠期糖尿病，患有妊娠期糖尿病的孕妇是需要积极的控制血糖的，孕妇长期血糖偏高，容易对胎儿的生长发育造成不良影响。如果孕妇的空腹血糖以及餐后两小时血糖长期偏高，首先可以通过控制饮食和加强体育锻炼来控制血糖，如果血糖控制不佳，最好使用胰岛素来将血糖控制在正常范围内。"
    },
    {
        "q": "怀孕前糖尿病,生完孩子会好吗",
        "a": "一般情况下，孕妇妊娠期糖尿病是在分娩后大部分病人是可以恢复正常水平的，但是也是有部分病人的代谢功能障碍后，在分娩后也无法恢复正常状态。如果分娩后进行继续监测，血糖仍无法恢复正常这种情况就需要进一步检查是属于哪一类型的糖尿病，然后根据检查结果判断后服用降糖药物或者使用胰岛素治疗。"
    },
    {
        "q": "糖尿病做爱会传染给女性吗",
        "a": "糖尿病的病人做爱的时候是不会传染给女性的，糖尿病并不是一种传染性疾病。糖尿病是临床上常见的内分泌方面的疾病，患者在患病期间可能会出现多饮、多食、多尿、体重减少等一系列临床症状。这个时候一定要在专业医生的指导下接受系统的治疗，从而帮助维持正常的血糖水平。"
    },
    {
        "q": "得了糖尿病能吃苹果吗",
        "a": "糖尿糖人可以适量吃苹果，但应选择含糖量低的水果，因为水果中含有葡萄糖、果糖、蔗糖、淀粉、果胶等，其中果糖代谢不需要胰岛素参与。果胶中含有可溶性纤维，能延缓葡萄糖的吸收。水果中还含有维生素、矿物质和水，有利于糖尿病的健康，但也含有葡萄糖，葡萄糖是糖尿病的一个不利因素。"
    },
    {
        "q": "糖尿病要忌口什么食物",
        "a": "糖尿病患者生活中忌口的食物有很多，一是高糖的饮食，比如红糖、白糖、含糖量较高的水果；二是高脂肪的食物，比如油炸的食物、动物的脂肪、动物的内脏、蛋黄、鱼子等；三是避免进食高盐的食物。这些食物会升高患者的血糖、血脂、血压，增加患者的血粘度，促进动脉硬化的进展。"
    },
    {
        "q": "餐后血糖高是怎么回事",
        "a": "血糖偏高有可能和平时的饮食习惯有关系，检查餐后血糖高，如果餐后两小时血糖超过11.1，应该是得了糖尿病。可以去医院的内分泌科就诊，在医生的指导下用药治疗，如果只是有一些偏高，可以通过控制饮食、运动的方法来控制血糖，一定要保持低糖饮食，多参加户外运动。"
    },
    {
        "q": "得妊娠期糖尿病的孕妇可以吃蜂蜜吗？",
        "a": "得了妊娠期糖尿病的女性最好不要吃蜂蜜。蜂蜜中的糖分含量过高，如果妊娠期糖尿病的患者吃蜂蜜，很容易引起血糖水平的波动，不利于维持胎儿的身体健康。妊娠期糖尿病的患者在选择饮食的时候一定要十分慎重，尽量吃一些含糖量低的食物。平时只有保持低糖低脂的饮食习惯，才能够帮助稳定生命体征。"
    },
    {
        "q": "糖尿病人能吃小米粥吗？",
        "a": "糖尿病患者一般是建议多喝小米粥，因为小米粥属于是稀饭类的食物，升糖指数非常高，糖尿病患者喝小米粥以后会引起血糖在短期内的急剧波动，造成血糖明显增高，不利于血糖控制，有可能会导致出现一些并发症，糖尿病患者尽量减少吃水饺，面条，馄饨等面食。注意适当活动和锻炼。"
    },
    {
        "q": "得了糖尿病能活多久？",
        "a": "糖尿病的病程比较长，长期的糖尿病可能会引起很多的并发症，是致死致残的主要的原因。但是我们国家现在的医疗水平很高，每个人对自己的身体状况也是非常的关心，大部分有糖尿病的患者都会及早的进行治疗，只要经过治疗之后，可以把血糖控制在满意的范围之内，会延缓并发症的发生，寿命还是比较长的。"
    },
    {
        "q": "？糖尿病人能吃什么水果吗？",
        "a": "患有糖尿病的病人，应该根据空腹血糖，糖奶量或者糖化血红蛋白等的检查结果，口服降糖药物或者注射胰岛素治疗。平时一定要注意忌口，可以吃柚子，梨，苹果等含糖量低的水果，控制主食摄入量，多吃一些苦瓜，黄瓜，秋葵，丝瓜等蔬菜。应该多参加有氧的户外运动。"
    },
    {
        "q": "请问婴儿不吃米粉怎么回事？",
        "a": "三个月的宝宝胃肠功能消化还不完善，不主张这个年龄添加辅食。等宝宝四五个月以后再开始添加米粉，米粉虽然没有味道，但是宝宝也是可以吃的，因为宝宝没有接触过其他食品，是适合原味食品的。这么大的宝宝尽量先不要吃太甜的食物，是没有必要加贝因美葡萄糖的。"
    },
    {
        "q": "糖尿病会转成低血糖吗?",
        "a": "糖尿病的患者也可以引起低血糖的病情发生，尤其是在患者用降糖药物过量或者胰岛素注射过量的情况下，出现低血糖并发症的病情比较常见，有些患者是由于出现有身体极度衰弱，不能进食的情况下，也可以引起低血糖的病情发生。需要患者及时进行血糖的监测检查，明确诊断。"
    },
    {
        "q": "老是感觉口渴是怎么回事",
        "a": "总是感觉口渴，是因为体内，缺少水分比较多，夜间口渴可以先检查一下睡眠环境是不是比较干燥，可以放一个加湿器，在白天可以多喝水，多吃一些水果，经常口渴就是体内水分不足，还有就是肾虚，虚肾阳虚的人夜间很容易口渴，可以通过治疗肾虚改善总是感觉口渴的症状。，"
    },
    {
        "q": "糖尿病症状是什么？",
        "a": "糖尿病症状临床症状主要是血糖过高导致尿糖排泄越多出现多尿；尿液增多，导致患者口渴有多饮症状；大量葡萄糖从尿液中排出导致患者饥饿状态引起食欲出现多食症状。而体重去出现下降症状，同时高血压会导致患者视力出现下降，葡萄糖不能被充分利用身体也会有乏力症状出现。"
    },
    {
        "q": "糖尿病吃二甲双胍长期服用对身体有副作用吗",
        "a": "二甲双胍是二型糖尿病肥胖的患者首选的药物，这种药物的副作用也比较小，主要是消化道方面的不良反应，其次是皮肤过敏，如果用量比较大，也可以引起乳酸性酸中毒。二甲双胍也是目前广泛应用的一种药物，可以单独使用，也可以和其它的降血糖的药物合用，是治疗糖尿病的一线药物。"
    },
    {
        "q": "糖尿病该注意哪些饮食问题？",
        "a": "糖尿病人应该注意控制食盐的摄入量，低钠饮食。如果高钠饮食就会加剧血容量，造成高血压，使得心脏负担加重，还会引起动脉粥样硬化。糖尿病患者还应该注意不要食用高糖食物，如巧克力，葡萄糖，蜂蜜，蜜饯，果脯等。糖尿病患者还应该注意忌烟酒，可以食用苦瓜，洋葱，莴苣等。"
    },
    {
        "q": "请问如果三高心脏病糖尿病高血压者",
        "a": "患者目前主要是存在心脏病，有存在糖尿病高血压，那这种情况出现，如果有存在血压升高的情况下，首先需要在医师指导下服用降糖药物，需要在医师指导下服用降压药物来改善目前情况，如果血压和血糖控制不好的情况下，极容易导致动脉粥样硬化加重，建议平时需要注意休息。"
    },
    {
        "q": "我现在血糖高能吃木瓜吗？",
        "a": "首先对于糖尿病人群来说，水果并不是完全禁忌的，大部分水果都可以适当吃一些，木瓜里面含有一定的糖分以及淀粉，可以分解为葡萄糖，引起血糖增高，但是少量多次的使用对血糖的影响并不会太大，所以说可以适当的吃一些，除此之外，平时注意少吃一些碳水化合物含量高的食物。"
    },
    {
        "q": "高血糖高贫血可以喝豆浆吗",
        "a": "血糖偏高的情况下也是可以适当的喝一些豆浆的，但重要的就是注意，尽量不要喝一些甜豆浆，不要放糖，同时也注意，尽量不要吃一些热量偏高的食物，不要吃一些油炸的食品，否则也容易导致出现有血糖的异常增高，尽量做到饮食的多样化，但是也要控制好饮食的总热量，加强运动锻炼。"
    },
    {
        "q": "糖尿病人日常该如何护理？",
        "a": "糖尿病患者有不同的饮食要求，一些病人担心血糖会上升得太多，要求食物的减少摄入量导致营养不良，而一些病人会暴饮暴食，因为对待自己的疾病太粗心，所以糖尿病的饮食，教育工作非常重要，要告知患者，根据实际情况，定餐并吃固定量的食物，血糖可以定期检查。控制不稳定的病人需要根据医生的指示经常检查，当控制稳定时，应每三个月检查一次相关并发症。"
    },
    {
        "q": "糖尿病可以分为哪几种类型",
        "a": "糖尿病可以分为四大类型，1型糖尿病，2型糖尿病，其它特殊类型糖尿病，妊娠期糖尿病。妊娠期糖尿病是不建议患者使用口服药，需要通过胰岛素治疗，多数患上生完孩子后血糖恢复正常。其它特殊类型糖尿病除了控制血糖外要针对疾病的治疗。而1型糖尿病，2型糖尿病要根据病情程度选择降糖药或者胰岛素保持血糖稳定。"
    },
    {
        "q": "糖尿病人可以喝牛奶吗",
        "a": "糖尿病人是可以喝牛奶的，牛奶含有丰富的优质蛋白与微量元素，可以提高糖尿病人的免疫和抵抗能力。糖尿病人平时注意少吃米和面做的主食，适当的多吃含有粗纤维类的蔬菜，比如大白菜，青菜、萝卜、豆芽等有利于调节血糖。还要药物控制血糖，目前常用的药有二甲双胍缓释片或者格列吡嗪。"
    },
    {
        "q": "空腹血糖7，3是糖尿病吗",
        "a": "空腹需要达到8到10小时血糖检测达到7.35mmol/L确诊糖尿病，空腹没有达到8小时以上是不可以确诊的。糖尿病确诊除了空腹检测以外，餐后2小时血糖指数等于大于11.1mmol/L即可确诊糖尿病。糖尿病病程长，血糖控制不稳定会导致并发症的出现。"
    },
    {
        "q": "糖尿病人降血糖吃那种药我都一直打胰岛素的",
        "a": "糖尿病降血糖具有是采用胰岛素还是药物降糖是根据患者具体病情来确定的，血糖出现不稳定需要要医院降血糖血糖调整，找出病因对症治疗。患者本身不要擅自服用降血糖药物或者加大胰岛素剂量。在饮食方面需要控制总热量，避免高糖高脂肪食物，以及适当的进行运动调整血糖指数。"
    },
    {
        "q": "怀孕必须做糖尿病筛查吗",
        "a": "在怀孕期间，由于体内激素的影响，有一部分的孕产妇的血糖会增高，因此在怀孕的24周到28周做糖耐量试验是非常有必要的，可以从空腹血糖和餐后两小时血糖，判断一下孕产妇有没有糖尿病，孕产妇糖尿病的诊断标准与普通的人也是不一样的，一旦诊断为糖尿病，要及早的进行治疗，以免对孩子造成严重的影响。"
    },
    {
        "q": "六味地黄丸糖尿病患者可以服用吗",
        "a": "六味地黄丸是否适合糖尿病的患者服用，需要根据病人的具体病情来进行判断，如果糖尿病的患者在出现有肾阴虚的情况下，是可以服用六味地黄丸来进行治疗的，这种药物具有良好的改善肾阴虚的作用，而且也具有一定的消渴作用，比较适合出现有肾阴虚糖尿病患者服用。"
    },
    {
        "q": "糖尿病人啥时候打胰岛素比较好",
        "a": "糖糖尿病病人使用胰岛素的最佳时间是饭前半小时以内，一般进行注射胰岛素半小时左右就开始进餐，这样可以有效的利用胰岛素功能，并且可以避免长时间没有进餐而导致的低血糖反应，一般餐后两小时都建议进行量血糖监测，如果血糖素质较高，需要适当加大胰岛素量或者减少食物的分量，根据血糖数值调整治疗方案的。"
    },
    {
        "q": "空腹血糖6.4。饭后2小时血糖是6.5",
        "a": "空腹血糖6.4饭后两小时血糖6.5是正常的。空腹血糖6.4说明空腹血糖是稍微偏高的状态，正常空腹血糖值在3.9~6.1毫摩尔每升。如果空腹血糖大于6.9毫摩尔每升时，考虑患有糖尿病的可能。饭后两小时血糖6.5处于饭后两小时血糖正常值范围4.4-7.8毫摩尔每升当中，所以处于正常范围。如果饭后两小时血糖超过7.8毫摩尔每升，那么属于糖尿病。"
    },
    {
        "q": "糖尿病人吃什么好",
        "a": "糖尿病的患者在饮食上需要注意，可以选择多吃一些不含糖或者含糖量极低的蔬菜和水果，可以选择吃一些含有纤维素比较丰富的食物，如芹菜，韭菜，菠菜等绿色蔬菜，尽量少吃一些主食，避免吃含有脂肪比较丰富，油炸食物；在生活当中进行适度的活动，注意劳逸结合。"
    },
    {
        "q": "糖尿病人能吃老南瓜蒸饭吗",
        "a": "糖尿病人不能够吃老南瓜，老南瓜是含糖分比较多的食物。实在想吃时可以减少主食的用量，糖尿病人同时不能够吃地瓜、芋头、地瓜类。因为这类食物淀粉含量都比较高，会影响血糖。糖尿病人平时要多吃含纤维素多的新鲜蔬菜，如芹菜，油菜，白菜，平时饮食要定时定量，粗细搭配，荤素结合。"
    },
    {
        "q": "糖尿病人能吃月饼吗？",
        "a": "糖尿病的患者最好少吃或者是不吃月饼。月饼的含糖量极高，如果糖尿病的患者一次性吃过多的月饼，可能会引起患者血糖水平的升高。糖尿病的患者平时一定要注意保持低糖低脂的饮食习惯，尽量不要吃一些糖分含量过高的食物，否则会引起患者血糖水平的波动，产生严重的后果。"
    },
    {
        "q": "糖尿病者可以吃麦片吗",
        "a": "糖尿病是可以吃麦片的，麦片是属于粗纤维类的食物，蛋白含量也比较高，脂肪含量偏低。但是麦片也是可以提供能量物质的，糖尿病的患者如果吃一些麦片的话，就需要相应的减少一下主食的量，食用完之后一定要监测血糖，如果血糖出现了明显波动的情况，下次就不建议再食用了。"
    },
    {
        "q": "餐后血糖8.7正常吗",
        "a": "正常餐后两个小时的血糖应小于等于7.8毫摩尔每升。餐后一个小时的血糖正常值为6.7~9.4毫摩每升。如果你的是餐后一个小时的血糖的话，那么是正常的，如果是餐后两个小时血糖为8.7的话那么就不正常，如果是7.8的话，那么还是属于正常范围的。如果是餐后两个小时的血糖大于了11.1毫摩尔每升，那么就可能是有糖尿病。这样的情况下，就需要去做一个空腹血糖。"
    },
    {
        "q": "糖尿病患者血压高有200多怎么办",
        "a": "糖尿病的患者要加强血压的控制，而且血压控制的又相对比较严格，如果是轻中年患者要控制在130 /80毫米汞柱以下，如果是中老年人血压水平可以适当增高。控制血压要从两方面努力。一是饮食上要限制食盐的摄入，适当的进行体育锻炼。而是在监测血压的基础上口服降压药，一种药物不行就要联合药物口服，这样才能降低心血管风险。"
    },
    {
        "q": "盐酸二甲双胍缓释片怎么样吃",
        "a": "二甲双胍是一种非常有效的降糖药物，它常见的副作用有胃肠道的反应 ，可以引起胃区不适或者是肠道功能的紊乱，一般是建议在吃饭的时候吃，可以减轻这些不适感。根据患者的血糖情况来确定服用的剂量，定期监测血糖的情况，平时饮食要多注意，制定一个合理的锻炼计划。"
    },
    {
        "q": "血糖高可以吃青萝卜吗",
        "a": "血糖高是可以吃青萝卜的，血糖高主要是不要吃糖分含量高的食物，要控制主食的摄入量，主食可以以米类食物和粗粮为主，每顿饭应该进食八分饱，要保持心情舒畅，避免过度的激动，生气和熬夜，可以多参加一些有氧的户外运动，定期复查血糖、糖耐量等，不要吃辣的。"
    },
    {
        "q": "高血糖喝小米粥行吗",
        "a": "患有高血糖的人群，也是可以适量地喝些小米粥的，不过不宜过量地喝，因为小米里面含有淀粉成分，如果吃太多的话，容易造成血糖增高的，所以饮食的同时，还是得合理一些有保障，并且一些血糖高的人群，也不可以吃一些含糖成分过高的食物，容易造成血糖明显增高，对身体存在伤害。"
    },
    {
        "q": "糖尿病人能不能吃红薯",
        "a": "糖尿病人最好不要吃红薯，或者少量的吃红薯。因为红薯的糖分比较高，并且淀粉含量也比较高，对于糖尿病患者不宜一次性大量的进食，大量进食红薯除了引起血糖升高外，还容易引起胃肠胀气，胃肠消化功能差的人群吃多后会引起腹胀不适或烧心。血糖控制的好的人群可以在两餐之间少量食用。"
    },
    {
        "q": "血糖高是糖尿病吗",
        "a": "血糖高不一定是糖尿病，可能是应激因素引起的血糖升高，也有可能是空腹血糖或者是餐后血糖受损，但是没有达到诊断糖尿病的标准。糖尿病的诊断主要是基于空腹血糖，任意时间的血糖和糖耐量试验中两小时的血糖值，需要做两次进行确诊，诊断才能够成立。偶尔的一次出现血糖增高不是糖尿病。"
    },
    {
        "q": "糖尿病能根治吗？",
        "a": "糖尿病在目前是没有根治的方法，只能通过运动治疗，饮食调整，药物治疗控制血糖在正常范围内，降血糖药物主要有双胍类，磺脲类，格列奈类等具体的使用需要根据糖尿病具体情况而定，口服降糖药效果不明显要采用注射胰岛素治疗，胰岛素注射剂量根据患者血糖值及药物敏感性确定。"
    },
    {
        "q": "糖尿病人吃什么零食比较好？",
        "a": "糖尿病人要严格控制饮食的，应尽量避免含糖食物、减少进食高脂肪高热量的食物。零食建议是以水果为主如猕猴桃、火龙果、西柚、苹果、西红柿、黄瓜等。也可以备些无糖食物如苏打饼干、燕麦饼干、全麦面包等；坚果类的开心果、腰果、大杏仁等是可以选择的。也可以备些脱脂牛奶。"
    },
    {
        "q": "糖尿病人排尿困难小便失禁怎么办",
        "a": "糖尿病患者出现尿失禁，这是自主神经病变受到了损害，引起了泌尿生殖系统的功能障碍，针对这种情况，首先是要控制血糖，有肥胖的患者也要进行减肥，要经常锻炼盆底肌肉，另外也可以配合药物治疗，可以吃一些营养神经的药物，经过行为治疗和药物治疗无效者可以采取手术治疗。"
    },
    {
        "q": "空腹血糖6.8正常吗",
        "a": "空腹血糖6.8是不正常的考虑还是空腹血糖升高，对于这种现象有可能会引起糖尿病，建议还是控制饮食，适当的活动锻炼，不要吃含糖量比较高的食物，出现了空腹血糖增高，有可能出现空腹血糖受损，必须要注意饮食的控制，适当的增加活动锻炼。目前并不需要口服药物，但是需要定期复查。"
    },
    {
        "q": "糖尿病血糖值范围",
        "a": "糖尿病血糖值范围是患者空腹在8小时到10小时之内血糖检测≥7.0mmol/L，餐后2小时进行血糖≥11.1mmol/L。或者是随机检查在10.1mmol/L可以确定是糖尿病，目前没有方法可以彻底根治，患者需要长期服用药物控制血糖稳定。患者通过饮食，运动，药物等方法将血糖控制在正常范围内。"
    },
    {
        "q": "血糖高可以喝奶粉吗",
        "a": "血糖偏高的人群最好不要喝奶粉。不管是低糖奶粉还是无乳糖不含糖的奶粉。由于其主要成分中虽然写了没有糖分，但由于各种厂家的标准不一样，其是否含糖仍不能够保证。建议血糖偏高的人群最好不要选择奶粉，可以选择喝一些纯牛奶补充蛋白摄入量。也可以选择鸡蛋，每天两个左右，补充人体所需蛋白。"
    },
    {
        "q": "糖尿病瘦了是怎么回事？",
        "a": "糖尿病患者出现体重严重下降，通常表示患者胰岛功能完全衰竭或者功能极度下降，甚至可导致成人一型糖尿病的发生。临床上，体重偏瘦的糖尿病患者，相对肥胖的糖尿病患者血糖更不易管理。由于偏瘦的糖尿病患者，其胰岛功能受损较严重。通常需要选择胰岛素管理血糖。同时偏瘦的糖尿病患者其糖尿病病程较长，并发症较多，治疗相对更加复杂和困难。"
    },
    {
        "q": "妊娠期糖尿病的治疗方法有什么",
        "a": "妊娠期合并有糖尿病综合症，对于孕产妇和孩子都有非常大的影响，首先在整个孕期需要自我检测血糖，要控制体重，合理的进行饮食，也要进行适量的运动，使用降血糖的血糖药物，如果血糖控制的不是太满意，随着病情的进展，需要采取胰岛素进行治疗，大部分的患者在生完孩子之后，血糖会恢复正常。"
    },
    {
        "q": "女性糖尿病的早期症状您好",
        "a": "糖尿病在早期一般情况下没有任何的症状，只是空腹血糖或者是餐后血糖偏高，很少出现了糖尿病的典型症状，有的患者发病比较隐匿，发现了慢性的合并症，医院检查时才知道自己有糖尿病。糖尿病的诊断是非常简单的，只需要去医院做一下血浆空腹血糖或者是餐后两小时血糖，就可以知道血糖是否超过了正常范围。"
    },
    {
        "q": "糖尿病五驾马车是什么？",
        "a": "糖尿病的5驾马车是最重要的基础治疗的措施，主要包括的内容有糖尿病健康教育，要全面的了解一下患者的情况，饮食治疗，要控制体重，控制中热量的摄入，要进行有规律的运动能够提高胰岛素的敏感性，要对自己的血糖做自我监测，及时发现血糖的变化，最后一项是药物治疗，根据患者的情况，选择比较合适的药物。"
    },
    {
        "q": "糖尿病人吃什么才可以不吃？",
        "a": "糖尿病是饮食不当的原因造成，因此治疗糖尿病需要控制血糖的来源，主要控制主食的摄入量，特别是控制热量的来源，避免吃含有糖分以及含有淀粉丰富的食物，不能吃含有油脂丰富的食物以及油炸制品，需要吃粗杂粮以及含有糖分比较低的蔬菜类食物，需要补充充足的蛋白质。"
    },
    {
        "q": "请问糖尿病人补血吃紫菜头？",
        "a": "糖尿病人是可以吃紫菜头的。紫菜头当中含有很多的微量元素，属于强碱性的食物。经常的食用一些紫菜头还带等海产品能够调节身体的酸碱性。糖尿病的人饮食调理是非常重要的。一般都要尽可能吃一些脂肪含量比较低，糖分和盐分比较少的食物，可以多吃一些碳水化合物以及纤维素比较高的食物。"
    },
    {
        "q": "糖尿病不能吃的食物有什么",
        "a": "糖尿病病人不宜吃的食物，主要是含糖量多的食物。比如糖蛋糕，蜂蜜这些含糖量多的食物是不能吃的，另外淀粉在体内代谢以后主要转化成葡萄糖，所以含淀粉多的食物也要少吃。由于肉类的主要成分是蛋白质脂肪，可以适当吃，但是脂肪也不要多吃。饮食要以低盐低糖低脂饮食为主，多吃水果蔬菜。"
    },
    {
        "q": "女性糖尿病能要小孩吗？",
        "a": "女性糖尿病患者是可以要孩子的，但要将降糖控制好的情况下，身体各项检查确定没有问题在要孩子。血糖不稳定状态怀孕会影响到胎儿发育，导致畸形流产等问题，怀孕期间患者需要在医生指导下采用胰岛素控制血糖，饮食方面也需要做好调整，适当运动，定期产检，避免胎儿过大。"
    },
    {
        "q": "糖尿病患者用胰岛素之后还可以吃口服药物吗",
        "a": "严格意义上来说，胰岛素并不是药，而是人体内的一种必须的降血糖的物质，糖尿病患者在使用之后不会成瘾，需要不需要进行胰岛素治疗，或者使胰岛素治疗一段时间之后能不能够撤药换回口服的药物，这主要是看患者个人的病情，如果血糖控制的比较满意，基础治疗方面也是配合的比较好，当然可以换回口服的药。"
    },
    {
        "q": "糖尿病病人长期吃二甲双胍好吗？",
        "a": "糖尿病（II型）长期服用二甲双胍好与不好要根据医生检查诊断来确定，患者不要擅自更换，糖尿病慢性疾病，需要长期服用药物控制血糖，具体的用药是根据患者身体状况和血糖值的高低来确定。在药物治疗不明显情况下可以配合胰岛素使用，患者需要定期进行血糖检测和身体检查。"
    },
    {
        "q": "糖尿病，高血压病人，可以喝些什么茶好",
        "a": "糖尿病高血压患者可以喝一些黑茶。黑茶当中含有氨基酸，咖啡碱，磷脂，能够加速人体当中脂肪代谢，而且黑茶当中含有茶多糖复合物，能够降血糖。糖尿病高血压患者还可以喝乌龙茶，绿茶，茉莉花茶，山楂茶等。糖尿病高血压患者需注意控制饮食，可食用紫菜，苦瓜。"
    },
    {
        "q": "糖尿病打胰岛素的危害",
        "a": "二型糖尿病，如果注射胰岛素过量，会出现血糖过低引起脑部供应能量不足，引起脑死亡的现象，严重者也会危及生命。二型糖尿病的病人需要控制饮食，并且以运动为基础方法调理血糖治疗，如果胰岛素缺乏的比较严重，需要住院调理适当的剂量应用，并且定期复查血糖以及糖化血红蛋白情况。如有应用药物异常的现象，需要及时的检查血糖，防止出现低血糖等。"
    },
    {
        "q": "咨询糖尿病的早期症状有哪些？",
        "a": "部分糖尿病的患者在早期的时候表现症状并不明显，主要是通过体检的方式来了解自己已经患有了糖尿病。部分糖尿病患者在早期会出现多食、多尿以及多饮，甚至还会伴随身体消瘦的现象。患有糖尿病的患者要注意平时控制含糖量食物的摄入量，严重患者需要进行胰岛素的注射。"
    },
    {
        "q": "糖尿病患者为什么不能吃蜂蜜",
        "a": "糖尿病患者是不能服用含糖量高的食物的蜂蜜作为含有较高的果糖葡萄糖。糖尿病患者服用后会引起血糖过度升高，从而导致各种并发症的出现，所以糖尿病患者不能服用蜂蜜，而且还需要长期服用降糖药物或者皮下注射胰岛素治疗，日常生活中也是尽量不能进食含糖类的食物。"
    },
    {
        "q": "糖尿病引起的肌酐高怎么办？",
        "a": "你好，糖尿病引起的肌酐高，要考虑糖尿病肾病导致的肾衰竭，出现肾衰竭如果没有达到尿毒症期，我们是需要及时去医院治疗的。"
    },
    {
        "q": "高血糖有啥症状",
        "a": "高血糖的具体症状要看血糖的水平。如果血糖是一个轻度的升高，患者没有任何的症状。如果血糖长期升高，患者可以表现为明显的多尿多食多饮，而且会出现明显的消瘦，这是糖尿病患者的典型症状。如果出现并发症，有些人可以出现事物模糊，可以出现肾功能的下降，可以出现皮肤瘙痒。"
    },
    {
        "q": "糖尿病人吸烟有什么危害？",
        "a": "吸烟的危害，糖尿病患者容易患足部疾病。烟叶不完全燃烧会产生有毒有害物质，主要是尼古丁、一氧化碳、焦油等。这些物质对人类健康有很大影响。烟草中还有一种天然成分，去甲尼古丁，能引起血管收缩、痉挛、血供减少、组织缺血和缺氧。足部溃疡的愈合需要足够的氧气和营养。"
    },
    {
        "q": "苦瓜怎么吃降血糖",
        "a": "吃苦瓜并没有直接降低血糖的作用，不要盲目的选择，这种治疗方式，可以作为饮食的一种方式，但是并不能作为主要的治疗方式，出现了高血糖，糖尿病必须要选择口服降糖药，同时需要控制主食量，吃苦瓜并不一定会降低血糖，但是也没有其他的副作用，糖尿病高血糖患者可以正常吃。"
    },
    {
        "q": "探望糖尿病人买什么好",
        "a": "看望糖尿病患者，尽量多送一些无糖的饮食，或者是富含优质蛋白质的饮食。有糖尿病的患者尽量要限制糖的摄入，所以对于含糖量较高的水果，八宝粥等各种补品，尽量不要送，因为糖尿病患者本人不能吃这些食物。可以送一些含糖量相对较低的水果，患者可以适当的食用，对血糖的影响比较小。"
    },
    {
        "q": "请问黄芪可以治疗糖尿病吗？",
        "a": "黄芪有助于治疗糖尿病，但不足以控制血糖。目前还没有治愈糖尿病的方法，但可以通过多种治疗方法加以控制。到医院进行正规治疗，正常生活要注意适量活动，减少糖的摄入。目前糖尿病的治疗以口服降糖药和注射胰岛素为主，现在还没有其他治疗措施可以替代药物。必要时增加或减少药物剂量。"
    },
    {
        "q": "糖尿病患者应该多喝饮料吗？",
        "a": "糖尿病的患者是不建议喝饮料的，因为所有的饮料里面都含有一定的糖分，糖尿病的患者是由于本身胰岛功能不能够分泌更多的糖分所引起的症状，所以说糖尿病患者如果经常喝饮料，会引起血糖升高，就会引起一些并发症的现象，糖尿病的患者可能会出现口渴的情况，可以多喝一些白开水或者是茶水是可以的。"
    },
    {
        "q": "妊娠期糖尿病多久查一次血糖",
        "a": "妊娠糖尿病血糖检查2周左右一次，孕后期一周检查一次，根据孕妇具体血糖指数调整胰岛素剂量，同时妊娠期糖尿病患者需要做好饮食控制，多吃粗粮，补充蛋白质，控制总热量，以少食多餐为原则，控制血糖在正常范围之内，糖尿病会导致胎儿神经系统和心脑血管方面畸形甚至是死亡。"
    },
    {
        "q": "糖尿病男人性生活？",
        "a": "糖尿病男人当然可以过性生活。糖尿病又不是传染病，但是糖尿病男人的性生活不宜过频，如果过频的话会导致血糖升高并出现阳痿或早泄等一系列的问题。糖尿病是由于机体的内分泌状态发生改变而发生的，而性生活会导致内分泌发生改变。所以糖尿病人的性生活最好控制在一周之内一到两次。"
    },
    {
        "q": "酸葡萄糖注射液的注意事项是什么？",
        "a": "应用葡萄糖注射液时，首先要注意查看一下患者的血糖，如果患者是糖尿病，就不能够应用葡萄糖注射液的，如果患者需要补充盐分或者是电解质，只是单纯的补充葡萄糖也是没有作用的，所以如果要应用葡萄糖注射液，一定要检查清楚之后再应用。最好是在医生指导下应用。"
    },
    {
        "q": "血糖高吃红薯会怎样",
        "a": "血糖过高，吃红薯有可能会更加加重血糖高的症状，另外还有可能会引起胃肠道胀气，造成消化不良，从健康角度血糖高的患者是不建议服用含糖量较高的食物的，首先应该通过饮食调整、药物治疗，以及运动疗法，把血糖稳定在正常的参考范围之内，预防出现其他的并发症。"
    },
    {
        "q": "怎样预防糖尿病",
        "a": "每天坚持做一定的活动，能够有效的预防糖尿病。每天可以坚持走路30分钟，并。不受场地的限制，能够及时调解步伐，对人体的关节损伤是比较小的。预防糖尿病还应该注意控制饮食，调整饮食结构，不宜食用过多糖分，脂肪，还应注意戒除烟酒，改变不良习惯，控制睡眠时间。"
    },
    {
        "q": "糖尿病人能吃榴莲吗",
        "a": "糖尿病人是不建议吃榴莲，榴莲是一种高热量的水果，其中糖分含量特别高，所以有糖尿病的情况，吃榴莲就会导致血糖增高，一般糖尿病人尽量避免吃榴莲。对于糖尿病人来说，首先需要饮食控制，同时根据血糖情况，需要应用药物来控制血糖，如果血糖控制比较好，可以适量的吃水果。"
    },
    {
        "q": "高血糖吃什么可以降血糖",
        "a": "高血糖需要注意检查是不是饮食方面的原因，确诊糖尿病以后需要根据病情来选择胰岛素或者是口服降糖药，只要不是一型糖尿病，可以选择降糖药来治疗，没有发生并发症，没有严重的高血糖，可以选择口服降糖药，建议使用二甲双胍配合口服阿卡波糖进行治疗，控制饮食是最主要的。"
    },
    {
        "q": "糖尿病为什么会导致贫血？",
        "a": "糖尿病出现贫血的原因首先是糖尿病患者是低脂低糖，减少肉类的饮食，缺乏铁的吸收导致的营养不良出现贫血。患者服用的二甲双胍，甲苯磺丁脲，格列苯脲等常用降糖药也可以引发贫血，服用这类药物需要定期进行血常规检查，糖尿病并发症肾病也是可以导致贫血的出现。"
    },
    {
        "q": "盐酸二甲双胍肠溶片。是降空腹还是餐后?",
        "a": "盐酸二甲双胍片属于临床上常用的降糖药物，一般建议在饭前20分钟左右服用。饭后服用很有可能会直接影响药物的降糖效果。由于上述药物具有一定的胃肠道刺激性反应，必要时患者可以换成二甲双胍肠溶片比较好。要按照医生医嘱按时用药，注意观察血糖的变化，平时注意低糖饮食，多运动。"
    },
    {
        "q": "复查孕妇空腹血糖5.6高吗",
        "a": "正常人血糖值要求空腹状态下在3.9~6.1，对孕妇来说是一个特殊的群体，孕妇血糖要求是不超过5.1，所以现在空腹血糖是5.6，相对来说是偏高的，一般需要进一步的做妊娠糖耐量试验，可以有助于判断有没有合并糖尿病的现象。平时也要注意低糖饮食，可以定期复查血糖。"
    },
    {
        "q": "糖尿病的初期症状有哪些",
        "a": "糖尿病早期症状临床症状不是非常明显，多数没有典型症状三多一少，但患者会出现不明显原因的视力模糊，近视度数加深，患者易感觉疲劳，全身无力，皮肤出现瘙痒，泌尿系统方面易感染等。随着血糖度数的进一步升高，典型的临床症状逐步出现，患者易察觉，通过血糖监测确定。"
    },
    {
        "q": "糖尿病患者对胰岛素抵抗,该怎么办?",
        "a": "糖尿病患者属于胰岛素抵抗，能够打胰岛素，但是打胰岛素效果不好，治疗胰岛素抵抗，应用胰岛素增敏剂或者采取有氧运动的方式提高胰岛素的敏感性，而达到降低血糖的效果。糖尿病的病人需要控制血糖的来源控制饮食，并且适当的应用双胍类的药物或者减少血糖吸收的药物治疗。"
    },
    {
        "q": "糖尿病患者为什么要进行餐后2小时血糖测定？",
        "a": "糖尿病的诊断需要用到的两个血糖，一个就是空腹血糖，另一个就是糖耐量试验之后的餐后两小时血糖，餐后两小时血糖能够更好地反映进食和使用降糖药物是否合适，在这个时间段不会饮食，也不会做胰岛素的打针治疗，对血糖的影响不是太大，也就是说血糖不会出现特别的太大的波动。"
    },
    {
        "q": "孕妇饭后两小时测血糖值是多少才正常",
        "a": "怀孕期间女性是可以进行糖耐量测试的，在进行糖耐量测试的时候一般需要检测空腹血糖、餐后一小时血糖和餐后两小时血糖，空腹血糖的正常范围应该是在3.9~5.1之间，餐后一小时血糖的正常范围应该是在10.0以内，餐后两小时血糖的正常范围应该是小于7.8就是正常的现象。"
    },
    {
        "q": "妊娠期糖尿病的诊断标准到底是多少？",
        "a": "妊娠期糖尿病的诊断标准是孕妇空腹检查血糖高于5.1mmol/L，口服葡萄糖耐量实验两小时血糖高于8.5mmol/L就可以确诊为妊娠期糖尿病。通过患者检查可以确定血糖指数正常，妊娠期糖尿病的预防主要是合理饮食避免高脂肪高糖分食物，严格控制体重，适当的运动。"
    },
    {
        "q": "血糖偏高要注意哪些问题？",
        "a": "血糖偏高的患者需要在生活中注意，尽量避免吃一些含有糖分比较多的食品和饮品，尤其是不能吃糖块，蛋糕，喝糖水，避免吃一些油炸油腻辛辣刺激性的食物，尽量多吃一些新鲜的蔬菜；对于确诊为糖尿病的患者，还要控制主食的 入量，经常进行体育锻炼，利于血糖的平稳。"
    },
    {
        "q": "要考体育了可以多喝葡萄糖水吗",
        "a": "要靠体育了，可以喝葡萄糖水，葡萄糖水只是一种普通的营养物质，并不是兴奋剂，所以并不在兴奋剂的检查范围之内，喝糖水可以补充体内的能量补充葡萄糖，葡萄糖是人体代谢必须的三大元素之一，如果出现血糖低就会导致肢体乏力，严重的会引起休克，所以补充葡萄糖可以增强体力。"
    },
    {
        "q": "糖尿病并发症的防治？",
        "a": "可能是糖尿病引起的并发症，会出现末梢微循环回流的障碍，如果糖尿病病人末梢神经调节异常。要进行检查皮肤有没有溃疡或者要配合服用营养神经类的药品，比如维生素类的药品，维生素b1或者是叶酸片。测量生命体征测量空腹血糖，餐后血糖以及血压，要服用降血压，改善心肌循环的药品。"
    },
    {
        "q": "怀孕前糖尿病,生完孩子会好吗",
        "a": "一般情况下，孕妇妊娠期糖尿病是在分娩后大部分病人是可以恢复正常水平的，但是也是有部分病人的代谢功能障碍后，在分娩后也无法恢复正常状态。如果分娩后进行继续监测，血糖仍无法恢复正常这种情况就需要进一步检查是属于哪一类型的糖尿病，然后根据检查结果判断后服用降糖药物或者使用胰岛素治疗。"
    },
    {
        "q": "请问糖尿病患者能吃柚子吗",
        "a": "糖尿病的患者在患病期间是可以吃柚子的。柚子中的糖分含量比较低，一般不会引起糖尿病患者血糖水平的波动。糖尿病的患者平时最好选择一些低糖低脂的水果，这样可以帮助维持患者正常的血糖水平，避免患者出现血糖水平的波动。患病期间一定要注意多吃一些新鲜的水果蔬菜，这样可以帮助维持正常的血糖水平。"
    },
    {
        "q": "得了糖尿病能吃苹果吗",
        "a": "糖尿糖人可以适量吃苹果，但应选择含糖量低的水果，因为水果中含有葡萄糖、果糖、蔗糖、淀粉、果胶等，其中果糖代谢不需要胰岛素参与。果胶中含有可溶性纤维，能延缓葡萄糖的吸收。水果中还含有维生素、矿物质和水，有利于糖尿病的健康，但也含有葡萄糖，葡萄糖是糖尿病的一个不利因素。"
    },
    {
        "q": "糖尿病并发症有哪些症状",
        "a": "出现糖尿病并发症的病情不同，症状也不完全一样；如果出现有糖尿病，眼底改变时，可以出现有眼底出血视物模糊等表现；在病情引起末梢神经炎的病发症发作时，患者可以出现有四肢末梢部位的麻木，有的患者可以出现有手套，袜套样的表现；在引起心脑血管疾病的并发症出现时，可以出现有胸闷，气短，头晕，肢体功能障碍等表现。"
    },
    {
        "q": "餐后血糖高是怎么回事",
        "a": "血糖偏高有可能和平时的饮食习惯有关系，检查餐后血糖高，如果餐后两小时血糖超过11.1，应该是得了糖尿病。可以去医院的内分泌科就诊，在医生的指导下用药治疗，如果只是有一些偏高，可以通过控制饮食、运动的方法来控制血糖，一定要保持低糖饮食，多参加户外运动。"
    },
    {
        "q": "糖尿病人可以吃玉米吗",
        "a": "患有糖尿病的病人是可以吃玉米的，玉米是处于粗粮，适量的吃玉米，不会对血糖有影响，但是尽量不要吃太多。糖尿病的病人主要是要控制主食的摄入量，主食可以多吃一些米类的食物和粗粮，应该多吃一些含糖量低的水果以及蔬菜，不要暴饮暴食，平时应该多参加户外运动。"
    },
    {
        "q": "孕妇高血糖吃什么好",
        "a": "1、紫菜：紫菜中含有多种维生素，以及锌元素，低脂肪含量对高血糖人群来说极其有利。空腹时食用紫菜、或是制作成紫菜汤，都可以起到降血糖的作用。2、黑木耳：黑木耳中含有多糖成分，可以起到降血糖作用。并且其中含有较多的蛋白质、胡萝卜素、以及矿物质，可以有效满足孕妇每日所需要的营养。"
    },
    {
        "q": "患有糖尿病能否怀孕",
        "a": "患有糖尿病能怀孕。然而，糖尿病孕妇的胎儿畸形、早产多于非糖尿病孕妇。因此，为了预防上述妊娠并发症，糖尿病妇女应在妊娠前严格控制糖尿病，将血糖降至正常水平。如果已经确认妊娠，则有必要与妇产科医生和内科医生密切配合，调整饮食和胰岛素剂量，将血糖降至正常水平。"
    },
    {
        "q": "糖尿病早餐吃什么最好",
        "a": "患有糖尿病的人并不是什么东西都不能吃，主要是控制糖分的食物，无糖饮食为主，像喝牛奶和豆奶里面不要放糖，馒头片孢子，蛋糕之类淀粉的食物，每餐不要超过二两，如果肚子没有吃饱的话，可以用蔬菜来填补，这样的话就不会对血糖造成很大的影响，饭后尽可能散步一段时间。"
    },
    {
        "q": "糖尿病患者选择水果要注意什么？",
        "a": "水果当中含有大量的矿物质，果酸以及维生素，但是糖尿病患者在选择水果的时候，一定注意不要吃糖量过高的水果，应该注意食用含糖量比较低的水果，如猕猴桃，梨，橘子，苹果，西瓜等，而应该注意减少食用红果，柿子，香蕉，糖尿病患者在平时的时候还应该注意控制总热量。"
    },
    {
        "q": "血糖高吃什么好的快",
        "a": "血糖高只有体内分泌胰岛素才能够降低血糖，其它的所有食物或者激素都是升高血糖；血糖高不仅仅要依靠药物来治疗，还需要严格控制饮食，以及适当运动；降血糖不是光靠吃某些食物来降低血糖的，而是需要控制饮食的摄入，减少血糖的摄入，并且适当运动来增加血糖利用，才是控制血糖的前提。"
    },
    {
        "q": "糖尿病人能吃马铃薯吗",
        "a": "您好，糖尿病人是可以吃马铃薯的，但是马铃薯不能作为菜，它只能作为主食，和馒头，米饭是一样的。把马铃薯作为主食吃，这时馒头或者米饭就要少吃或者不吃了。这样对血糖的影响就不大，如果把它作为菜吃，那么就可能使血糖升高了，糖尿病人平时的运动是很重要的，如果你觉得今天饮食没控制太好，那就多运动些。"
    },
    {
        "q": "糖尿病的原因？",
        "a": "糖尿病形成的原因有很多，一般最常见的是两种原因，一种是因为体内的胰岛素分泌不足导致的，因为胰岛素是人体内唯一的降低血糖的激素，如果胰岛素分泌不足就会导致血糖升高。另一种原因就是胰岛素抵抗是因为机体利用葡萄糖的器官产生了胰岛素抗体，胰岛素在体内不能发挥降血糖的作用，所以导致血糖升高。"
    },
    {
        "q": "糖尿病人吃什么能胖点",
        "a": "糖尿病患者可以口服一些降糖的药物进行治疗或者注射胰岛素治疗，每天测量血糖，把血糖控的正常值，防止血糖过高或者过低，如果出现低血糖反应，可以口服一些糖水进行缓解，日常生活中少吃甜的食物和水果，适当锻炼身体，促进血液循环，提高机体免疫能力，避免体重过胖。"
    },
    {
        "q": "双眼复视怎么治疗好了",
        "a": "出现双眼复视主要有两个方面的原因：第1个方面可能是因为患者出现了散光导致，这种情况下可以配戴眼镜来进行矫正，也可以通过激光手术的办法进行矫正。第2个方面是因为患者出现了高血压、糖尿病等疾病引起的双眼复视，这种情况下需要首先针对原发疾病进行治疗，另外也可以吃一些营养神经的药物。"
    },
    {
        "q": "糖尿病人能吃什么水果好呢？",
        "a": "糖尿病病史非常长，现在出现眼底病变的现象，血糖控制不是很理想，这种情况不建议吃水果，如果吃水果一天只能吃一种水果，只能吃1～2两，不可以超量，需要分次食用，食用后所含的糖分需要将主食中能管的减去，这样防止出现血糖来源增多的现象，有利于控制血糖。"
    },
    {
        "q": "糖尿病2型要不要打胰岛素",
        "a": "糖尿病2型是否要打胰岛素是根据患者血糖值的高度以及对口服降压药的耐药性来决定，不同的胰岛素使用的剂量使用方法是不一样的，患者不要擅自调整，根据医师的指导进行使用胰岛素，同时日常生活中饮食方面要少食多餐，避免高脂肪高胆固醇的食物，适当的进行身体锻炼。"
    },
    {
        "q": "我有糖尿病可以要孩子吗",
        "a": "糖尿病患者是可以要小孩的。但是要小孩前应该控制好血糖。更改治疗糖尿病的方案。因为怀孕后服用药物是有很多的禁忌症。患有糖尿病的患者平时饮食需要比较注意的，应该避免吃含糖的食物。需要低脂低钠的饮食。定时的检测血糖。需要按照医生的医嘱选择服用降糖药物进行治疗。"
    },
    {
        "q": "我总是午饭后血糖高怎么办",
        "a": "午饭后出现血糖高，有可能是餐后血糖偏高，需要注意空腹血糖有没有超过正常值，针对这种现象有可能是吃东西的原因，在饮食当中吃了含糖量比较高的食物或者是暴饮暴食，主食量增加都可能会导致血糖的增高，对于这种现象建议还是及时的控制饮食，同时也需要增加活动量，必要时需要口服降糖药。"
    },
    {
        "q": "糖尿病的诊断标准有哪些",
        "a": "糖尿病的诊断标准目前还是按照随机血糖超过11.1摩尔每升或者检查糖耐量试验阳性以及糖化血红蛋白数值超过6.5%而明确诊断。如果通过上述检查明确是属于糖尿病，则是需要长期服用口服降糖药物治疗或者皮下注射胰岛素治疗的，使用药物治疗期间还要定期监测血糖水平。"
    },
    {
        "q": "糖尿病人可以怀孕吗",
        "a": "糖尿病病人是可以怀孕的，但是糖尿病病人在怀孕之前一定要及早调整个人的血糖水平，把血糖控制在一个很好的范围之内，另过详细检查看看患者本身目前有没有出现糖尿病的并发症，如果出现了糖尿病的并发症，建议还是慎重怀孕，另外糖尿病如果打算怀孕，一定要考虑胰岛素治疗，避免药物的使用。"
    },
    {
        "q": "血糖12.5该怎么做",
        "a": "出现的血糖12.5，注意是否空腹血糖，空腹血糖达到12.5，建议口服降糖药物，同时需要注意检查具体的病情。有可能是出现了糖尿病，可以通过口服降糖药物来治疗，建议口服阿卡波糖或者是二甲双胍进行治疗，平时注意控制饮食，不能吃含糖量比较高的食物，避免暴饮暴食。"
    },
    {
        "q": "血糖高是怎样引起的？可以检查出来吗",
        "a": "出现了血糖的增高可能和饮食、遗传、环境有直接的关系的，特别是肥胖的人群、自身免疫有关系的，可以考虑及时的到医院进行血糖的检测，空腹血糖以及餐后2小时血糖等等，糖尿病往往比较容易诱发出现心脑血管的疾病，是需要及时的口服药物控制，同时注意合理控制饮食。"
    },
    {
        "q": "血糖高，是糖尿病了吗？",
        "a": "目前应用血糖仪测量血糖比较高，那这种情况建议观察有没有明显的多饮多尿多食，有没有存在体重下降，单纯血糖仪测量血糖比较高，不能说明有存在糖尿病的，但是这种情况考虑糖尿病风险是比较高的，需要进一步检查，建议可以完善糖化血红蛋白检查，看一看有没有存在明显升高的。"
    },
    {
        "q": "糖尿病打胰岛素针摄入量",
        "a": "糖尿病打胰岛素使用剂量是根据患者糖尿病类型，血糖情况，胰岛功能，对胰岛素的敏感性决定的，患者需要到医院检查清楚根据医生的指导确定使用哪一种胰岛素以及剂量。胰岛素的使用剂量要把握准确，不然会导致血糖控制不稳定，过量会导致频繁低血糖容易出现意外。"
    },
    {
        "q": "糖尿病人能吃豆角吗",
        "a": "糖尿病人是可以吃豆角的。豆角本身含有的淀粉和糖并不是很多的，所以糖尿病人可以正常的吃豆角。另外糖尿病人一定要注意自己血糖的波动情况，一定要注意血糖的变化，每天一定要定期的使用血糖仪测量血糖值，口服降糖的药物或者使用胰岛素促进血糖下降。一定要配合适当的锻炼身体。"
    },
    {
        "q": "糖尿病人可以喝洋葱泡红葡萄酒吗",
        "a": "糖尿病的患者如果血糖控制的比较满意，可以适量喝点儿红葡萄酒，男性每日酒精的摄入量不能高于25克，女性每日的酒精量不能高于15克，一般情况下选择在餐后喝，空腹饮酒容易出现低血糖。另外糖尿病的血糖比较高，而且伴随有很多的并发症和合并症，这种情况下最好要戒酒。"
    },
    {
        "q": "糖尿病患者饮食和生活上需要注意哪些？",
        "a": "糖尿病的饮食是非常重要的，需要根据准热量来分配葡萄糖脂肪以及蛋白质的摄入量，少吃含有蔗糖葡萄糖蜜糖的食品，蛋白质的含量不超过总热量的15%，葡萄糖不超过50~60%，脂肪不能超过20~30%。每日的饮食中，纤维素的含量不能小于40克，可以多吃一些绿色的蔬菜，豆类，含有糖分比较低的水果。在生活方面要进行有规律的运动，注意血糖的自我监测。"
    },
    {
        "q": "妊娠期糖尿病需要控制饮食吗？",
        "a": "糖尿病的主要的治疗的方法是基础治疗方法和药物治疗，其中饮食治疗是非常重要的，应该长期严格执行。妊娠期糖尿病患者也是需要控制饮食的，每天摄入的营养成分，既能够保证孕产妇和孩子的需要，又至于引起糖过高，有肥胖的患者要控制体重，整个孕期体重增长是12.5公斤左右，不能吃含糖比较高的食物。"
    },
    {
        "q": "血糖偏高在生活中应注意些什么？会引起糖尿",
        "a": "单纯的血糖偏高，不一定是糖尿病。实际上，糖尿病的血糖，可以空腹血糖升高，随机血糖也升高，餐后2小时血糖也升高。预防血糖升高，重点避免每次进食饭量过大，避免进食淀粉或糖分高的食物。同时建议去医院就诊内分泌科，差空腹血糖，餐后2小时血糖，随机血糖，糖化血红蛋白等，明确是否是糖尿病。"
    },
    {
        "q": "糖尿病患者为什么会出现糖尿和尿量增多？",
        "a": "糖尿病出现糖尿是因为血液中的糖分过高，肾脏不能够完全代谢，部分糖分随尿液被排出身体外，而尿路多也是因为尿中的糖分高，使尿的渗透压增高，向肾小管扩张导致尿量增多。糖尿病出现尿糖，尿量增多都是临床上常见症状，只有血糖控制在正常范围之内症状自然会慢慢消失。"
    },
    {
        "q": "怀孕空腹血糖高怎么办？",
        "a": "怀孕期间血糖偏高属于妊娠期糖尿病，患有妊娠期糖尿病的孕妇是需要积极的控制血糖的，孕妇长期血糖偏高，容易对胎儿的生长发育造成不良影响。如果孕妇的空腹血糖以及餐后两小时血糖长期偏高，首先可以通过控制饮食和加强体育锻炼来控制血糖，如果血糖控制不佳，最好使用胰岛素来将血糖控制在正常范围内。"
    },
    {
        "q": "糖尿病做爱会传染给女性吗",
        "a": "糖尿病的病人做爱的时候是不会传染给女性的，糖尿病并不是一种传染性疾病。糖尿病是临床上常见的内分泌方面的疾病，患者在患病期间可能会出现多饮、多食、多尿、体重减少等一系列临床症状。这个时候一定要在专业医生的指导下接受系统的治疗，从而帮助维持正常的血糖水平。"
    },
    {
        "q": "糖尿病要忌口什么食物",
        "a": "糖尿病患者生活中忌口的食物有很多，一是高糖的饮食，比如红糖、白糖、含糖量较高的水果；二是高脂肪的食物，比如油炸的食物、动物的脂肪、动物的内脏、蛋黄、鱼子等；三是避免进食高盐的食物。这些食物会升高患者的血糖、血脂、血压，增加患者的血粘度，促进动脉硬化的进展。"
    },
    {
        "q": "二级糖尿病怎么治疗?",
        "a": "二型糖尿病目前的治疗主要是运动，饮食控制以及加药物治疗，如果早期轻度的血糖升高，完全可以通过限制患者的饮食以及适当的运动来控制血糖，但如果上述保守方案无法对血糖达到有效的控制，就可以选择口服药品来对症控制血糖，再严重的就要考虑注射胰岛素了，严密监测血糖水平，随时调整治疗方案。"
    },
    {
        "q": "得了糖尿病能活多久？",
        "a": "糖尿病的病程比较长，长期的糖尿病可能会引起很多的并发症，是致死致残的主要的原因。但是我们国家现在的医疗水平很高，每个人对自己的身体状况也是非常的关心，大部分有糖尿病的患者都会及早的进行治疗，只要经过治疗之后，可以把血糖控制在满意的范围之内，会延缓并发症的发生，寿命还是比较长的。"
    },
    {
        "q": "？糖尿病人能吃什么水果吗？",
        "a": "患有糖尿病的病人，应该根据空腹血糖，糖奶量或者糖化血红蛋白等的检查结果，口服降糖药物或者注射胰岛素治疗。平时一定要注意忌口，可以吃柚子，梨，苹果等含糖量低的水果，控制主食摄入量，多吃一些苦瓜，黄瓜，秋葵，丝瓜等蔬菜。应该多参加有氧的户外运动。"
    },
    {
        "q": "请问糖尿病人可以喝蜂蜜吗？",
        "a": "糖尿病的患者不建议喝蜂蜜，因为蜂蜜里含有一定的糖分，糖尿病患者就是由于身体不能分解过多的糖分而得名。所以说糖尿病的患者和过多的蜂蜜容易引起糖尿病加重。糖尿病的患者饮食上应该少量多餐进行饮食，一次性不能吃太多，不能吃含糖量较高的食物，尽量保持低糖，低盐饮食。"
    },
    {
        "q": "觉得口渴是怎么回事？",
        "a": "总觉得口渴并且已经排除糖尿病的症状，建议检查是否有唾液腺疾病，如导管结石和唾液分泌减少，这些疾病很容易导致口渴症状。如果有干眼和类风湿症状，此时可能出现干燥综合征，建议单独治疗。此外，口渴也可能由鼻咽疾病引起，例如鼻窦炎或慢性鼻炎，它们容易引起张口呼吸，从而引起口渴症状。"
    },
    {
        "q": "糖尿病人能吃西红柿么",
        "a": "糖尿病人是能吃西红柿，因为西红柿的含糖量是比较低的，整体热量低，所以糖尿病人可以适量吃西红柿，这能帮助补充营养。但如果糖尿病人的肠胃是处于虚寒状态或者有肠胃不好的情况，则不应该食用凉的西红柿，应该食用温热的西红柿。平常要加强管理饮食结构，并做好自我监测。"
    },
    {
        "q": "喝白开水血糖会升高吗",
        "a": "喝白开水时不会造成血糖升高的，而且喝水可能会造成血液稀释，血糖监测可能稍低的。如果喝的是糖水或者其他营养含量丰富的食物时，才可能造成血糖的升高。一般检测血糖时，都是要求空腹的，避免喝水或者吃饭，而且一次血糖升高并不能作为糖尿病的诊断依据。糖尿病患者，平时要注意控制饮食，避免高糖分食物的摄入。"
    },
    {
        "q": "糖尿病吃药期间怀孕孩子能要吗",
        "a": "男性糖尿病吃药期间，女性怀孕对胎儿的影响不是非常大，可以继续妊娠，怀孕作用孕期检查，主要观察胎儿的发育情况。但女性糖尿病患者用药期间怀孕，对于胎儿的影响是很大的，容易导致胎儿发育不良，造成畸形流产等，建议女性在控制好血糖的情况下在怀孕，避免对胎儿造成影响。"
    },
    {
        "q": "老人患有糖尿病吃什么药降糖比较好？",
        "a": "糖尿病是一种生活方式疾病，并且影响了胰岛素的功能，减少了胰岛的分泌等原因造成，因此治疗糖尿病需要综合性的治疗才能够获得好的效果，首先要减少血糖的来源，控制饮食治疗。平时要加强运动，通过运动的方式，消耗掉血糖。选择胰岛素或者双胍类的药物以及促进胰岛素分泌的药物治疗。"
    },
    {
        "q": "降血糖最有效的方法是什么",
        "a": "降血糖最有效的方法是要根据个人的情况来决定的，如果是个糖尿病早期胰腺功能本身完好建议还是口服降糖药，根据个人的血糖餐前血糖以及餐后血糖的水平，来分别选取合适的降糖药口服来调整血糖水平，但如果是一个胰腺功能已经完全丧失的，则就需要注射胰岛素来进行糖尿病的一个控制。"
    },
    {
        "q": "治疗糖尿病最好偏方",
        "a": "对于糖尿病的治疗目前没有很好的偏方，糖尿病属于一种内分泌系统的疾病，主要是胰岛素的缺乏，对于糖尿病的治疗目前主要是遵循糖尿病治疗原则，首先需要在饮食方面注意控制，同时根据病情来选择注射胰岛素或者口服降糖药，不要盲目的选择偏方，偏方并不一定可以降低血糖，并不一定可以预防并发症。"
    },
    {
        "q": "糖尿病会导致牙疼吗？",
        "a": "出现牙痛多考虑为牙周炎或者牙周脓肿导致牙龈治以及牙床神经受刺激出现牙痛症状。而糖尿病患者由于其血液中葡萄糖含量较高，导致患者收到细菌或者病毒感染后，炎症持续时间较长不易好转，所以说口腔出现轻微的溃疡或者牙龈出现轻微受损，均可形成慢性进展性炎症导致牙痛症状发生。"
    },
    {
        "q": "糖尿病该注意哪些饮食问题？",
        "a": "糖尿病人应该注意控制食盐的摄入量，低钠饮食。如果高钠饮食就会加剧血容量，造成高血压，使得心脏负担加重，还会引起动脉粥样硬化。糖尿病患者还应该注意不要食用高糖食物，如巧克力，葡萄糖，蜂蜜，蜜饯，果脯等。糖尿病患者还应该注意忌烟酒，可以食用苦瓜，洋葱，莴苣等。"
    },
    {
        "q": "糖尿病外阴瘙痒要用什么药",
        "a": "糖尿病患者出现有外阴骚痒的情况，一方面也考虑可能是血糖没有得到良好的控制，刺激导致出现的情况，另一方面也考虑本身就有一定的外阴炎症或者是有阴道炎等情况的表现，需要进一步进行白带常规的检查来进行明确。监测血糖的情况，调整用药，保证血糖在正常的范围，同时也需要经常进行局部的清洗，配合应用一些抗炎的栓剂。"
    },
    {
        "q": "1型和2型糖尿病的区别",
        "a": "一型糖尿病和二型糖尿病的发病机制不相同，常见的区别有，一型糖尿病发病比较急，好发于青年人，有明显的三高一低的症状，有酮症酸中毒的倾向，身体比较消瘦，需要进行胰岛素控制血糖和维持生命，二型糖尿病发病比较缓慢，多见于成年人，三高一低的症状不是太明显，没有酮症酸中毒的倾向，身体比较肥胖，胰岛细胞没有破坏之前可以使用口服的降糖药物进行治疗。"
    },
    {
        "q": "糖尿病人降血糖吃那种药我都一直打胰岛素的",
        "a": "糖尿病降血糖具有是采用胰岛素还是药物降糖是根据患者具体病情来确定的，血糖出现不稳定需要要医院降血糖血糖调整，找出病因对症治疗。患者本身不要擅自服用降血糖药物或者加大胰岛素剂量。在饮食方面需要控制总热量，避免高糖高脂肪食物，以及适当的进行运动调整血糖指数。"
    },
    {
        "q": "六味地黄丸糖尿病患者可以服用吗",
        "a": "六味地黄丸是否适合糖尿病的患者服用，需要根据病人的具体病情来进行判断，如果糖尿病的患者在出现有肾阴虚的情况下，是可以服用六味地黄丸来进行治疗的，这种药物具有良好的改善肾阴虚的作用，而且也具有一定的消渴作用，比较适合出现有肾阴虚糖尿病患者服用。"
    },
    {
        "q": "妊娠期糖尿病筛查可以喝水吗",
        "a": "妊娠期糖尿病筛前可以喝水不会影响到筛查结果，只要不是喝高糖的水。在筛查中孕妇不要有过于剧烈运动，避免影响到检测结果。妊娠期糖尿病筛服糖后1个小时的血糖小于等于10.0mmol/L，餐后2小时血糖大于等于8.5mmol/L，只要一项满足就可以确诊妊娠期糖尿病。"
    },
    {
        "q": "空腹血糖6.4。饭后2小时血糖是6.5",
        "a": "空腹血糖6.4饭后两小时血糖6.5是正常的。空腹血糖6.4说明空腹血糖是稍微偏高的状态，正常空腹血糖值在3.9~6.1毫摩尔每升。如果空腹血糖大于6.9毫摩尔每升时，考虑患有糖尿病的可能。饭后两小时血糖6.5处于饭后两小时血糖正常值范围4.4-7.8毫摩尔每升当中，所以处于正常范围。如果饭后两小时血糖超过7.8毫摩尔每升，那么属于糖尿病。"
    },
    {
        "q": "患糖尿病怎么治最好",
        "a": "糖尿病属于一种慢性的疾病，也是一种无法治疗痊愈的疾病，需要进行综合性的治疗，首先要控制饮食，少吃含糖比较高的食物，另外也要进行运动治疗，做好血糖的自我监测和糖尿病的管理，要戒烟戒酒，也要点减轻体重，经过这些调理之后，效果不是太好，可以在医生的医嘱下采取降糖的药物来进行治疗，主要包括口服用药和胰岛素。"
    },
    {
        "q": "格列本脲片与盐酸二甲双胍片可以同吃吗",
        "a": "以上这两种药物都是属于降血糖的药物，是否可以同时服用，主要应该根据血糖的数值以及机体的具体症状，在医生指导下进行选择。如果单纯性服用二甲双胍，这一种药物血糖不能够控制，可以配合格列本脲片进行治疗的，应该先从小剂量的添加，及时测量血糖。目的是稳定血糖。"
    },
    {
        "q": "糖尿病并发症有哪些症状？",
        "a": "糖尿病是一种以高血糖为主的代谢性的疾病，它的并发症是非常多的，主要有急性的并发症和慢性的并发症，急性并发症，包括酮症酸中毒和高血糖高渗性昏迷，慢性的病程是主要包括糖尿病肾病，糖尿病视网膜病和糖尿病足，有了糖尿病之后，机体的抵抗能力比较低下，很容易引起感染。"
    },
    {
        "q": "妊娠期糖尿病能吃什么零食",
        "a": "妊娠期糖尿病的患者平时可以将苹果、猕猴桃、柚子等一些水果作为零食。女性在怀孕期间很容易出现内分泌功能的失调，这个时候就会诱发出现糖尿病的情况。怀孕中的女性最好不要吃一些含糖量过高的零食，否则会引起血糖水平的波动，从而导致胎儿生长发育异常，产生严重的后果。"
    },
    {
        "q": "孕妇糖尿病吃什么能降血糖",
        "a": "如果是在怀孕期间的女性在进行糖耐量测试的时候，明显出现血糖偏高，这种情况一般是先生活调理控制血糖，如果无法把血糖控制好，可能需要使用胰岛素的，因为在怀孕期间如果是出现妊娠期糖尿病，这个一般不建议通过使用降糖药物来进行控制，因为这些药物的使用有可能会通过胎盘影响胎儿发育。"
    },
    {
        "q": "糖尿病人能吃老南瓜蒸饭吗",
        "a": "糖尿病人不能够吃老南瓜，老南瓜是含糖分比较多的食物。实在想吃时可以减少主食的用量，糖尿病人同时不能够吃地瓜、芋头、地瓜类。因为这类食物淀粉含量都比较高，会影响血糖。糖尿病人平时要多吃含纤维素多的新鲜蔬菜，如芹菜，油菜，白菜，平时饮食要定时定量，粗细搭配，荤素结合。"
    }
]